const address = [{
        "value": "北京市",
        "label": "北京市",
        "num": "110000",
        "children": [{
            "value": "北京市",
            "label": "北京市",
            "num": "110100",
            "children": [{
                    "value": "东城区",
                    "label": "东城区",
                    "num": "110101"
                },
                {
                    "value": "西城区",
                    "label": "西城区",
                    "num": "110102"
                },
                {
                    "value": "朝阳区",
                    "label": "朝阳区",
                    "num": "110105"
                },
                {
                    "value": "丰台区",
                    "label": "丰台区",
                    "num": "110106"
                },
                {
                    "value": "石景山区",
                    "label": "石景山区",
                    "num": "110107"
                },
                {
                    "value": "海淀区",
                    "label": "海淀区",
                    "num": "110108"
                },
                {
                    "value": "门头沟区",
                    "label": "门头沟区",
                    "num": "110109"
                },
                {
                    "value": "房山区",
                    "label": "房山区",
                    "num": "110111"
                },
                {
                    "value": "通州区",
                    "label": "通州区",
                    "num": "110112"
                },
                {
                    "value": "顺义区",
                    "label": "顺义区",
                    "num": "110113"
                },
                {
                    "value": "昌平区",
                    "label": "昌平区",
                    "num": "110114"
                },
                {
                    "value": "大兴区",
                    "label": "大兴区",
                    "num": "110115"
                },
                {
                    "value": "怀柔区",
                    "label": "怀柔区",
                    "num": "110116"
                },
                {
                    "value": "平谷区",
                    "label": "平谷区",
                    "num": "110117"
                },
                {
                    "value": "密云区",
                    "label": "密云区",
                    "num": "110118"
                },
                {
                    "value": "延庆区",
                    "label": "延庆区",
                    "num": "110119"
                }
            ]
        }]
    },
    {
        "value": "天津市",
        "label": "天津市",
        "num": "120000",
        "children": [{
            "value": "天津市",
            "label": "天津市",
            "num": "120100",
            "children": [{
                    "value": "和平区",
                    "label": "和平区",
                    "num": "120101"
                },
                {
                    "value": "河东区",
                    "label": "河东区",
                    "num": "120102"
                },
                {
                    "value": "河西区",
                    "label": "河西区",
                    "num": "120103"
                },
                {
                    "value": "南开区",
                    "label": "南开区",
                    "num": "120104"
                },
                {
                    "value": "河北区",
                    "label": "河北区",
                    "num": "120105"
                },
                {
                    "value": "红桥区",
                    "label": "红桥区",
                    "num": "120106"
                },
                {
                    "value": "东丽区",
                    "label": "东丽区",
                    "num": "120110"
                },
                {
                    "value": "西青区",
                    "label": "西青区",
                    "num": "120111"
                },
                {
                    "value": "津南区",
                    "label": "津南区",
                    "num": "120112"
                },
                {
                    "value": "北辰区",
                    "label": "北辰区",
                    "num": "120113"
                },
                {
                    "value": "武清区",
                    "label": "武清区",
                    "num": "120114"
                },
                {
                    "value": "宝坻区",
                    "label": "宝坻区",
                    "num": "120115"
                },
                {
                    "value": "滨海新区",
                    "label": "滨海新区",
                    "num": "120116"
                },
                {
                    "value": "宁河区",
                    "label": "宁河区",
                    "num": "120117"
                },
                {
                    "value": "静海区",
                    "label": "静海区",
                    "num": "120118"
                },
                {
                    "value": "蓟州区",
                    "label": "蓟州区",
                    "num": "120119"
                }
            ]
        }]
    },
    {
        "value": "河北省",
        "label": "河北省",
        "num": "130000",
        "children": [{
                "value": "石家庄市",
                "label": "石家庄市",
                "num": "130100",
                "children": [{
                        "value": "长安区",
                        "label": "长安区",
                        "num": "130102"
                    },
                    {
                        "value": "桥西区",
                        "label": "桥西区",
                        "num": "130104"
                    },
                    {
                        "value": "新华区",
                        "label": "新华区",
                        "num": "130105"
                    },
                    {
                        "value": "井陉矿区",
                        "label": "井陉矿区",
                        "num": "130107"
                    },
                    {
                        "value": "裕华区",
                        "label": "裕华区",
                        "num": "130108"
                    },
                    {
                        "value": "藁城区",
                        "label": "藁城区",
                        "num": "130109"
                    },
                    {
                        "value": "鹿泉区",
                        "label": "鹿泉区",
                        "num": "130110"
                    },
                    {
                        "value": "栾城区",
                        "label": "栾城区",
                        "num": "130111"
                    },
                    {
                        "value": "井陉县",
                        "label": "井陉县",
                        "num": "130121"
                    },
                    {
                        "value": "正定县",
                        "label": "正定县",
                        "num": "130123"
                    },
                    {
                        "value": "行唐县",
                        "label": "行唐县",
                        "num": "130125"
                    },
                    {
                        "value": "灵寿县",
                        "label": "灵寿县",
                        "num": "130126"
                    },
                    {
                        "value": "高邑县",
                        "label": "高邑县",
                        "num": "130127"
                    },
                    {
                        "value": "深泽县",
                        "label": "深泽县",
                        "num": "130128"
                    },
                    {
                        "value": "赞皇县",
                        "label": "赞皇县",
                        "num": "130129"
                    },
                    {
                        "value": "无极县",
                        "label": "无极县",
                        "num": "130130"
                    },
                    {
                        "value": "平山县",
                        "label": "平山县",
                        "num": "130131"
                    },
                    {
                        "value": "元氏县",
                        "label": "元氏县",
                        "num": "130132"
                    },
                    {
                        "value": "赵县",
                        "label": "赵县",
                        "num": "130133"
                    },
                    {
                        "value": "辛集市",
                        "label": "辛集市",
                        "num": "130181"
                    },
                    {
                        "value": "晋州市",
                        "label": "晋州市",
                        "num": "130183"
                    },
                    {
                        "value": "新乐市",
                        "label": "新乐市",
                        "num": "130184"
                    }
                ]
            },
            {
                "value": "唐山市",
                "label": "唐山市",
                "num": "130200",
                "children": [{
                        "value": "路南区",
                        "label": "路南区",
                        "num": "130202"
                    },
                    {
                        "value": "路北区",
                        "label": "路北区",
                        "num": "130203"
                    },
                    {
                        "value": "古冶区",
                        "label": "古冶区",
                        "num": "130204"
                    },
                    {
                        "value": "开平区",
                        "label": "开平区",
                        "num": "130205"
                    },
                    {
                        "value": "丰南区",
                        "label": "丰南区",
                        "num": "130207"
                    },
                    {
                        "value": "丰润区",
                        "label": "丰润区",
                        "num": "130208"
                    },
                    {
                        "value": "曹妃甸区",
                        "label": "曹妃甸区",
                        "num": "130209"
                    },
                    {
                        "value": "滦南县",
                        "label": "滦南县",
                        "num": "130224"
                    },
                    {
                        "value": "乐亭县",
                        "label": "乐亭县",
                        "num": "130225"
                    },
                    {
                        "value": "迁西县",
                        "label": "迁西县",
                        "num": "130227"
                    },
                    {
                        "value": "玉田县",
                        "label": "玉田县",
                        "num": "130229"
                    },
                    {
                        "value": "遵化市",
                        "label": "遵化市",
                        "num": "130281"
                    },
                    {
                        "value": "迁安市",
                        "label": "迁安市",
                        "num": "130283"
                    },
                    {
                        "value": "滦州市",
                        "label": "滦州市",
                        "num": "130284"
                    }
                ]
            },
            {
                "value": "秦皇岛市",
                "label": "秦皇岛市",
                "num": "130300",
                "children": [{
                        "value": "海港区",
                        "label": "海港区",
                        "num": "130302"
                    },
                    {
                        "value": "山海关区",
                        "label": "山海关区",
                        "num": "130303"
                    },
                    {
                        "value": "北戴河区",
                        "label": "北戴河区",
                        "num": "130304"
                    },
                    {
                        "value": "抚宁区",
                        "label": "抚宁区",
                        "num": "130306"
                    },
                    {
                        "value": "青龙满族自治县",
                        "label": "青龙满族自治县",
                        "num": "130321"
                    },
                    {
                        "value": "昌黎县",
                        "label": "昌黎县",
                        "num": "130322"
                    },
                    {
                        "value": "卢龙县",
                        "label": "卢龙县",
                        "num": "130324"
                    },
                    {
                        "value": "经济技术开发区",
                        "label": "经济技术开发区",
                        "num": "130390"
                    }
                ]
            },
            {
                "value": "邯郸市",
                "label": "邯郸市",
                "num": "130400",
                "children": [{
                        "value": "邯山区",
                        "label": "邯山区",
                        "num": "130402"
                    },
                    {
                        "value": "丛台区",
                        "label": "丛台区",
                        "num": "130403"
                    },
                    {
                        "value": "复兴区",
                        "label": "复兴区",
                        "num": "130404"
                    },
                    {
                        "value": "峰峰矿区",
                        "label": "峰峰矿区",
                        "num": "130406"
                    },
                    {
                        "value": "肥乡区",
                        "label": "肥乡区",
                        "num": "130407"
                    },
                    {
                        "value": "永年区",
                        "label": "永年区",
                        "num": "130408"
                    },
                    {
                        "value": "临漳县",
                        "label": "临漳县",
                        "num": "130423"
                    },
                    {
                        "value": "成安县",
                        "label": "成安县",
                        "num": "130424"
                    },
                    {
                        "value": "大名县",
                        "label": "大名县",
                        "num": "130425"
                    },
                    {
                        "value": "涉县",
                        "label": "涉县",
                        "num": "130426"
                    },
                    {
                        "value": "磁县",
                        "label": "磁县",
                        "num": "130427"
                    },
                    {
                        "value": "邱县",
                        "label": "邱县",
                        "num": "130430"
                    },
                    {
                        "value": "鸡泽县",
                        "label": "鸡泽县",
                        "num": "130431"
                    },
                    {
                        "value": "广平县",
                        "label": "广平县",
                        "num": "130432"
                    },
                    {
                        "value": "馆陶县",
                        "label": "馆陶县",
                        "num": "130433"
                    },
                    {
                        "value": "魏县",
                        "label": "魏县",
                        "num": "130434"
                    },
                    {
                        "value": "曲周县",
                        "label": "曲周县",
                        "num": "130435"
                    },
                    {
                        "value": "武安市",
                        "label": "武安市",
                        "num": "130481"
                    }
                ]
            },
            {
                "value": "邢台市",
                "label": "邢台市",
                "num": "130500",
                "children": [{
                        "value": "桥东区",
                        "label": "桥东区",
                        "num": "130502"
                    },
                    {
                        "value": "桥西区",
                        "label": "桥西区",
                        "num": "130503"
                    },
                    {
                        "value": "邢台县",
                        "label": "邢台县",
                        "num": "130521"
                    },
                    {
                        "value": "临城县",
                        "label": "临城县",
                        "num": "130522"
                    },
                    {
                        "value": "内丘县",
                        "label": "内丘县",
                        "num": "130523"
                    },
                    {
                        "value": "柏乡县",
                        "label": "柏乡县",
                        "num": "130524"
                    },
                    {
                        "value": "隆尧县",
                        "label": "隆尧县",
                        "num": "130525"
                    },
                    {
                        "value": "任县",
                        "label": "任县",
                        "num": "130526"
                    },
                    {
                        "value": "南和县",
                        "label": "南和县",
                        "num": "130527"
                    },
                    {
                        "value": "宁晋县",
                        "label": "宁晋县",
                        "num": "130528"
                    },
                    {
                        "value": "巨鹿县",
                        "label": "巨鹿县",
                        "num": "130529"
                    },
                    {
                        "value": "新河县",
                        "label": "新河县",
                        "num": "130530"
                    },
                    {
                        "value": "广宗县",
                        "label": "广宗县",
                        "num": "130531"
                    },
                    {
                        "value": "平乡县",
                        "label": "平乡县",
                        "num": "130532"
                    },
                    {
                        "value": "威县",
                        "label": "威县",
                        "num": "130533"
                    },
                    {
                        "value": "清河县",
                        "label": "清河县",
                        "num": "130534"
                    },
                    {
                        "value": "临西县",
                        "label": "临西县",
                        "num": "130535"
                    },
                    {
                        "value": "南宫市",
                        "label": "南宫市",
                        "num": "130581"
                    },
                    {
                        "value": "沙河市",
                        "label": "沙河市",
                        "num": "130582"
                    }
                ]
            },
            {
                "value": "保定市",
                "label": "保定市",
                "num": "130600",
                "children": [{
                        "value": "竞秀区",
                        "label": "竞秀区",
                        "num": "130602"
                    },
                    {
                        "value": "莲池区",
                        "label": "莲池区",
                        "num": "130606"
                    },
                    {
                        "value": "满城区",
                        "label": "满城区",
                        "num": "130607"
                    },
                    {
                        "value": "清苑区",
                        "label": "清苑区",
                        "num": "130608"
                    },
                    {
                        "value": "徐水区",
                        "label": "徐水区",
                        "num": "130609"
                    },
                    {
                        "value": "涞水县",
                        "label": "涞水县",
                        "num": "130623"
                    },
                    {
                        "value": "阜平县",
                        "label": "阜平县",
                        "num": "130624"
                    },
                    {
                        "value": "定兴县",
                        "label": "定兴县",
                        "num": "130626"
                    },
                    {
                        "value": "唐县",
                        "label": "唐县",
                        "num": "130627"
                    },
                    {
                        "value": "高阳县",
                        "label": "高阳县",
                        "num": "130628"
                    },
                    {
                        "value": "容城县",
                        "label": "容城县",
                        "num": "130629"
                    },
                    {
                        "value": "涞源县",
                        "label": "涞源县",
                        "num": "130630"
                    },
                    {
                        "value": "望都县",
                        "label": "望都县",
                        "num": "130631"
                    },
                    {
                        "value": "安新县",
                        "label": "安新县",
                        "num": "130632"
                    },
                    {
                        "value": "易县",
                        "label": "易县",
                        "num": "130633"
                    },
                    {
                        "value": "曲阳县",
                        "label": "曲阳县",
                        "num": "130634"
                    },
                    {
                        "value": "蠡县",
                        "label": "蠡县",
                        "num": "130635"
                    },
                    {
                        "value": "顺平县",
                        "label": "顺平县",
                        "num": "130636"
                    },
                    {
                        "value": "博野县",
                        "label": "博野县",
                        "num": "130637"
                    },
                    {
                        "value": "雄县",
                        "label": "雄县",
                        "num": "130638"
                    },
                    {
                        "value": "涿州市",
                        "label": "涿州市",
                        "num": "130681"
                    },
                    {
                        "value": "定州市",
                        "label": "定州市",
                        "num": "130682"
                    },
                    {
                        "value": "安国市",
                        "label": "安国市",
                        "num": "130683"
                    },
                    {
                        "value": "高碑店市",
                        "label": "高碑店市",
                        "num": "130684"
                    }
                ]
            },
            {
                "value": "张家口市",
                "label": "张家口市",
                "num": "130700",
                "children": [{
                        "value": "桥东区",
                        "label": "桥东区",
                        "num": "130702"
                    },
                    {
                        "value": "桥西区",
                        "label": "桥西区",
                        "num": "130703"
                    },
                    {
                        "value": "宣化区",
                        "label": "宣化区",
                        "num": "130705"
                    },
                    {
                        "value": "下花园区",
                        "label": "下花园区",
                        "num": "130706"
                    },
                    {
                        "value": "万全区",
                        "label": "万全区",
                        "num": "130708"
                    },
                    {
                        "value": "崇礼区",
                        "label": "崇礼区",
                        "num": "130709"
                    },
                    {
                        "value": "张北县",
                        "label": "张北县",
                        "num": "130722"
                    },
                    {
                        "value": "康保县",
                        "label": "康保县",
                        "num": "130723"
                    },
                    {
                        "value": "沽源县",
                        "label": "沽源县",
                        "num": "130724"
                    },
                    {
                        "value": "尚义县",
                        "label": "尚义县",
                        "num": "130725"
                    },
                    {
                        "value": "蔚县",
                        "label": "蔚县",
                        "num": "130726"
                    },
                    {
                        "value": "阳原县",
                        "label": "阳原县",
                        "num": "130727"
                    },
                    {
                        "value": "怀安县",
                        "label": "怀安县",
                        "num": "130728"
                    },
                    {
                        "value": "怀来县",
                        "label": "怀来县",
                        "num": "130730"
                    },
                    {
                        "value": "涿鹿县",
                        "label": "涿鹿县",
                        "num": "130731"
                    },
                    {
                        "value": "赤城县",
                        "label": "赤城县",
                        "num": "130732"
                    }
                ]
            },
            {
                "value": "承德市",
                "label": "承德市",
                "num": "130800",
                "children": [{
                        "value": "双桥区",
                        "label": "双桥区",
                        "num": "130802"
                    },
                    {
                        "value": "双滦区",
                        "label": "双滦区",
                        "num": "130803"
                    },
                    {
                        "value": "鹰手营子矿区",
                        "label": "鹰手营子矿区",
                        "num": "130804"
                    },
                    {
                        "value": "承德县",
                        "label": "承德县",
                        "num": "130821"
                    },
                    {
                        "value": "兴隆县",
                        "label": "兴隆县",
                        "num": "130822"
                    },
                    {
                        "value": "滦平县",
                        "label": "滦平县",
                        "num": "130824"
                    },
                    {
                        "value": "隆化县",
                        "label": "隆化县",
                        "num": "130825"
                    },
                    {
                        "value": "丰宁满族自治县",
                        "label": "丰宁满族自治县",
                        "num": "130826"
                    },
                    {
                        "value": "宽城满族自治县",
                        "label": "宽城满族自治县",
                        "num": "130827"
                    },
                    {
                        "value": "围场满族蒙古族自治县",
                        "label": "围场满族蒙古族自治县",
                        "num": "130828"
                    },
                    {
                        "value": "平泉市",
                        "label": "平泉市",
                        "num": "130881"
                    }
                ]
            },
            {
                "value": "沧州市",
                "label": "沧州市",
                "num": "130900",
                "children": [{
                        "value": "新华区",
                        "label": "新华区",
                        "num": "130902"
                    },
                    {
                        "value": "运河区",
                        "label": "运河区",
                        "num": "130903"
                    },
                    {
                        "value": "沧县",
                        "label": "沧县",
                        "num": "130921"
                    },
                    {
                        "value": "青县",
                        "label": "青县",
                        "num": "130922"
                    },
                    {
                        "value": "东光县",
                        "label": "东光县",
                        "num": "130923"
                    },
                    {
                        "value": "海兴县",
                        "label": "海兴县",
                        "num": "130924"
                    },
                    {
                        "value": "盐山县",
                        "label": "盐山县",
                        "num": "130925"
                    },
                    {
                        "value": "肃宁县",
                        "label": "肃宁县",
                        "num": "130926"
                    },
                    {
                        "value": "南皮县",
                        "label": "南皮县",
                        "num": "130927"
                    },
                    {
                        "value": "吴桥县",
                        "label": "吴桥县",
                        "num": "130928"
                    },
                    {
                        "value": "献县",
                        "label": "献县",
                        "num": "130929"
                    },
                    {
                        "value": "孟村回族自治县",
                        "label": "孟村回族自治县",
                        "num": "130930"
                    },
                    {
                        "value": "泊头市",
                        "label": "泊头市",
                        "num": "130981"
                    },
                    {
                        "value": "任丘市",
                        "label": "任丘市",
                        "num": "130982"
                    },
                    {
                        "value": "黄骅市",
                        "label": "黄骅市",
                        "num": "130983"
                    },
                    {
                        "value": "河间市",
                        "label": "河间市",
                        "num": "130984"
                    }
                ]
            },
            {
                "value": "廊坊市",
                "label": "廊坊市",
                "num": "131000",
                "children": [{
                        "value": "安次区",
                        "label": "安次区",
                        "num": "131002"
                    },
                    {
                        "value": "广阳区",
                        "label": "广阳区",
                        "num": "131003"
                    },
                    {
                        "value": "固安县",
                        "label": "固安县",
                        "num": "131022"
                    },
                    {
                        "value": "永清县",
                        "label": "永清县",
                        "num": "131023"
                    },
                    {
                        "value": "香河县",
                        "label": "香河县",
                        "num": "131024"
                    },
                    {
                        "value": "大城县",
                        "label": "大城县",
                        "num": "131025"
                    },
                    {
                        "value": "文安县",
                        "label": "文安县",
                        "num": "131026"
                    },
                    {
                        "value": "大厂回族自治县",
                        "label": "大厂回族自治县",
                        "num": "131028"
                    },
                    {
                        "value": "霸州市",
                        "label": "霸州市",
                        "num": "131081"
                    },
                    {
                        "value": "三河市",
                        "label": "三河市",
                        "num": "131082"
                    },
                    {
                        "value": "开发区",
                        "label": "开发区",
                        "num": "131090"
                    }
                ]
            },
            {
                "value": "衡水市",
                "label": "衡水市",
                "num": "131100",
                "children": [{
                        "value": "桃城区",
                        "label": "桃城区",
                        "num": "131102"
                    },
                    {
                        "value": "冀州区",
                        "label": "冀州区",
                        "num": "131103"
                    },
                    {
                        "value": "枣强县",
                        "label": "枣强县",
                        "num": "131121"
                    },
                    {
                        "value": "武邑县",
                        "label": "武邑县",
                        "num": "131122"
                    },
                    {
                        "value": "武强县",
                        "label": "武强县",
                        "num": "131123"
                    },
                    {
                        "value": "饶阳县",
                        "label": "饶阳县",
                        "num": "131124"
                    },
                    {
                        "value": "安平县",
                        "label": "安平县",
                        "num": "131125"
                    },
                    {
                        "value": "故城县",
                        "label": "故城县",
                        "num": "131126"
                    },
                    {
                        "value": "景县",
                        "label": "景县",
                        "num": "131127"
                    },
                    {
                        "value": "阜城县",
                        "label": "阜城县",
                        "num": "131128"
                    },
                    {
                        "value": "深州市",
                        "label": "深州市",
                        "num": "131182"
                    }
                ]
            }
        ]
    },
    {
        "value": "山西省",
        "label": "山西省",
        "num": "140000",
        "children": [{
                "value": "太原市",
                "label": "太原市",
                "num": "140100",
                "children": [{
                        "value": "小店区",
                        "label": "小店区",
                        "num": "140105"
                    },
                    {
                        "value": "迎泽区",
                        "label": "迎泽区",
                        "num": "140106"
                    },
                    {
                        "value": "杏花岭区",
                        "label": "杏花岭区",
                        "num": "140107"
                    },
                    {
                        "value": "尖草坪区",
                        "label": "尖草坪区",
                        "num": "140108"
                    },
                    {
                        "value": "万柏林区",
                        "label": "万柏林区",
                        "num": "140109"
                    },
                    {
                        "value": "晋源区",
                        "label": "晋源区",
                        "num": "140110"
                    },
                    {
                        "value": "清徐县",
                        "label": "清徐县",
                        "num": "140121"
                    },
                    {
                        "value": "阳曲县",
                        "label": "阳曲县",
                        "num": "140122"
                    },
                    {
                        "value": "娄烦县",
                        "label": "娄烦县",
                        "num": "140123"
                    },
                    {
                        "value": "古交市",
                        "label": "古交市",
                        "num": "140181"
                    }
                ]
            },
            {
                "value": "大同市",
                "label": "大同市",
                "num": "140200",
                "children": [{
                        "value": "新荣区",
                        "label": "新荣区",
                        "num": "140212"
                    },
                    {
                        "value": "平城区",
                        "label": "平城区",
                        "num": "140213"
                    },
                    {
                        "value": "云冈区",
                        "label": "云冈区",
                        "num": "140214"
                    },
                    {
                        "value": "云州区",
                        "label": "云州区",
                        "num": "140215"
                    },
                    {
                        "value": "阳高县",
                        "label": "阳高县",
                        "num": "140221"
                    },
                    {
                        "value": "天镇县",
                        "label": "天镇县",
                        "num": "140222"
                    },
                    {
                        "value": "广灵县",
                        "label": "广灵县",
                        "num": "140223"
                    },
                    {
                        "value": "灵丘县",
                        "label": "灵丘县",
                        "num": "140224"
                    },
                    {
                        "value": "浑源县",
                        "label": "浑源县",
                        "num": "140225"
                    },
                    {
                        "value": "左云县",
                        "label": "左云县",
                        "num": "140226"
                    }
                ]
            },
            {
                "value": "阳泉市",
                "label": "阳泉市",
                "num": "140300",
                "children": [{
                        "value": "城区",
                        "label": "城区",
                        "num": "140302"
                    },
                    {
                        "value": "矿区",
                        "label": "矿区",
                        "num": "140303"
                    },
                    {
                        "value": "郊区",
                        "label": "郊区",
                        "num": "140311"
                    },
                    {
                        "value": "平定县",
                        "label": "平定县",
                        "num": "140321"
                    },
                    {
                        "value": "盂县",
                        "label": "盂县",
                        "num": "140322"
                    }
                ]
            },
            {
                "value": "长治市",
                "label": "长治市",
                "num": "140400",
                "children": [{
                        "value": "潞州区",
                        "label": "潞州区",
                        "num": "140403"
                    },
                    {
                        "value": "上党区",
                        "label": "上党区",
                        "num": "140404"
                    },
                    {
                        "value": "屯留区",
                        "label": "屯留区",
                        "num": "140405"
                    },
                    {
                        "value": "潞城区",
                        "label": "潞城区",
                        "num": "140406"
                    },
                    {
                        "value": "襄垣县",
                        "label": "襄垣县",
                        "num": "140423"
                    },
                    {
                        "value": "平顺县",
                        "label": "平顺县",
                        "num": "140425"
                    },
                    {
                        "value": "黎城县",
                        "label": "黎城县",
                        "num": "140426"
                    },
                    {
                        "value": "壶关县",
                        "label": "壶关县",
                        "num": "140427"
                    },
                    {
                        "value": "长子县",
                        "label": "长子县",
                        "num": "140428"
                    },
                    {
                        "value": "武乡县",
                        "label": "武乡县",
                        "num": "140429"
                    },
                    {
                        "value": "沁县",
                        "label": "沁县",
                        "num": "140430"
                    },
                    {
                        "value": "沁源县",
                        "label": "沁源县",
                        "num": "140431"
                    }
                ]
            },
            {
                "value": "晋城市",
                "label": "晋城市",
                "num": "140500",
                "children": [{
                        "value": "城区",
                        "label": "城区",
                        "num": "140502"
                    },
                    {
                        "value": "沁水县",
                        "label": "沁水县",
                        "num": "140521"
                    },
                    {
                        "value": "阳城县",
                        "label": "阳城县",
                        "num": "140522"
                    },
                    {
                        "value": "陵川县",
                        "label": "陵川县",
                        "num": "140524"
                    },
                    {
                        "value": "泽州县",
                        "label": "泽州县",
                        "num": "140525"
                    },
                    {
                        "value": "高平市",
                        "label": "高平市",
                        "num": "140581"
                    }
                ]
            },
            {
                "value": "朔州市",
                "label": "朔州市",
                "num": "140600",
                "children": [{
                        "value": "朔城区",
                        "label": "朔城区",
                        "num": "140602"
                    },
                    {
                        "value": "平鲁区",
                        "label": "平鲁区",
                        "num": "140603"
                    },
                    {
                        "value": "山阴县",
                        "label": "山阴县",
                        "num": "140621"
                    },
                    {
                        "value": "应县",
                        "label": "应县",
                        "num": "140622"
                    },
                    {
                        "value": "右玉县",
                        "label": "右玉县",
                        "num": "140623"
                    },
                    {
                        "value": "怀仁市",
                        "label": "怀仁市",
                        "num": "140681"
                    }
                ]
            },
            {
                "value": "晋中市",
                "label": "晋中市",
                "num": "140700",
                "children": [{
                        "value": "榆次区",
                        "label": "榆次区",
                        "num": "140702"
                    },
                    {
                        "value": "榆社县",
                        "label": "榆社县",
                        "num": "140721"
                    },
                    {
                        "value": "左权县",
                        "label": "左权县",
                        "num": "140722"
                    },
                    {
                        "value": "和顺县",
                        "label": "和顺县",
                        "num": "140723"
                    },
                    {
                        "value": "昔阳县",
                        "label": "昔阳县",
                        "num": "140724"
                    },
                    {
                        "value": "寿阳县",
                        "label": "寿阳县",
                        "num": "140725"
                    },
                    {
                        "value": "太谷县",
                        "label": "太谷县",
                        "num": "140726"
                    },
                    {
                        "value": "祁县",
                        "label": "祁县",
                        "num": "140727"
                    },
                    {
                        "value": "平遥县",
                        "label": "平遥县",
                        "num": "140728"
                    },
                    {
                        "value": "灵石县",
                        "label": "灵石县",
                        "num": "140729"
                    },
                    {
                        "value": "介休市",
                        "label": "介休市",
                        "num": "140781"
                    }
                ]
            },
            {
                "value": "运城市",
                "label": "运城市",
                "num": "140800",
                "children": [{
                        "value": "盐湖区",
                        "label": "盐湖区",
                        "num": "140802"
                    },
                    {
                        "value": "临猗县",
                        "label": "临猗县",
                        "num": "140821"
                    },
                    {
                        "value": "万荣县",
                        "label": "万荣县",
                        "num": "140822"
                    },
                    {
                        "value": "闻喜县",
                        "label": "闻喜县",
                        "num": "140823"
                    },
                    {
                        "value": "稷山县",
                        "label": "稷山县",
                        "num": "140824"
                    },
                    {
                        "value": "新绛县",
                        "label": "新绛县",
                        "num": "140825"
                    },
                    {
                        "value": "绛县",
                        "label": "绛县",
                        "num": "140826"
                    },
                    {
                        "value": "垣曲县",
                        "label": "垣曲县",
                        "num": "140827"
                    },
                    {
                        "value": "夏县",
                        "label": "夏县",
                        "num": "140828"
                    },
                    {
                        "value": "平陆县",
                        "label": "平陆县",
                        "num": "140829"
                    },
                    {
                        "value": "芮城县",
                        "label": "芮城县",
                        "num": "140830"
                    },
                    {
                        "value": "永济市",
                        "label": "永济市",
                        "num": "140881"
                    },
                    {
                        "value": "河津市",
                        "label": "河津市",
                        "num": "140882"
                    }
                ]
            },
            {
                "value": "忻州市",
                "label": "忻州市",
                "num": "140900",
                "children": [{
                        "value": "忻府区",
                        "label": "忻府区",
                        "num": "140902"
                    },
                    {
                        "value": "定襄县",
                        "label": "定襄县",
                        "num": "140921"
                    },
                    {
                        "value": "五台县",
                        "label": "五台县",
                        "num": "140922"
                    },
                    {
                        "value": "代县",
                        "label": "代县",
                        "num": "140923"
                    },
                    {
                        "value": "繁峙县",
                        "label": "繁峙县",
                        "num": "140924"
                    },
                    {
                        "value": "宁武县",
                        "label": "宁武县",
                        "num": "140925"
                    },
                    {
                        "value": "静乐县",
                        "label": "静乐县",
                        "num": "140926"
                    },
                    {
                        "value": "神池县",
                        "label": "神池县",
                        "num": "140927"
                    },
                    {
                        "value": "五寨县",
                        "label": "五寨县",
                        "num": "140928"
                    },
                    {
                        "value": "岢岚县",
                        "label": "岢岚县",
                        "num": "140929"
                    },
                    {
                        "value": "河曲县",
                        "label": "河曲县",
                        "num": "140930"
                    },
                    {
                        "value": "保德县",
                        "label": "保德县",
                        "num": "140931"
                    },
                    {
                        "value": "偏关县",
                        "label": "偏关县",
                        "num": "140932"
                    },
                    {
                        "value": "原平市",
                        "label": "原平市",
                        "num": "140981"
                    }
                ]
            },
            {
                "value": "临汾市",
                "label": "临汾市",
                "num": "141000",
                "children": [{
                        "value": "尧都区",
                        "label": "尧都区",
                        "num": "141002"
                    },
                    {
                        "value": "曲沃县",
                        "label": "曲沃县",
                        "num": "141021"
                    },
                    {
                        "value": "翼城县",
                        "label": "翼城县",
                        "num": "141022"
                    },
                    {
                        "value": "襄汾县",
                        "label": "襄汾县",
                        "num": "141023"
                    },
                    {
                        "value": "洪洞县",
                        "label": "洪洞县",
                        "num": "141024"
                    },
                    {
                        "value": "古县",
                        "label": "古县",
                        "num": "141025"
                    },
                    {
                        "value": "安泽县",
                        "label": "安泽县",
                        "num": "141026"
                    },
                    {
                        "value": "浮山县",
                        "label": "浮山县",
                        "num": "141027"
                    },
                    {
                        "value": "吉县",
                        "label": "吉县",
                        "num": "141028"
                    },
                    {
                        "value": "乡宁县",
                        "label": "乡宁县",
                        "num": "141029"
                    },
                    {
                        "value": "大宁县",
                        "label": "大宁县",
                        "num": "141030"
                    },
                    {
                        "value": "隰县",
                        "label": "隰县",
                        "num": "141031"
                    },
                    {
                        "value": "永和县",
                        "label": "永和县",
                        "num": "141032"
                    },
                    {
                        "value": "蒲县",
                        "label": "蒲县",
                        "num": "141033"
                    },
                    {
                        "value": "汾西县",
                        "label": "汾西县",
                        "num": "141034"
                    },
                    {
                        "value": "侯马市",
                        "label": "侯马市",
                        "num": "141081"
                    },
                    {
                        "value": "霍州市",
                        "label": "霍州市",
                        "num": "141082"
                    }
                ]
            },
            {
                "value": "吕梁市",
                "label": "吕梁市",
                "num": "141100",
                "children": [{
                        "value": "离石区",
                        "label": "离石区",
                        "num": "141102"
                    },
                    {
                        "value": "文水县",
                        "label": "文水县",
                        "num": "141121"
                    },
                    {
                        "value": "交城县",
                        "label": "交城县",
                        "num": "141122"
                    },
                    {
                        "value": "兴县",
                        "label": "兴县",
                        "num": "141123"
                    },
                    {
                        "value": "临县",
                        "label": "临县",
                        "num": "141124"
                    },
                    {
                        "value": "柳林县",
                        "label": "柳林县",
                        "num": "141125"
                    },
                    {
                        "value": "石楼县",
                        "label": "石楼县",
                        "num": "141126"
                    },
                    {
                        "value": "岚县",
                        "label": "岚县",
                        "num": "141127"
                    },
                    {
                        "value": "方山县",
                        "label": "方山县",
                        "num": "141128"
                    },
                    {
                        "value": "中阳县",
                        "label": "中阳县",
                        "num": "141129"
                    },
                    {
                        "value": "交口县",
                        "label": "交口县",
                        "num": "141130"
                    },
                    {
                        "value": "孝义市",
                        "label": "孝义市",
                        "num": "141181"
                    },
                    {
                        "value": "汾阳市",
                        "label": "汾阳市",
                        "num": "141182"
                    }
                ]
            }
        ]
    },
    {
        "value": "内蒙古自治区",
        "label": "内蒙古自治区",
        "num": "150000",
        "children": [{
                "value": "呼和浩特市",
                "label": "呼和浩特市",
                "num": "150100",
                "children": [{
                        "value": "新城区",
                        "label": "新城区",
                        "num": "150102"
                    },
                    {
                        "value": "回民区",
                        "label": "回民区",
                        "num": "150103"
                    },
                    {
                        "value": "玉泉区",
                        "label": "玉泉区",
                        "num": "150104"
                    },
                    {
                        "value": "赛罕区",
                        "label": "赛罕区",
                        "num": "150105"
                    },
                    {
                        "value": "土默特左旗",
                        "label": "土默特左旗",
                        "num": "150121"
                    },
                    {
                        "value": "托克托县",
                        "label": "托克托县",
                        "num": "150122"
                    },
                    {
                        "value": "和林格尔县",
                        "label": "和林格尔县",
                        "num": "150123"
                    },
                    {
                        "value": "清水河县",
                        "label": "清水河县",
                        "num": "150124"
                    },
                    {
                        "value": "武川县",
                        "label": "武川县",
                        "num": "150125"
                    }
                ]
            },
            {
                "value": "包头市",
                "label": "包头市",
                "num": "150200",
                "children": [{
                        "value": "东河区",
                        "label": "东河区",
                        "num": "150202"
                    },
                    {
                        "value": "昆都仑区",
                        "label": "昆都仑区",
                        "num": "150203"
                    },
                    {
                        "value": "青山区",
                        "label": "青山区",
                        "num": "150204"
                    },
                    {
                        "value": "石拐区",
                        "label": "石拐区",
                        "num": "150205"
                    },
                    {
                        "value": "白云鄂博矿区",
                        "label": "白云鄂博矿区",
                        "num": "150206"
                    },
                    {
                        "value": "九原区",
                        "label": "九原区",
                        "num": "150207"
                    },
                    {
                        "value": "土默特右旗",
                        "label": "土默特右旗",
                        "num": "150221"
                    },
                    {
                        "value": "固阳县",
                        "label": "固阳县",
                        "num": "150222"
                    },
                    {
                        "value": "达尔罕茂明安联合旗",
                        "label": "达尔罕茂明安联合旗",
                        "num": "150223"
                    }
                ]
            },
            {
                "value": "乌海市",
                "label": "乌海市",
                "num": "150300",
                "children": [{
                        "value": "海勃湾区",
                        "label": "海勃湾区",
                        "num": "150302"
                    },
                    {
                        "value": "海南区",
                        "label": "海南区",
                        "num": "150303"
                    },
                    {
                        "value": "乌达区",
                        "label": "乌达区",
                        "num": "150304"
                    }
                ]
            },
            {
                "value": "赤峰市",
                "label": "赤峰市",
                "num": "150400",
                "children": [{
                        "value": "红山区",
                        "label": "红山区",
                        "num": "150402"
                    },
                    {
                        "value": "元宝山区",
                        "label": "元宝山区",
                        "num": "150403"
                    },
                    {
                        "value": "松山区",
                        "label": "松山区",
                        "num": "150404"
                    },
                    {
                        "value": "阿鲁科尔沁旗",
                        "label": "阿鲁科尔沁旗",
                        "num": "150421"
                    },
                    {
                        "value": "巴林左旗",
                        "label": "巴林左旗",
                        "num": "150422"
                    },
                    {
                        "value": "巴林右旗",
                        "label": "巴林右旗",
                        "num": "150423"
                    },
                    {
                        "value": "林西县",
                        "label": "林西县",
                        "num": "150424"
                    },
                    {
                        "value": "克什克腾旗",
                        "label": "克什克腾旗",
                        "num": "150425"
                    },
                    {
                        "value": "翁牛特旗",
                        "label": "翁牛特旗",
                        "num": "150426"
                    },
                    {
                        "value": "喀喇沁旗",
                        "label": "喀喇沁旗",
                        "num": "150428"
                    },
                    {
                        "value": "宁城县",
                        "label": "宁城县",
                        "num": "150429"
                    },
                    {
                        "value": "敖汉旗",
                        "label": "敖汉旗",
                        "num": "150430"
                    }
                ]
            },
            {
                "value": "通辽市",
                "label": "通辽市",
                "num": "150500",
                "children": [{
                        "value": "科尔沁区",
                        "label": "科尔沁区",
                        "num": "150502"
                    },
                    {
                        "value": "科尔沁左翼中旗",
                        "label": "科尔沁左翼中旗",
                        "num": "150521"
                    },
                    {
                        "value": "科尔沁左翼后旗",
                        "label": "科尔沁左翼后旗",
                        "num": "150522"
                    },
                    {
                        "value": "开鲁县",
                        "label": "开鲁县",
                        "num": "150523"
                    },
                    {
                        "value": "库伦旗",
                        "label": "库伦旗",
                        "num": "150524"
                    },
                    {
                        "value": "奈曼旗",
                        "label": "奈曼旗",
                        "num": "150525"
                    },
                    {
                        "value": "扎鲁特旗",
                        "label": "扎鲁特旗",
                        "num": "150526"
                    },
                    {
                        "value": "霍林郭勒市",
                        "label": "霍林郭勒市",
                        "num": "150581"
                    }
                ]
            },
            {
                "value": "鄂尔多斯市",
                "label": "鄂尔多斯市",
                "num": "150600",
                "children": [{
                        "value": "东胜区",
                        "label": "东胜区",
                        "num": "150602"
                    },
                    {
                        "value": "康巴什区",
                        "label": "康巴什区",
                        "num": "150603"
                    },
                    {
                        "value": "达拉特旗",
                        "label": "达拉特旗",
                        "num": "150621"
                    },
                    {
                        "value": "准格尔旗",
                        "label": "准格尔旗",
                        "num": "150622"
                    },
                    {
                        "value": "鄂托克前旗",
                        "label": "鄂托克前旗",
                        "num": "150623"
                    },
                    {
                        "value": "鄂托克旗",
                        "label": "鄂托克旗",
                        "num": "150624"
                    },
                    {
                        "value": "杭锦旗",
                        "label": "杭锦旗",
                        "num": "150625"
                    },
                    {
                        "value": "乌审旗",
                        "label": "乌审旗",
                        "num": "150626"
                    },
                    {
                        "value": "伊金霍洛旗",
                        "label": "伊金霍洛旗",
                        "num": "150627"
                    }
                ]
            },
            {
                "value": "呼伦贝尔市",
                "label": "呼伦贝尔市",
                "num": "150700",
                "children": [{
                        "value": "海拉尔区",
                        "label": "海拉尔区",
                        "num": "150702"
                    },
                    {
                        "value": "扎赉诺尔区",
                        "label": "扎赉诺尔区",
                        "num": "150703"
                    },
                    {
                        "value": "阿荣旗",
                        "label": "阿荣旗",
                        "num": "150721"
                    },
                    {
                        "value": "莫力达瓦达斡尔族自治旗",
                        "label": "莫力达瓦达斡尔族自治旗",
                        "num": "150722"
                    },
                    {
                        "value": "鄂伦春自治旗",
                        "label": "鄂伦春自治旗",
                        "num": "150723"
                    },
                    {
                        "value": "鄂温克族自治旗",
                        "label": "鄂温克族自治旗",
                        "num": "150724"
                    },
                    {
                        "value": "陈巴尔虎旗",
                        "label": "陈巴尔虎旗",
                        "num": "150725"
                    },
                    {
                        "value": "新巴尔虎左旗",
                        "label": "新巴尔虎左旗",
                        "num": "150726"
                    },
                    {
                        "value": "新巴尔虎右旗",
                        "label": "新巴尔虎右旗",
                        "num": "150727"
                    },
                    {
                        "value": "满洲里市",
                        "label": "满洲里市",
                        "num": "150781"
                    },
                    {
                        "value": "牙克石市",
                        "label": "牙克石市",
                        "num": "150782"
                    },
                    {
                        "value": "扎兰屯市",
                        "label": "扎兰屯市",
                        "num": "150783"
                    },
                    {
                        "value": "额尔古纳市",
                        "label": "额尔古纳市",
                        "num": "150784"
                    },
                    {
                        "value": "根河市",
                        "label": "根河市",
                        "num": "150785"
                    }
                ]
            },
            {
                "value": "巴彦淖尔市",
                "label": "巴彦淖尔市",
                "num": "150800",
                "children": [{
                        "value": "临河区",
                        "label": "临河区",
                        "num": "150802"
                    },
                    {
                        "value": "五原县",
                        "label": "五原县",
                        "num": "150821"
                    },
                    {
                        "value": "磴口县",
                        "label": "磴口县",
                        "num": "150822"
                    },
                    {
                        "value": "乌拉特前旗",
                        "label": "乌拉特前旗",
                        "num": "150823"
                    },
                    {
                        "value": "乌拉特中旗",
                        "label": "乌拉特中旗",
                        "num": "150824"
                    },
                    {
                        "value": "乌拉特后旗",
                        "label": "乌拉特后旗",
                        "num": "150825"
                    },
                    {
                        "value": "杭锦后旗",
                        "label": "杭锦后旗",
                        "num": "150826"
                    }
                ]
            },
            {
                "value": "乌兰察布市",
                "label": "乌兰察布市",
                "num": "150900",
                "children": [{
                        "value": "集宁区",
                        "label": "集宁区",
                        "num": "150902"
                    },
                    {
                        "value": "卓资县",
                        "label": "卓资县",
                        "num": "150921"
                    },
                    {
                        "value": "化德县",
                        "label": "化德县",
                        "num": "150922"
                    },
                    {
                        "value": "商都县",
                        "label": "商都县",
                        "num": "150923"
                    },
                    {
                        "value": "兴和县",
                        "label": "兴和县",
                        "num": "150924"
                    },
                    {
                        "value": "凉城县",
                        "label": "凉城县",
                        "num": "150925"
                    },
                    {
                        "value": "察哈尔右翼前旗",
                        "label": "察哈尔右翼前旗",
                        "num": "150926"
                    },
                    {
                        "value": "察哈尔右翼中旗",
                        "label": "察哈尔右翼中旗",
                        "num": "150927"
                    },
                    {
                        "value": "察哈尔右翼后旗",
                        "label": "察哈尔右翼后旗",
                        "num": "150928"
                    },
                    {
                        "value": "四子王旗",
                        "label": "四子王旗",
                        "num": "150929"
                    },
                    {
                        "value": "丰镇市",
                        "label": "丰镇市",
                        "num": "150981"
                    }
                ]
            },
            {
                "value": "兴安盟",
                "label": "兴安盟",
                "num": "152200",
                "children": [{
                        "value": "乌兰浩特市",
                        "label": "乌兰浩特市",
                        "num": "152201"
                    },
                    {
                        "value": "阿尔山市",
                        "label": "阿尔山市",
                        "num": "152202"
                    },
                    {
                        "value": "科尔沁右翼前旗",
                        "label": "科尔沁右翼前旗",
                        "num": "152221"
                    },
                    {
                        "value": "科尔沁右翼中旗",
                        "label": "科尔沁右翼中旗",
                        "num": "152222"
                    },
                    {
                        "value": "扎赉特旗",
                        "label": "扎赉特旗",
                        "num": "152223"
                    },
                    {
                        "value": "突泉县",
                        "label": "突泉县",
                        "num": "152224"
                    }
                ]
            },
            {
                "value": "锡林郭勒盟",
                "label": "锡林郭勒盟",
                "num": "152500",
                "children": [{
                        "value": "二连浩特市",
                        "label": "二连浩特市",
                        "num": "152501"
                    },
                    {
                        "value": "锡林浩特市",
                        "label": "锡林浩特市",
                        "num": "152502"
                    },
                    {
                        "value": "阿巴嘎旗",
                        "label": "阿巴嘎旗",
                        "num": "152522"
                    },
                    {
                        "value": "苏尼特左旗",
                        "label": "苏尼特左旗",
                        "num": "152523"
                    },
                    {
                        "value": "苏尼特右旗",
                        "label": "苏尼特右旗",
                        "num": "152524"
                    },
                    {
                        "value": "东乌珠穆沁旗",
                        "label": "东乌珠穆沁旗",
                        "num": "152525"
                    },
                    {
                        "value": "西乌珠穆沁旗",
                        "label": "西乌珠穆沁旗",
                        "num": "152526"
                    },
                    {
                        "value": "太仆寺旗",
                        "label": "太仆寺旗",
                        "num": "152527"
                    },
                    {
                        "value": "镶黄旗",
                        "label": "镶黄旗",
                        "num": "152528"
                    },
                    {
                        "value": "正镶白旗",
                        "label": "正镶白旗",
                        "num": "152529"
                    },
                    {
                        "value": "正蓝旗",
                        "label": "正蓝旗",
                        "num": "152530"
                    },
                    {
                        "value": "多伦县",
                        "label": "多伦县",
                        "num": "152531"
                    }
                ]
            },
            {
                "value": "阿拉善盟",
                "label": "阿拉善盟",
                "num": "152900",
                "children": [{
                        "value": "阿拉善左旗",
                        "label": "阿拉善左旗",
                        "num": "152921"
                    },
                    {
                        "value": "阿拉善右旗",
                        "label": "阿拉善右旗",
                        "num": "152922"
                    },
                    {
                        "value": "额济纳旗",
                        "label": "额济纳旗",
                        "num": "152923"
                    }
                ]
            }
        ]
    },
    {
        "value": "辽宁省",
        "label": "辽宁省",
        "num": "210000",
        "children": [{
                "value": "沈阳市",
                "label": "沈阳市",
                "num": "210100",
                "children": [{
                        "value": "和平区",
                        "label": "和平区",
                        "num": "210102"
                    },
                    {
                        "value": "沈河区",
                        "label": "沈河区",
                        "num": "210103"
                    },
                    {
                        "value": "大东区",
                        "label": "大东区",
                        "num": "210104"
                    },
                    {
                        "value": "皇姑区",
                        "label": "皇姑区",
                        "num": "210105"
                    },
                    {
                        "value": "铁西区",
                        "label": "铁西区",
                        "num": "210106"
                    },
                    {
                        "value": "苏家屯区",
                        "label": "苏家屯区",
                        "num": "210111"
                    },
                    {
                        "value": "浑南区",
                        "label": "浑南区",
                        "num": "210112"
                    },
                    {
                        "value": "沈北新区",
                        "label": "沈北新区",
                        "num": "210113"
                    },
                    {
                        "value": "于洪区",
                        "label": "于洪区",
                        "num": "210114"
                    },
                    {
                        "value": "辽中区",
                        "label": "辽中区",
                        "num": "210115"
                    },
                    {
                        "value": "康平县",
                        "label": "康平县",
                        "num": "210123"
                    },
                    {
                        "value": "法库县",
                        "label": "法库县",
                        "num": "210124"
                    },
                    {
                        "value": "新民市",
                        "label": "新民市",
                        "num": "210181"
                    },
                    {
                        "value": "经济技术开发区",
                        "label": "经济技术开发区",
                        "num": "210190"
                    }
                ]
            },
            {
                "value": "大连市",
                "label": "大连市",
                "num": "210200",
                "children": [{
                        "value": "中山区",
                        "label": "中山区",
                        "num": "210202"
                    },
                    {
                        "value": "西岗区",
                        "label": "西岗区",
                        "num": "210203"
                    },
                    {
                        "value": "沙河口区",
                        "label": "沙河口区",
                        "num": "210204"
                    },
                    {
                        "value": "甘井子区",
                        "label": "甘井子区",
                        "num": "210211"
                    },
                    {
                        "value": "旅顺口区",
                        "label": "旅顺口区",
                        "num": "210212"
                    },
                    {
                        "value": "金州区",
                        "label": "金州区",
                        "num": "210213"
                    },
                    {
                        "value": "普兰店区",
                        "label": "普兰店区",
                        "num": "210214"
                    },
                    {
                        "value": "长海县",
                        "label": "长海县",
                        "num": "210224"
                    },
                    {
                        "value": "瓦房店市",
                        "label": "瓦房店市",
                        "num": "210281"
                    },
                    {
                        "value": "庄河市",
                        "label": "庄河市",
                        "num": "210283"
                    }
                ]
            },
            {
                "value": "鞍山市",
                "label": "鞍山市",
                "num": "210300",
                "children": [{
                        "value": "铁东区",
                        "label": "铁东区",
                        "num": "210302"
                    },
                    {
                        "value": "铁西区",
                        "label": "铁西区",
                        "num": "210303"
                    },
                    {
                        "value": "立山区",
                        "label": "立山区",
                        "num": "210304"
                    },
                    {
                        "value": "千山区",
                        "label": "千山区",
                        "num": "210311"
                    },
                    {
                        "value": "台安县",
                        "label": "台安县",
                        "num": "210321"
                    },
                    {
                        "value": "岫岩满族自治县",
                        "label": "岫岩满族自治县",
                        "num": "210323"
                    },
                    {
                        "value": "海城市",
                        "label": "海城市",
                        "num": "210381"
                    },
                    {
                        "value": "高新区",
                        "label": "高新区",
                        "num": "210390"
                    }
                ]
            },
            {
                "value": "抚顺市",
                "label": "抚顺市",
                "num": "210400",
                "children": [{
                        "value": "新抚区",
                        "label": "新抚区",
                        "num": "210402"
                    },
                    {
                        "value": "东洲区",
                        "label": "东洲区",
                        "num": "210403"
                    },
                    {
                        "value": "望花区",
                        "label": "望花区",
                        "num": "210404"
                    },
                    {
                        "value": "顺城区",
                        "label": "顺城区",
                        "num": "210411"
                    },
                    {
                        "value": "抚顺县",
                        "label": "抚顺县",
                        "num": "210421"
                    },
                    {
                        "value": "新宾满族自治县",
                        "label": "新宾满族自治县",
                        "num": "210422"
                    },
                    {
                        "value": "清原满族自治县",
                        "label": "清原满族自治县",
                        "num": "210423"
                    }
                ]
            },
            {
                "value": "本溪市",
                "label": "本溪市",
                "num": "210500",
                "children": [{
                        "value": "平山区",
                        "label": "平山区",
                        "num": "210502"
                    },
                    {
                        "value": "溪湖区",
                        "label": "溪湖区",
                        "num": "210503"
                    },
                    {
                        "value": "明山区",
                        "label": "明山区",
                        "num": "210504"
                    },
                    {
                        "value": "南芬区",
                        "label": "南芬区",
                        "num": "210505"
                    },
                    {
                        "value": "本溪满族自治县",
                        "label": "本溪满族自治县",
                        "num": "210521"
                    },
                    {
                        "value": "桓仁满族自治县",
                        "label": "桓仁满族自治县",
                        "num": "210522"
                    }
                ]
            },
            {
                "value": "丹东市",
                "label": "丹东市",
                "num": "210600",
                "children": [{
                        "value": "元宝区",
                        "label": "元宝区",
                        "num": "210602"
                    },
                    {
                        "value": "振兴区",
                        "label": "振兴区",
                        "num": "210603"
                    },
                    {
                        "value": "振安区",
                        "label": "振安区",
                        "num": "210604"
                    },
                    {
                        "value": "宽甸满族自治县",
                        "label": "宽甸满族自治县",
                        "num": "210624"
                    },
                    {
                        "value": "东港市",
                        "label": "东港市",
                        "num": "210681"
                    },
                    {
                        "value": "凤城市",
                        "label": "凤城市",
                        "num": "210682"
                    }
                ]
            },
            {
                "value": "锦州市",
                "label": "锦州市",
                "num": "210700",
                "children": [{
                        "value": "古塔区",
                        "label": "古塔区",
                        "num": "210702"
                    },
                    {
                        "value": "凌河区",
                        "label": "凌河区",
                        "num": "210703"
                    },
                    {
                        "value": "太和区",
                        "label": "太和区",
                        "num": "210711"
                    },
                    {
                        "value": "黑山县",
                        "label": "黑山县",
                        "num": "210726"
                    },
                    {
                        "value": "义县",
                        "label": "义县",
                        "num": "210727"
                    },
                    {
                        "value": "凌海市",
                        "label": "凌海市",
                        "num": "210781"
                    },
                    {
                        "value": "北镇市",
                        "label": "北镇市",
                        "num": "210782"
                    },
                    {
                        "value": "经济技术开发区",
                        "label": "经济技术开发区",
                        "num": "210793"
                    }
                ]
            },
            {
                "value": "营口市",
                "label": "营口市",
                "num": "210800",
                "children": [{
                        "value": "站前区",
                        "label": "站前区",
                        "num": "210802"
                    },
                    {
                        "value": "西市区",
                        "label": "西市区",
                        "num": "210803"
                    },
                    {
                        "value": "鲅鱼圈区",
                        "label": "鲅鱼圈区",
                        "num": "210804"
                    },
                    {
                        "value": "老边区",
                        "label": "老边区",
                        "num": "210811"
                    },
                    {
                        "value": "盖州市",
                        "label": "盖州市",
                        "num": "210881"
                    },
                    {
                        "value": "大石桥市",
                        "label": "大石桥市",
                        "num": "210882"
                    }
                ]
            },
            {
                "value": "阜新市",
                "label": "阜新市",
                "num": "210900",
                "children": [{
                        "value": "海州区",
                        "label": "海州区",
                        "num": "210902"
                    },
                    {
                        "value": "新邱区",
                        "label": "新邱区",
                        "num": "210903"
                    },
                    {
                        "value": "太平区",
                        "label": "太平区",
                        "num": "210904"
                    },
                    {
                        "value": "清河门区",
                        "label": "清河门区",
                        "num": "210905"
                    },
                    {
                        "value": "细河区",
                        "label": "细河区",
                        "num": "210911"
                    },
                    {
                        "value": "阜新蒙古族自治县",
                        "label": "阜新蒙古族自治县",
                        "num": "210921"
                    },
                    {
                        "value": "彰武县",
                        "label": "彰武县",
                        "num": "210922"
                    }
                ]
            },
            {
                "value": "辽阳市",
                "label": "辽阳市",
                "num": "211000",
                "children": [{
                        "value": "白塔区",
                        "label": "白塔区",
                        "num": "211002"
                    },
                    {
                        "value": "文圣区",
                        "label": "文圣区",
                        "num": "211003"
                    },
                    {
                        "value": "宏伟区",
                        "label": "宏伟区",
                        "num": "211004"
                    },
                    {
                        "value": "弓长岭区",
                        "label": "弓长岭区",
                        "num": "211005"
                    },
                    {
                        "value": "太子河区",
                        "label": "太子河区",
                        "num": "211011"
                    },
                    {
                        "value": "辽阳县",
                        "label": "辽阳县",
                        "num": "211021"
                    },
                    {
                        "value": "灯塔市",
                        "label": "灯塔市",
                        "num": "211081"
                    }
                ]
            },
            {
                "value": "盘锦市",
                "label": "盘锦市",
                "num": "211100",
                "children": [{
                        "value": "双台子区",
                        "label": "双台子区",
                        "num": "211102"
                    },
                    {
                        "value": "兴隆台区",
                        "label": "兴隆台区",
                        "num": "211103"
                    },
                    {
                        "value": "大洼区",
                        "label": "大洼区",
                        "num": "211104"
                    },
                    {
                        "value": "盘山县",
                        "label": "盘山县",
                        "num": "211122"
                    }
                ]
            },
            {
                "value": "铁岭市",
                "label": "铁岭市",
                "num": "211200",
                "children": [{
                        "value": "银州区",
                        "label": "银州区",
                        "num": "211202"
                    },
                    {
                        "value": "清河区",
                        "label": "清河区",
                        "num": "211204"
                    },
                    {
                        "value": "铁岭县",
                        "label": "铁岭县",
                        "num": "211221"
                    },
                    {
                        "value": "西丰县",
                        "label": "西丰县",
                        "num": "211223"
                    },
                    {
                        "value": "昌图县",
                        "label": "昌图县",
                        "num": "211224"
                    },
                    {
                        "value": "调兵山市",
                        "label": "调兵山市",
                        "num": "211281"
                    },
                    {
                        "value": "开原市",
                        "label": "开原市",
                        "num": "211282"
                    }
                ]
            },
            {
                "value": "朝阳市",
                "label": "朝阳市",
                "num": "211300",
                "children": [{
                        "value": "双塔区",
                        "label": "双塔区",
                        "num": "211302"
                    },
                    {
                        "value": "龙城区",
                        "label": "龙城区",
                        "num": "211303"
                    },
                    {
                        "value": "朝阳县",
                        "label": "朝阳县",
                        "num": "211321"
                    },
                    {
                        "value": "建平县",
                        "label": "建平县",
                        "num": "211322"
                    },
                    {
                        "value": "喀喇沁左翼蒙古族自治县",
                        "label": "喀喇沁左翼蒙古族自治县",
                        "num": "211324"
                    },
                    {
                        "value": "北票市",
                        "label": "北票市",
                        "num": "211381"
                    },
                    {
                        "value": "凌源市",
                        "label": "凌源市",
                        "num": "211382"
                    }
                ]
            },
            {
                "value": "葫芦岛市",
                "label": "葫芦岛市",
                "num": "211400",
                "children": [{
                        "value": "连山区",
                        "label": "连山区",
                        "num": "211402"
                    },
                    {
                        "value": "龙港区",
                        "label": "龙港区",
                        "num": "211403"
                    },
                    {
                        "value": "南票区",
                        "label": "南票区",
                        "num": "211404"
                    },
                    {
                        "value": "绥中县",
                        "label": "绥中县",
                        "num": "211421"
                    },
                    {
                        "value": "建昌县",
                        "label": "建昌县",
                        "num": "211422"
                    },
                    {
                        "value": "兴城市",
                        "label": "兴城市",
                        "num": "211481"
                    }
                ]
            }
        ]
    },
    {
        "value": "吉林省",
        "label": "吉林省",
        "num": "220000",
        "children": [{
                "value": "长春市",
                "label": "长春市",
                "num": "220100",
                "children": [{
                        "value": "南关区",
                        "label": "南关区",
                        "num": "220102"
                    },
                    {
                        "value": "宽城区",
                        "label": "宽城区",
                        "num": "220103"
                    },
                    {
                        "value": "朝阳区",
                        "label": "朝阳区",
                        "num": "220104"
                    },
                    {
                        "value": "二道区",
                        "label": "二道区",
                        "num": "220105"
                    },
                    {
                        "value": "绿园区",
                        "label": "绿园区",
                        "num": "220106"
                    },
                    {
                        "value": "双阳区",
                        "label": "双阳区",
                        "num": "220112"
                    },
                    {
                        "value": "九台区",
                        "label": "九台区",
                        "num": "220113"
                    },
                    {
                        "value": "农安县",
                        "label": "农安县",
                        "num": "220122"
                    },
                    {
                        "value": "榆树市",
                        "label": "榆树市",
                        "num": "220182"
                    },
                    {
                        "value": "德惠市",
                        "label": "德惠市",
                        "num": "220183"
                    },
                    {
                        "value": "经济技术开发区",
                        "label": "经济技术开发区",
                        "num": "220192"
                    }
                ]
            },
            {
                "value": "吉林市",
                "label": "吉林市",
                "num": "220200",
                "children": [{
                        "value": "昌邑区",
                        "label": "昌邑区",
                        "num": "220202"
                    },
                    {
                        "value": "龙潭区",
                        "label": "龙潭区",
                        "num": "220203"
                    },
                    {
                        "value": "船营区",
                        "label": "船营区",
                        "num": "220204"
                    },
                    {
                        "value": "丰满区",
                        "label": "丰满区",
                        "num": "220211"
                    },
                    {
                        "value": "永吉县",
                        "label": "永吉县",
                        "num": "220221"
                    },
                    {
                        "value": "蛟河市",
                        "label": "蛟河市",
                        "num": "220281"
                    },
                    {
                        "value": "桦甸市",
                        "label": "桦甸市",
                        "num": "220282"
                    },
                    {
                        "value": "舒兰市",
                        "label": "舒兰市",
                        "num": "220283"
                    },
                    {
                        "value": "磐石市",
                        "label": "磐石市",
                        "num": "220284"
                    }
                ]
            },
            {
                "value": "四平市",
                "label": "四平市",
                "num": "220300",
                "children": [{
                        "value": "铁西区",
                        "label": "铁西区",
                        "num": "220302"
                    },
                    {
                        "value": "铁东区",
                        "label": "铁东区",
                        "num": "220303"
                    },
                    {
                        "value": "梨树县",
                        "label": "梨树县",
                        "num": "220322"
                    },
                    {
                        "value": "伊通满族自治县",
                        "label": "伊通满族自治县",
                        "num": "220323"
                    },
                    {
                        "value": "公主岭市",
                        "label": "公主岭市",
                        "num": "220381"
                    },
                    {
                        "value": "双辽市",
                        "label": "双辽市",
                        "num": "220382"
                    }
                ]
            },
            {
                "value": "辽源市",
                "label": "辽源市",
                "num": "220400",
                "children": [{
                        "value": "龙山区",
                        "label": "龙山区",
                        "num": "220402"
                    },
                    {
                        "value": "西安区",
                        "label": "西安区",
                        "num": "220403"
                    },
                    {
                        "value": "东丰县",
                        "label": "东丰县",
                        "num": "220421"
                    },
                    {
                        "value": "东辽县",
                        "label": "东辽县",
                        "num": "220422"
                    }
                ]
            },
            {
                "value": "通化市",
                "label": "通化市",
                "num": "220500",
                "children": [{
                        "value": "东昌区",
                        "label": "东昌区",
                        "num": "220502"
                    },
                    {
                        "value": "二道江区",
                        "label": "二道江区",
                        "num": "220503"
                    },
                    {
                        "value": "通化县",
                        "label": "通化县",
                        "num": "220521"
                    },
                    {
                        "value": "辉南县",
                        "label": "辉南县",
                        "num": "220523"
                    },
                    {
                        "value": "柳河县",
                        "label": "柳河县",
                        "num": "220524"
                    },
                    {
                        "value": "梅河口市",
                        "label": "梅河口市",
                        "num": "220581"
                    },
                    {
                        "value": "集安市",
                        "label": "集安市",
                        "num": "220582"
                    }
                ]
            },
            {
                "value": "白山市",
                "label": "白山市",
                "num": "220600",
                "children": [{
                        "value": "浑江区",
                        "label": "浑江区",
                        "num": "220602"
                    },
                    {
                        "value": "江源区",
                        "label": "江源区",
                        "num": "220605"
                    },
                    {
                        "value": "抚松县",
                        "label": "抚松县",
                        "num": "220621"
                    },
                    {
                        "value": "靖宇县",
                        "label": "靖宇县",
                        "num": "220622"
                    },
                    {
                        "value": "长白朝鲜族自治县",
                        "label": "长白朝鲜族自治县",
                        "num": "220623"
                    },
                    {
                        "value": "临江市",
                        "label": "临江市",
                        "num": "220681"
                    }
                ]
            },
            {
                "value": "松原市",
                "label": "松原市",
                "num": "220700",
                "children": [{
                        "value": "宁江区",
                        "label": "宁江区",
                        "num": "220702"
                    },
                    {
                        "value": "前郭尔罗斯蒙古族自治县",
                        "label": "前郭尔罗斯蒙古族自治县",
                        "num": "220721"
                    },
                    {
                        "value": "长岭县",
                        "label": "长岭县",
                        "num": "220722"
                    },
                    {
                        "value": "乾安县",
                        "label": "乾安县",
                        "num": "220723"
                    },
                    {
                        "value": "扶余市",
                        "label": "扶余市",
                        "num": "220781"
                    }
                ]
            },
            {
                "value": "白城市",
                "label": "白城市",
                "num": "220800",
                "children": [{
                        "value": "洮北区",
                        "label": "洮北区",
                        "num": "220802"
                    },
                    {
                        "value": "镇赉县",
                        "label": "镇赉县",
                        "num": "220821"
                    },
                    {
                        "value": "通榆县",
                        "label": "通榆县",
                        "num": "220822"
                    },
                    {
                        "value": "洮南市",
                        "label": "洮南市",
                        "num": "220881"
                    },
                    {
                        "value": "大安市",
                        "label": "大安市",
                        "num": "220882"
                    }
                ]
            },
            {
                "value": "延边朝鲜族自治州",
                "label": "延边朝鲜族自治州",
                "num": "222400",
                "children": [{
                        "value": "延吉市",
                        "label": "延吉市",
                        "num": "222401"
                    },
                    {
                        "value": "图们市",
                        "label": "图们市",
                        "num": "222402"
                    },
                    {
                        "value": "敦化市",
                        "label": "敦化市",
                        "num": "222403"
                    },
                    {
                        "value": "珲春市",
                        "label": "珲春市",
                        "num": "222404"
                    },
                    {
                        "value": "龙井市",
                        "label": "龙井市",
                        "num": "222405"
                    },
                    {
                        "value": "和龙市",
                        "label": "和龙市",
                        "num": "222406"
                    },
                    {
                        "value": "汪清县",
                        "label": "汪清县",
                        "num": "222424"
                    },
                    {
                        "value": "安图县",
                        "label": "安图县",
                        "num": "222426"
                    }
                ]
            }
        ]
    },
    {
        "value": "黑龙江省",
        "label": "黑龙江省",
        "num": "230000",
        "children": [{
                "value": "哈尔滨市",
                "label": "哈尔滨市",
                "num": "230100",
                "children": [{
                        "value": "道里区",
                        "label": "道里区",
                        "num": "230102"
                    },
                    {
                        "value": "南岗区",
                        "label": "南岗区",
                        "num": "230103"
                    },
                    {
                        "value": "道外区",
                        "label": "道外区",
                        "num": "230104"
                    },
                    {
                        "value": "平房区",
                        "label": "平房区",
                        "num": "230108"
                    },
                    {
                        "value": "松北区",
                        "label": "松北区",
                        "num": "230109"
                    },
                    {
                        "value": "香坊区",
                        "label": "香坊区",
                        "num": "230110"
                    },
                    {
                        "value": "呼兰区",
                        "label": "呼兰区",
                        "num": "230111"
                    },
                    {
                        "value": "阿城区",
                        "label": "阿城区",
                        "num": "230112"
                    },
                    {
                        "value": "双城区",
                        "label": "双城区",
                        "num": "230113"
                    },
                    {
                        "value": "依兰县",
                        "label": "依兰县",
                        "num": "230123"
                    },
                    {
                        "value": "方正县",
                        "label": "方正县",
                        "num": "230124"
                    },
                    {
                        "value": "宾县",
                        "label": "宾县",
                        "num": "230125"
                    },
                    {
                        "value": "巴彦县",
                        "label": "巴彦县",
                        "num": "230126"
                    },
                    {
                        "value": "木兰县",
                        "label": "木兰县",
                        "num": "230127"
                    },
                    {
                        "value": "通河县",
                        "label": "通河县",
                        "num": "230128"
                    },
                    {
                        "value": "延寿县",
                        "label": "延寿县",
                        "num": "230129"
                    },
                    {
                        "value": "尚志市",
                        "label": "尚志市",
                        "num": "230183"
                    },
                    {
                        "value": "五常市",
                        "label": "五常市",
                        "num": "230184"
                    }
                ]
            },
            {
                "value": "齐齐哈尔市",
                "label": "齐齐哈尔市",
                "num": "230200",
                "children": [{
                        "value": "龙沙区",
                        "label": "龙沙区",
                        "num": "230202"
                    },
                    {
                        "value": "建华区",
                        "label": "建华区",
                        "num": "230203"
                    },
                    {
                        "value": "铁锋区",
                        "label": "铁锋区",
                        "num": "230204"
                    },
                    {
                        "value": "昂昂溪区",
                        "label": "昂昂溪区",
                        "num": "230205"
                    },
                    {
                        "value": "富拉尔基区",
                        "label": "富拉尔基区",
                        "num": "230206"
                    },
                    {
                        "value": "碾子山区",
                        "label": "碾子山区",
                        "num": "230207"
                    },
                    {
                        "value": "梅里斯达斡尔族区",
                        "label": "梅里斯达斡尔族区",
                        "num": "230208"
                    },
                    {
                        "value": "龙江县",
                        "label": "龙江县",
                        "num": "230221"
                    },
                    {
                        "value": "依安县",
                        "label": "依安县",
                        "num": "230223"
                    },
                    {
                        "value": "泰来县",
                        "label": "泰来县",
                        "num": "230224"
                    },
                    {
                        "value": "甘南县",
                        "label": "甘南县",
                        "num": "230225"
                    },
                    {
                        "value": "富裕县",
                        "label": "富裕县",
                        "num": "230227"
                    },
                    {
                        "value": "克山县",
                        "label": "克山县",
                        "num": "230229"
                    },
                    {
                        "value": "克东县",
                        "label": "克东县",
                        "num": "230230"
                    },
                    {
                        "value": "拜泉县",
                        "label": "拜泉县",
                        "num": "230231"
                    },
                    {
                        "value": "讷河市",
                        "label": "讷河市",
                        "num": "230281"
                    }
                ]
            },
            {
                "value": "鸡西市",
                "label": "鸡西市",
                "num": "230300",
                "children": [{
                        "value": "鸡冠区",
                        "label": "鸡冠区",
                        "num": "230302"
                    },
                    {
                        "value": "恒山区",
                        "label": "恒山区",
                        "num": "230303"
                    },
                    {
                        "value": "滴道区",
                        "label": "滴道区",
                        "num": "230304"
                    },
                    {
                        "value": "梨树区",
                        "label": "梨树区",
                        "num": "230305"
                    },
                    {
                        "value": "城子河区",
                        "label": "城子河区",
                        "num": "230306"
                    },
                    {
                        "value": "麻山区",
                        "label": "麻山区",
                        "num": "230307"
                    },
                    {
                        "value": "鸡东县",
                        "label": "鸡东县",
                        "num": "230321"
                    },
                    {
                        "value": "虎林市",
                        "label": "虎林市",
                        "num": "230381"
                    },
                    {
                        "value": "密山市",
                        "label": "密山市",
                        "num": "230382"
                    }
                ]
            },
            {
                "value": "鹤岗市",
                "label": "鹤岗市",
                "num": "230400",
                "children": [{
                        "value": "向阳区",
                        "label": "向阳区",
                        "num": "230402"
                    },
                    {
                        "value": "工农区",
                        "label": "工农区",
                        "num": "230403"
                    },
                    {
                        "value": "南山区",
                        "label": "南山区",
                        "num": "230404"
                    },
                    {
                        "value": "兴安区",
                        "label": "兴安区",
                        "num": "230405"
                    },
                    {
                        "value": "东山区",
                        "label": "东山区",
                        "num": "230406"
                    },
                    {
                        "value": "兴山区",
                        "label": "兴山区",
                        "num": "230407"
                    },
                    {
                        "value": "萝北县",
                        "label": "萝北县",
                        "num": "230421"
                    },
                    {
                        "value": "绥滨县",
                        "label": "绥滨县",
                        "num": "230422"
                    }
                ]
            },
            {
                "value": "双鸭山市",
                "label": "双鸭山市",
                "num": "230500",
                "children": [{
                        "value": "尖山区",
                        "label": "尖山区",
                        "num": "230502"
                    },
                    {
                        "value": "岭东区",
                        "label": "岭东区",
                        "num": "230503"
                    },
                    {
                        "value": "四方台区",
                        "label": "四方台区",
                        "num": "230505"
                    },
                    {
                        "value": "宝山区",
                        "label": "宝山区",
                        "num": "230506"
                    },
                    {
                        "value": "集贤县",
                        "label": "集贤县",
                        "num": "230521"
                    },
                    {
                        "value": "友谊县",
                        "label": "友谊县",
                        "num": "230522"
                    },
                    {
                        "value": "宝清县",
                        "label": "宝清县",
                        "num": "230523"
                    },
                    {
                        "value": "饶河县",
                        "label": "饶河县",
                        "num": "230524"
                    }
                ]
            },
            {
                "value": "大庆市",
                "label": "大庆市",
                "num": "230600",
                "children": [{
                        "value": "萨尔图区",
                        "label": "萨尔图区",
                        "num": "230602"
                    },
                    {
                        "value": "龙凤区",
                        "label": "龙凤区",
                        "num": "230603"
                    },
                    {
                        "value": "让胡路区",
                        "label": "让胡路区",
                        "num": "230604"
                    },
                    {
                        "value": "红岗区",
                        "label": "红岗区",
                        "num": "230605"
                    },
                    {
                        "value": "大同区",
                        "label": "大同区",
                        "num": "230606"
                    },
                    {
                        "value": "肇州县",
                        "label": "肇州县",
                        "num": "230621"
                    },
                    {
                        "value": "肇源县",
                        "label": "肇源县",
                        "num": "230622"
                    },
                    {
                        "value": "林甸县",
                        "label": "林甸县",
                        "num": "230623"
                    },
                    {
                        "value": "杜尔伯特蒙古族自治县",
                        "label": "杜尔伯特蒙古族自治县",
                        "num": "230624"
                    }
                ]
            },
            {
                "value": "伊春市",
                "label": "伊春市",
                "num": "230700",
                "children": [{
                        "value": "伊春区",
                        "label": "伊春区",
                        "num": "230702"
                    },
                    {
                        "value": "南岔区",
                        "label": "南岔区",
                        "num": "230703"
                    },
                    {
                        "value": "友好区",
                        "label": "友好区",
                        "num": "230704"
                    },
                    {
                        "value": "西林区",
                        "label": "西林区",
                        "num": "230705"
                    },
                    {
                        "value": "翠峦区",
                        "label": "翠峦区",
                        "num": "230706"
                    },
                    {
                        "value": "新青区",
                        "label": "新青区",
                        "num": "230707"
                    },
                    {
                        "value": "美溪区",
                        "label": "美溪区",
                        "num": "230708"
                    },
                    {
                        "value": "金山屯区",
                        "label": "金山屯区",
                        "num": "230709"
                    },
                    {
                        "value": "五营区",
                        "label": "五营区",
                        "num": "230710"
                    },
                    {
                        "value": "乌马河区",
                        "label": "乌马河区",
                        "num": "230711"
                    },
                    {
                        "value": "汤旺河区",
                        "label": "汤旺河区",
                        "num": "230712"
                    },
                    {
                        "value": "带岭区",
                        "label": "带岭区",
                        "num": "230713"
                    },
                    {
                        "value": "乌伊岭区",
                        "label": "乌伊岭区",
                        "num": "230714"
                    },
                    {
                        "value": "红星区",
                        "label": "红星区",
                        "num": "230715"
                    },
                    {
                        "value": "上甘岭区",
                        "label": "上甘岭区",
                        "num": "230716"
                    },
                    {
                        "value": "嘉荫县",
                        "label": "嘉荫县",
                        "num": "230722"
                    },
                    {
                        "value": "铁力市",
                        "label": "铁力市",
                        "num": "230781"
                    }
                ]
            },
            {
                "value": "佳木斯市",
                "label": "佳木斯市",
                "num": "230800",
                "children": [{
                        "value": "向阳区",
                        "label": "向阳区",
                        "num": "230803"
                    },
                    {
                        "value": "前进区",
                        "label": "前进区",
                        "num": "230804"
                    },
                    {
                        "value": "东风区",
                        "label": "东风区",
                        "num": "230805"
                    },
                    {
                        "value": "郊区",
                        "label": "郊区",
                        "num": "230811"
                    },
                    {
                        "value": "桦南县",
                        "label": "桦南县",
                        "num": "230822"
                    },
                    {
                        "value": "桦川县",
                        "label": "桦川县",
                        "num": "230826"
                    },
                    {
                        "value": "汤原县",
                        "label": "汤原县",
                        "num": "230828"
                    },
                    {
                        "value": "同江市",
                        "label": "同江市",
                        "num": "230881"
                    },
                    {
                        "value": "富锦市",
                        "label": "富锦市",
                        "num": "230882"
                    },
                    {
                        "value": "抚远市",
                        "label": "抚远市",
                        "num": "230883"
                    }
                ]
            },
            {
                "value": "七台河市",
                "label": "七台河市",
                "num": "230900",
                "children": [{
                        "value": "新兴区",
                        "label": "新兴区",
                        "num": "230902"
                    },
                    {
                        "value": "桃山区",
                        "label": "桃山区",
                        "num": "230903"
                    },
                    {
                        "value": "茄子河区",
                        "label": "茄子河区",
                        "num": "230904"
                    },
                    {
                        "value": "勃利县",
                        "label": "勃利县",
                        "num": "230921"
                    }
                ]
            },
            {
                "value": "牡丹江市",
                "label": "牡丹江市",
                "num": "231000",
                "children": [{
                        "value": "东安区",
                        "label": "东安区",
                        "num": "231002"
                    },
                    {
                        "value": "阳明区",
                        "label": "阳明区",
                        "num": "231003"
                    },
                    {
                        "value": "爱民区",
                        "label": "爱民区",
                        "num": "231004"
                    },
                    {
                        "value": "西安区",
                        "label": "西安区",
                        "num": "231005"
                    },
                    {
                        "value": "林口县",
                        "label": "林口县",
                        "num": "231025"
                    },
                    {
                        "value": "绥芬河市",
                        "label": "绥芬河市",
                        "num": "231081"
                    },
                    {
                        "value": "海林市",
                        "label": "海林市",
                        "num": "231083"
                    },
                    {
                        "value": "宁安市",
                        "label": "宁安市",
                        "num": "231084"
                    },
                    {
                        "value": "穆棱市",
                        "label": "穆棱市",
                        "num": "231085"
                    },
                    {
                        "value": "东宁市",
                        "label": "东宁市",
                        "num": "231086"
                    }
                ]
            },
            {
                "value": "黑河市",
                "label": "黑河市",
                "num": "231100",
                "children": [{
                        "value": "爱辉区",
                        "label": "爱辉区",
                        "num": "231102"
                    },
                    {
                        "value": "嫩江县",
                        "label": "嫩江县",
                        "num": "231121"
                    },
                    {
                        "value": "逊克县",
                        "label": "逊克县",
                        "num": "231123"
                    },
                    {
                        "value": "孙吴县",
                        "label": "孙吴县",
                        "num": "231124"
                    },
                    {
                        "value": "北安市",
                        "label": "北安市",
                        "num": "231181"
                    },
                    {
                        "value": "五大连池市",
                        "label": "五大连池市",
                        "num": "231182"
                    }
                ]
            },
            {
                "value": "绥化市",
                "label": "绥化市",
                "num": "231200",
                "children": [{
                        "value": "北林区",
                        "label": "北林区",
                        "num": "231202"
                    },
                    {
                        "value": "望奎县",
                        "label": "望奎县",
                        "num": "231221"
                    },
                    {
                        "value": "兰西县",
                        "label": "兰西县",
                        "num": "231222"
                    },
                    {
                        "value": "青冈县",
                        "label": "青冈县",
                        "num": "231223"
                    },
                    {
                        "value": "庆安县",
                        "label": "庆安县",
                        "num": "231224"
                    },
                    {
                        "value": "明水县",
                        "label": "明水县",
                        "num": "231225"
                    },
                    {
                        "value": "绥棱县",
                        "label": "绥棱县",
                        "num": "231226"
                    },
                    {
                        "value": "安达市",
                        "label": "安达市",
                        "num": "231281"
                    },
                    {
                        "value": "肇东市",
                        "label": "肇东市",
                        "num": "231282"
                    },
                    {
                        "value": "海伦市",
                        "label": "海伦市",
                        "num": "231283"
                    }
                ]
            },
            {
                "value": "大兴安岭地区",
                "label": "大兴安岭地区",
                "num": "232700",
                "children": [{
                        "value": "漠河市",
                        "label": "漠河市",
                        "num": "232701"
                    },
                    {
                        "value": "呼玛县",
                        "label": "呼玛县",
                        "num": "232721"
                    },
                    {
                        "value": "塔河县",
                        "label": "塔河县",
                        "num": "232722"
                    },
                    {
                        "value": "松岭区",
                        "label": "松岭区",
                        "num": "232790"
                    },
                    {
                        "value": "呼中区",
                        "label": "呼中区",
                        "num": "232791"
                    },
                    {
                        "value": "加格达奇区",
                        "label": "加格达奇区",
                        "num": "232792"
                    },
                    {
                        "value": "新林区",
                        "label": "新林区",
                        "num": "232793"
                    }
                ]
            }
        ]
    },
    {
        "value": "上海市",
        "label": "上海市",
        "num": "310000",
        "children": [{
            "value": "上海市",
            "label": "上海市",
            "num": "310100",
            "children": [{
                    "value": "黄浦区",
                    "label": "黄浦区",
                    "num": "310101"
                },
                {
                    "value": "徐汇区",
                    "label": "徐汇区",
                    "num": "310104"
                },
                {
                    "value": "长宁区",
                    "label": "长宁区",
                    "num": "310105"
                },
                {
                    "value": "静安区",
                    "label": "静安区",
                    "num": "310106"
                },
                {
                    "value": "普陀区",
                    "label": "普陀区",
                    "num": "310107"
                },
                {
                    "value": "虹口区",
                    "label": "虹口区",
                    "num": "310109"
                },
                {
                    "value": "杨浦区",
                    "label": "杨浦区",
                    "num": "310110"
                },
                {
                    "value": "闵行区",
                    "label": "闵行区",
                    "num": "310112"
                },
                {
                    "value": "宝山区",
                    "label": "宝山区",
                    "num": "310113"
                },
                {
                    "value": "嘉定区",
                    "label": "嘉定区",
                    "num": "310114"
                },
                {
                    "value": "浦东新区",
                    "label": "浦东新区",
                    "num": "310115"
                },
                {
                    "value": "金山区",
                    "label": "金山区",
                    "num": "310116"
                },
                {
                    "value": "松江区",
                    "label": "松江区",
                    "num": "310117"
                },
                {
                    "value": "青浦区",
                    "label": "青浦区",
                    "num": "310118"
                },
                {
                    "value": "奉贤区",
                    "label": "奉贤区",
                    "num": "310120"
                },
                {
                    "value": "崇明区",
                    "label": "崇明区",
                    "num": "310151"
                }
            ]
        }]
    },
    {
        "value": "江苏省",
        "label": "江苏省",
        "num": "320000",
        "children": [{
                "value": "南京市",
                "label": "南京市",
                "num": "320100",
                "children": [{
                        "value": "玄武区",
                        "label": "玄武区",
                        "num": "320102"
                    },
                    {
                        "value": "秦淮区",
                        "label": "秦淮区",
                        "num": "320104"
                    },
                    {
                        "value": "建邺区",
                        "label": "建邺区",
                        "num": "320105"
                    },
                    {
                        "value": "鼓楼区",
                        "label": "鼓楼区",
                        "num": "320106"
                    },
                    {
                        "value": "浦口区",
                        "label": "浦口区",
                        "num": "320111"
                    },
                    {
                        "value": "栖霞区",
                        "label": "栖霞区",
                        "num": "320113"
                    },
                    {
                        "value": "雨花台区",
                        "label": "雨花台区",
                        "num": "320114"
                    },
                    {
                        "value": "江宁区",
                        "label": "江宁区",
                        "num": "320115"
                    },
                    {
                        "value": "六合区",
                        "label": "六合区",
                        "num": "320116"
                    },
                    {
                        "value": "溧水区",
                        "label": "溧水区",
                        "num": "320117"
                    },
                    {
                        "value": "高淳区",
                        "label": "高淳区",
                        "num": "320118"
                    }
                ]
            },
            {
                "value": "无锡市",
                "label": "无锡市",
                "num": "320200",
                "children": [{
                        "value": "锡山区",
                        "label": "锡山区",
                        "num": "320205"
                    },
                    {
                        "value": "惠山区",
                        "label": "惠山区",
                        "num": "320206"
                    },
                    {
                        "value": "滨湖区",
                        "label": "滨湖区",
                        "num": "320211"
                    },
                    {
                        "value": "梁溪区",
                        "label": "梁溪区",
                        "num": "320213"
                    },
                    {
                        "value": "新吴区",
                        "label": "新吴区",
                        "num": "320214"
                    },
                    {
                        "value": "江阴市",
                        "label": "江阴市",
                        "num": "320281"
                    },
                    {
                        "value": "宜兴市",
                        "label": "宜兴市",
                        "num": "320282"
                    }
                ]
            },
            {
                "value": "徐州市",
                "label": "徐州市",
                "num": "320300",
                "children": [{
                        "value": "鼓楼区",
                        "label": "鼓楼区",
                        "num": "320302"
                    },
                    {
                        "value": "云龙区",
                        "label": "云龙区",
                        "num": "320303"
                    },
                    {
                        "value": "贾汪区",
                        "label": "贾汪区",
                        "num": "320305"
                    },
                    {
                        "value": "泉山区",
                        "label": "泉山区",
                        "num": "320311"
                    },
                    {
                        "value": "铜山区",
                        "label": "铜山区",
                        "num": "320312"
                    },
                    {
                        "value": "丰县",
                        "label": "丰县",
                        "num": "320321"
                    },
                    {
                        "value": "沛县",
                        "label": "沛县",
                        "num": "320322"
                    },
                    {
                        "value": "睢宁县",
                        "label": "睢宁县",
                        "num": "320324"
                    },
                    {
                        "value": "新沂市",
                        "label": "新沂市",
                        "num": "320381"
                    },
                    {
                        "value": "邳州市",
                        "label": "邳州市",
                        "num": "320382"
                    },
                    {
                        "value": "工业园区",
                        "label": "工业园区",
                        "num": "320391"
                    }
                ]
            },
            {
                "value": "常州市",
                "label": "常州市",
                "num": "320400",
                "children": [{
                        "value": "天宁区",
                        "label": "天宁区",
                        "num": "320402"
                    },
                    {
                        "value": "钟楼区",
                        "label": "钟楼区",
                        "num": "320404"
                    },
                    {
                        "value": "新北区",
                        "label": "新北区",
                        "num": "320411"
                    },
                    {
                        "value": "武进区",
                        "label": "武进区",
                        "num": "320412"
                    },
                    {
                        "value": "金坛区",
                        "label": "金坛区",
                        "num": "320413"
                    },
                    {
                        "value": "溧阳市",
                        "label": "溧阳市",
                        "num": "320481"
                    }
                ]
            },
            {
                "value": "苏州市",
                "label": "苏州市",
                "num": "320500",
                "children": [{
                        "value": "虎丘区",
                        "label": "虎丘区",
                        "num": "320505"
                    },
                    {
                        "value": "吴中区",
                        "label": "吴中区",
                        "num": "320506"
                    },
                    {
                        "value": "相城区",
                        "label": "相城区",
                        "num": "320507"
                    },
                    {
                        "value": "姑苏区",
                        "label": "姑苏区",
                        "num": "320508"
                    },
                    {
                        "value": "吴江区",
                        "label": "吴江区",
                        "num": "320509"
                    },
                    {
                        "value": "常熟市",
                        "label": "常熟市",
                        "num": "320581"
                    },
                    {
                        "value": "张家港市",
                        "label": "张家港市",
                        "num": "320582"
                    },
                    {
                        "value": "昆山市",
                        "label": "昆山市",
                        "num": "320583"
                    },
                    {
                        "value": "太仓市",
                        "label": "太仓市",
                        "num": "320585"
                    },
                    {
                        "value": "工业园区",
                        "label": "工业园区",
                        "num": "320590"
                    },
                    {
                        "value": "高新区",
                        "label": "高新区",
                        "num": "320591"
                    }
                ]
            },
            {
                "value": "南通市",
                "label": "南通市",
                "num": "320600",
                "children": [{
                        "value": "崇川区",
                        "label": "崇川区",
                        "num": "320602"
                    },
                    {
                        "value": "港闸区",
                        "label": "港闸区",
                        "num": "320611"
                    },
                    {
                        "value": "通州区",
                        "label": "通州区",
                        "num": "320612"
                    },
                    {
                        "value": "如东县",
                        "label": "如东县",
                        "num": "320623"
                    },
                    {
                        "value": "启东市",
                        "label": "启东市",
                        "num": "320681"
                    },
                    {
                        "value": "如皋市",
                        "label": "如皋市",
                        "num": "320682"
                    },
                    {
                        "value": "海门市",
                        "label": "海门市",
                        "num": "320684"
                    },
                    {
                        "value": "海安市",
                        "label": "海安市",
                        "num": "320685"
                    },
                    {
                        "value": "高新区",
                        "label": "高新区",
                        "num": "320691"
                    }
                ]
            },
            {
                "value": "连云港市",
                "label": "连云港市",
                "num": "320700",
                "children": [{
                        "value": "连云区",
                        "label": "连云区",
                        "num": "320703"
                    },
                    {
                        "value": "海州区",
                        "label": "海州区",
                        "num": "320706"
                    },
                    {
                        "value": "赣榆区",
                        "label": "赣榆区",
                        "num": "320707"
                    },
                    {
                        "value": "东海县",
                        "label": "东海县",
                        "num": "320722"
                    },
                    {
                        "value": "灌云县",
                        "label": "灌云县",
                        "num": "320723"
                    },
                    {
                        "value": "灌南县",
                        "label": "灌南县",
                        "num": "320724"
                    }
                ]
            },
            {
                "value": "淮安市",
                "label": "淮安市",
                "num": "320800",
                "children": [{
                        "value": "淮安区",
                        "label": "淮安区",
                        "num": "320803"
                    },
                    {
                        "value": "淮阴区",
                        "label": "淮阴区",
                        "num": "320804"
                    },
                    {
                        "value": "清江浦区",
                        "label": "清江浦区",
                        "num": "320812"
                    },
                    {
                        "value": "洪泽区",
                        "label": "洪泽区",
                        "num": "320813"
                    },
                    {
                        "value": "涟水县",
                        "label": "涟水县",
                        "num": "320826"
                    },
                    {
                        "value": "盱眙县",
                        "label": "盱眙县",
                        "num": "320830"
                    },
                    {
                        "value": "金湖县",
                        "label": "金湖县",
                        "num": "320831"
                    },
                    {
                        "value": "经济开发区",
                        "label": "经济开发区",
                        "num": "320890"
                    }
                ]
            },
            {
                "value": "盐城市",
                "label": "盐城市",
                "num": "320900",
                "children": [{
                        "value": "亭湖区",
                        "label": "亭湖区",
                        "num": "320902"
                    },
                    {
                        "value": "盐都区",
                        "label": "盐都区",
                        "num": "320903"
                    },
                    {
                        "value": "大丰区",
                        "label": "大丰区",
                        "num": "320904"
                    },
                    {
                        "value": "响水县",
                        "label": "响水县",
                        "num": "320921"
                    },
                    {
                        "value": "滨海县",
                        "label": "滨海县",
                        "num": "320922"
                    },
                    {
                        "value": "阜宁县",
                        "label": "阜宁县",
                        "num": "320923"
                    },
                    {
                        "value": "射阳县",
                        "label": "射阳县",
                        "num": "320924"
                    },
                    {
                        "value": "建湖县",
                        "label": "建湖县",
                        "num": "320925"
                    },
                    {
                        "value": "东台市",
                        "label": "东台市",
                        "num": "320981"
                    }
                ]
            },
            {
                "value": "扬州市",
                "label": "扬州市",
                "num": "321000",
                "children": [{
                        "value": "广陵区",
                        "label": "广陵区",
                        "num": "321002"
                    },
                    {
                        "value": "邗江区",
                        "label": "邗江区",
                        "num": "321003"
                    },
                    {
                        "value": "江都区",
                        "label": "江都区",
                        "num": "321012"
                    },
                    {
                        "value": "宝应县",
                        "label": "宝应县",
                        "num": "321023"
                    },
                    {
                        "value": "仪征市",
                        "label": "仪征市",
                        "num": "321081"
                    },
                    {
                        "value": "高邮市",
                        "label": "高邮市",
                        "num": "321084"
                    },
                    {
                        "value": "经济开发区",
                        "label": "经济开发区",
                        "num": "321090"
                    }
                ]
            },
            {
                "value": "镇江市",
                "label": "镇江市",
                "num": "321100",
                "children": [{
                        "value": "京口区",
                        "label": "京口区",
                        "num": "321102"
                    },
                    {
                        "value": "润州区",
                        "label": "润州区",
                        "num": "321111"
                    },
                    {
                        "value": "丹徒区",
                        "label": "丹徒区",
                        "num": "321112"
                    },
                    {
                        "value": "丹阳市",
                        "label": "丹阳市",
                        "num": "321181"
                    },
                    {
                        "value": "扬中市",
                        "label": "扬中市",
                        "num": "321182"
                    },
                    {
                        "value": "句容市",
                        "label": "句容市",
                        "num": "321183"
                    }
                ]
            },
            {
                "value": "泰州市",
                "label": "泰州市",
                "num": "321200",
                "children": [{
                        "value": "海陵区",
                        "label": "海陵区",
                        "num": "321202"
                    },
                    {
                        "value": "高港区",
                        "label": "高港区",
                        "num": "321203"
                    },
                    {
                        "value": "姜堰区",
                        "label": "姜堰区",
                        "num": "321204"
                    },
                    {
                        "value": "兴化市",
                        "label": "兴化市",
                        "num": "321281"
                    },
                    {
                        "value": "靖江市",
                        "label": "靖江市",
                        "num": "321282"
                    },
                    {
                        "value": "泰兴市",
                        "label": "泰兴市",
                        "num": "321283"
                    }
                ]
            },
            {
                "value": "宿迁市",
                "label": "宿迁市",
                "num": "321300",
                "children": [{
                        "value": "宿城区",
                        "label": "宿城区",
                        "num": "321302"
                    },
                    {
                        "value": "宿豫区",
                        "label": "宿豫区",
                        "num": "321311"
                    },
                    {
                        "value": "沭阳县",
                        "label": "沭阳县",
                        "num": "321322"
                    },
                    {
                        "value": "泗阳县",
                        "label": "泗阳县",
                        "num": "321323"
                    },
                    {
                        "value": "泗洪县",
                        "label": "泗洪县",
                        "num": "321324"
                    }
                ]
            }
        ]
    },
    {
        "value": "浙江省",
        "label": "浙江省",
        "num": "330000",
        "children": [{
                "value": "杭州市",
                "label": "杭州市",
                "num": "330100",
                "children": [{
                        "value": "上城区",
                        "label": "上城区",
                        "num": "330102"
                    },
                    {
                        "value": "下城区",
                        "label": "下城区",
                        "num": "330103"
                    },
                    {
                        "value": "江干区",
                        "label": "江干区",
                        "num": "330104"
                    },
                    {
                        "value": "拱墅区",
                        "label": "拱墅区",
                        "num": "330105"
                    },
                    {
                        "value": "西湖区",
                        "label": "西湖区",
                        "num": "330106"
                    },
                    {
                        "value": "滨江区",
                        "label": "滨江区",
                        "num": "330108"
                    },
                    {
                        "value": "萧山区",
                        "label": "萧山区",
                        "num": "330109"
                    },
                    {
                        "value": "余杭区",
                        "label": "余杭区",
                        "num": "330110"
                    },
                    {
                        "value": "富阳区",
                        "label": "富阳区",
                        "num": "330111"
                    },
                    {
                        "value": "临安区",
                        "label": "临安区",
                        "num": "330112"
                    },
                    {
                        "value": "桐庐县",
                        "label": "桐庐县",
                        "num": "330122"
                    },
                    {
                        "value": "淳安县",
                        "label": "淳安县",
                        "num": "330127"
                    },
                    {
                        "value": "建德市",
                        "label": "建德市",
                        "num": "330182"
                    }
                ]
            },
            {
                "value": "宁波市",
                "label": "宁波市",
                "num": "330200",
                "children": [{
                        "value": "海曙区",
                        "label": "海曙区",
                        "num": "330203"
                    },
                    {
                        "value": "江北区",
                        "label": "江北区",
                        "num": "330205"
                    },
                    {
                        "value": "北仑区",
                        "label": "北仑区",
                        "num": "330206"
                    },
                    {
                        "value": "镇海区",
                        "label": "镇海区",
                        "num": "330211"
                    },
                    {
                        "value": "鄞州区",
                        "label": "鄞州区",
                        "num": "330212"
                    },
                    {
                        "value": "奉化区",
                        "label": "奉化区",
                        "num": "330213"
                    },
                    {
                        "value": "象山县",
                        "label": "象山县",
                        "num": "330225"
                    },
                    {
                        "value": "宁海县",
                        "label": "宁海县",
                        "num": "330226"
                    },
                    {
                        "value": "余姚市",
                        "label": "余姚市",
                        "num": "330281"
                    },
                    {
                        "value": "慈溪市",
                        "label": "慈溪市",
                        "num": "330282"
                    }
                ]
            },
            {
                "value": "温州市",
                "label": "温州市",
                "num": "330300",
                "children": [{
                        "value": "鹿城区",
                        "label": "鹿城区",
                        "num": "330302"
                    },
                    {
                        "value": "龙湾区",
                        "label": "龙湾区",
                        "num": "330303"
                    },
                    {
                        "value": "瓯海区",
                        "label": "瓯海区",
                        "num": "330304"
                    },
                    {
                        "value": "洞头区",
                        "label": "洞头区",
                        "num": "330305"
                    },
                    {
                        "value": "永嘉县",
                        "label": "永嘉县",
                        "num": "330324"
                    },
                    {
                        "value": "平阳县",
                        "label": "平阳县",
                        "num": "330326"
                    },
                    {
                        "value": "苍南县",
                        "label": "苍南县",
                        "num": "330327"
                    },
                    {
                        "value": "文成县",
                        "label": "文成县",
                        "num": "330328"
                    },
                    {
                        "value": "泰顺县",
                        "label": "泰顺县",
                        "num": "330329"
                    },
                    {
                        "value": "瑞安市",
                        "label": "瑞安市",
                        "num": "330381"
                    },
                    {
                        "value": "乐清市",
                        "label": "乐清市",
                        "num": "330382"
                    }
                ]
            },
            {
                "value": "嘉兴市",
                "label": "嘉兴市",
                "num": "330400",
                "children": [{
                        "value": "南湖区",
                        "label": "南湖区",
                        "num": "330402"
                    },
                    {
                        "value": "秀洲区",
                        "label": "秀洲区",
                        "num": "330411"
                    },
                    {
                        "value": "嘉善县",
                        "label": "嘉善县",
                        "num": "330421"
                    },
                    {
                        "value": "海盐县",
                        "label": "海盐县",
                        "num": "330424"
                    },
                    {
                        "value": "海宁市",
                        "label": "海宁市",
                        "num": "330481"
                    },
                    {
                        "value": "平湖市",
                        "label": "平湖市",
                        "num": "330482"
                    },
                    {
                        "value": "桐乡市",
                        "label": "桐乡市",
                        "num": "330483"
                    }
                ]
            },
            {
                "value": "湖州市",
                "label": "湖州市",
                "num": "330500",
                "children": [{
                        "value": "吴兴区",
                        "label": "吴兴区",
                        "num": "330502"
                    },
                    {
                        "value": "南浔区",
                        "label": "南浔区",
                        "num": "330503"
                    },
                    {
                        "value": "德清县",
                        "label": "德清县",
                        "num": "330521"
                    },
                    {
                        "value": "长兴县",
                        "label": "长兴县",
                        "num": "330522"
                    },
                    {
                        "value": "安吉县",
                        "label": "安吉县",
                        "num": "330523"
                    }
                ]
            },
            {
                "value": "绍兴市",
                "label": "绍兴市",
                "num": "330600",
                "children": [{
                        "value": "越城区",
                        "label": "越城区",
                        "num": "330602"
                    },
                    {
                        "value": "柯桥区",
                        "label": "柯桥区",
                        "num": "330603"
                    },
                    {
                        "value": "上虞区",
                        "label": "上虞区",
                        "num": "330604"
                    },
                    {
                        "value": "新昌县",
                        "label": "新昌县",
                        "num": "330624"
                    },
                    {
                        "value": "诸暨市",
                        "label": "诸暨市",
                        "num": "330681"
                    },
                    {
                        "value": "嵊州市",
                        "label": "嵊州市",
                        "num": "330683"
                    }
                ]
            },
            {
                "value": "金华市",
                "label": "金华市",
                "num": "330700",
                "children": [{
                        "value": "婺城区",
                        "label": "婺城区",
                        "num": "330702"
                    },
                    {
                        "value": "金东区",
                        "label": "金东区",
                        "num": "330703"
                    },
                    {
                        "value": "武义县",
                        "label": "武义县",
                        "num": "330723"
                    },
                    {
                        "value": "浦江县",
                        "label": "浦江县",
                        "num": "330726"
                    },
                    {
                        "value": "磐安县",
                        "label": "磐安县",
                        "num": "330727"
                    },
                    {
                        "value": "兰溪市",
                        "label": "兰溪市",
                        "num": "330781"
                    },
                    {
                        "value": "义乌市",
                        "label": "义乌市",
                        "num": "330782"
                    },
                    {
                        "value": "东阳市",
                        "label": "东阳市",
                        "num": "330783"
                    },
                    {
                        "value": "永康市",
                        "label": "永康市",
                        "num": "330784"
                    }
                ]
            },
            {
                "value": "衢州市",
                "label": "衢州市",
                "num": "330800",
                "children": [{
                        "value": "柯城区",
                        "label": "柯城区",
                        "num": "330802"
                    },
                    {
                        "value": "衢江区",
                        "label": "衢江区",
                        "num": "330803"
                    },
                    {
                        "value": "常山县",
                        "label": "常山县",
                        "num": "330822"
                    },
                    {
                        "value": "开化县",
                        "label": "开化县",
                        "num": "330824"
                    },
                    {
                        "value": "龙游县",
                        "label": "龙游县",
                        "num": "330825"
                    },
                    {
                        "value": "江山市",
                        "label": "江山市",
                        "num": "330881"
                    }
                ]
            },
            {
                "value": "舟山市",
                "label": "舟山市",
                "num": "330900",
                "children": [{
                        "value": "定海区",
                        "label": "定海区",
                        "num": "330902"
                    },
                    {
                        "value": "普陀区",
                        "label": "普陀区",
                        "num": "330903"
                    },
                    {
                        "value": "岱山县",
                        "label": "岱山县",
                        "num": "330921"
                    },
                    {
                        "value": "嵊泗县",
                        "label": "嵊泗县",
                        "num": "330922"
                    }
                ]
            },
            {
                "value": "台州市",
                "label": "台州市",
                "num": "331000",
                "children": [{
                        "value": "椒江区",
                        "label": "椒江区",
                        "num": "331002"
                    },
                    {
                        "value": "黄岩区",
                        "label": "黄岩区",
                        "num": "331003"
                    },
                    {
                        "value": "路桥区",
                        "label": "路桥区",
                        "num": "331004"
                    },
                    {
                        "value": "三门县",
                        "label": "三门县",
                        "num": "331022"
                    },
                    {
                        "value": "天台县",
                        "label": "天台县",
                        "num": "331023"
                    },
                    {
                        "value": "仙居县",
                        "label": "仙居县",
                        "num": "331024"
                    },
                    {
                        "value": "温岭市",
                        "label": "温岭市",
                        "num": "331081"
                    },
                    {
                        "value": "临海市",
                        "label": "临海市",
                        "num": "331082"
                    },
                    {
                        "value": "玉环市",
                        "label": "玉环市",
                        "num": "331083"
                    }
                ]
            },
            {
                "value": "丽水市",
                "label": "丽水市",
                "num": "331100",
                "children": [{
                        "value": "莲都区",
                        "label": "莲都区",
                        "num": "331102"
                    },
                    {
                        "value": "青田县",
                        "label": "青田县",
                        "num": "331121"
                    },
                    {
                        "value": "缙云县",
                        "label": "缙云县",
                        "num": "331122"
                    },
                    {
                        "value": "遂昌县",
                        "label": "遂昌县",
                        "num": "331123"
                    },
                    {
                        "value": "松阳县",
                        "label": "松阳县",
                        "num": "331124"
                    },
                    {
                        "value": "云和县",
                        "label": "云和县",
                        "num": "331125"
                    },
                    {
                        "value": "庆元县",
                        "label": "庆元县",
                        "num": "331126"
                    },
                    {
                        "value": "景宁畲族自治县",
                        "label": "景宁畲族自治县",
                        "num": "331127"
                    },
                    {
                        "value": "龙泉市",
                        "label": "龙泉市",
                        "num": "331181"
                    }
                ]
            }
        ]
    },
    {
        "value": "安徽省",
        "label": "安徽省",
        "num": "340000",
        "children": [{
                "value": "合肥市",
                "label": "合肥市",
                "num": "340100",
                "children": [{
                        "value": "瑶海区",
                        "label": "瑶海区",
                        "num": "340102"
                    },
                    {
                        "value": "庐阳区",
                        "label": "庐阳区",
                        "num": "340103"
                    },
                    {
                        "value": "蜀山区",
                        "label": "蜀山区",
                        "num": "340104"
                    },
                    {
                        "value": "包河区",
                        "label": "包河区",
                        "num": "340111"
                    },
                    {
                        "value": "长丰县",
                        "label": "长丰县",
                        "num": "340121"
                    },
                    {
                        "value": "肥东县",
                        "label": "肥东县",
                        "num": "340122"
                    },
                    {
                        "value": "肥西县",
                        "label": "肥西县",
                        "num": "340123"
                    },
                    {
                        "value": "庐江县",
                        "label": "庐江县",
                        "num": "340124"
                    },
                    {
                        "value": "巢湖市",
                        "label": "巢湖市",
                        "num": "340181"
                    },
                    {
                        "value": "高新技术开发区",
                        "label": "高新技术开发区",
                        "num": "340190"
                    },
                    {
                        "value": "经济技术开发区",
                        "label": "经济技术开发区",
                        "num": "340191"
                    }
                ]
            },
            {
                "value": "芜湖市",
                "label": "芜湖市",
                "num": "340200",
                "children": [{
                        "value": "镜湖区",
                        "label": "镜湖区",
                        "num": "340202"
                    },
                    {
                        "value": "弋江区",
                        "label": "弋江区",
                        "num": "340203"
                    },
                    {
                        "value": "鸠江区",
                        "label": "鸠江区",
                        "num": "340207"
                    },
                    {
                        "value": "三山区",
                        "label": "三山区",
                        "num": "340208"
                    },
                    {
                        "value": "芜湖县",
                        "label": "芜湖县",
                        "num": "340221"
                    },
                    {
                        "value": "繁昌县",
                        "label": "繁昌县",
                        "num": "340222"
                    },
                    {
                        "value": "南陵县",
                        "label": "南陵县",
                        "num": "340223"
                    },
                    {
                        "value": "无为县",
                        "label": "无为县",
                        "num": "340225"
                    }
                ]
            },
            {
                "value": "蚌埠市",
                "label": "蚌埠市",
                "num": "340300",
                "children": [{
                        "value": "龙子湖区",
                        "label": "龙子湖区",
                        "num": "340302"
                    },
                    {
                        "value": "蚌山区",
                        "label": "蚌山区",
                        "num": "340303"
                    },
                    {
                        "value": "禹会区",
                        "label": "禹会区",
                        "num": "340304"
                    },
                    {
                        "value": "淮上区",
                        "label": "淮上区",
                        "num": "340311"
                    },
                    {
                        "value": "怀远县",
                        "label": "怀远县",
                        "num": "340321"
                    },
                    {
                        "value": "五河县",
                        "label": "五河县",
                        "num": "340322"
                    },
                    {
                        "value": "固镇县",
                        "label": "固镇县",
                        "num": "340323"
                    }
                ]
            },
            {
                "value": "淮南市",
                "label": "淮南市",
                "num": "340400",
                "children": [{
                        "value": "大通区",
                        "label": "大通区",
                        "num": "340402"
                    },
                    {
                        "value": "田家庵区",
                        "label": "田家庵区",
                        "num": "340403"
                    },
                    {
                        "value": "谢家集区",
                        "label": "谢家集区",
                        "num": "340404"
                    },
                    {
                        "value": "八公山区",
                        "label": "八公山区",
                        "num": "340405"
                    },
                    {
                        "value": "潘集区",
                        "label": "潘集区",
                        "num": "340406"
                    },
                    {
                        "value": "凤台县",
                        "label": "凤台县",
                        "num": "340421"
                    },
                    {
                        "value": "寿县",
                        "label": "寿县",
                        "num": "340422"
                    }
                ]
            },
            {
                "value": "马鞍山市",
                "label": "马鞍山市",
                "num": "340500",
                "children": [{
                        "value": "花山区",
                        "label": "花山区",
                        "num": "340503"
                    },
                    {
                        "value": "雨山区",
                        "label": "雨山区",
                        "num": "340504"
                    },
                    {
                        "value": "博望区",
                        "label": "博望区",
                        "num": "340506"
                    },
                    {
                        "value": "当涂县",
                        "label": "当涂县",
                        "num": "340521"
                    },
                    {
                        "value": "含山县",
                        "label": "含山县",
                        "num": "340522"
                    },
                    {
                        "value": "和县",
                        "label": "和县",
                        "num": "340523"
                    }
                ]
            },
            {
                "value": "淮北市",
                "label": "淮北市",
                "num": "340600",
                "children": [{
                        "value": "杜集区",
                        "label": "杜集区",
                        "num": "340602"
                    },
                    {
                        "value": "相山区",
                        "label": "相山区",
                        "num": "340603"
                    },
                    {
                        "value": "烈山区",
                        "label": "烈山区",
                        "num": "340604"
                    },
                    {
                        "value": "濉溪县",
                        "label": "濉溪县",
                        "num": "340621"
                    }
                ]
            },
            {
                "value": "铜陵市",
                "label": "铜陵市",
                "num": "340700",
                "children": [{
                        "value": "铜官区",
                        "label": "铜官区",
                        "num": "340705"
                    },
                    {
                        "value": "义安区",
                        "label": "义安区",
                        "num": "340706"
                    },
                    {
                        "value": "郊区",
                        "label": "郊区",
                        "num": "340711"
                    },
                    {
                        "value": "枞阳县",
                        "label": "枞阳县",
                        "num": "340722"
                    }
                ]
            },
            {
                "value": "安庆市",
                "label": "安庆市",
                "num": "340800",
                "children": [{
                        "value": "迎江区",
                        "label": "迎江区",
                        "num": "340802"
                    },
                    {
                        "value": "大观区",
                        "label": "大观区",
                        "num": "340803"
                    },
                    {
                        "value": "宜秀区",
                        "label": "宜秀区",
                        "num": "340811"
                    },
                    {
                        "value": "怀宁县",
                        "label": "怀宁县",
                        "num": "340822"
                    },
                    {
                        "value": "潜山县",
                        "label": "潜山县",
                        "num": "340824"
                    },
                    {
                        "value": "太湖县",
                        "label": "太湖县",
                        "num": "340825"
                    },
                    {
                        "value": "宿松县",
                        "label": "宿松县",
                        "num": "340826"
                    },
                    {
                        "value": "望江县",
                        "label": "望江县",
                        "num": "340827"
                    },
                    {
                        "value": "岳西县",
                        "label": "岳西县",
                        "num": "340828"
                    },
                    {
                        "value": "桐城市",
                        "label": "桐城市",
                        "num": "340881"
                    }
                ]
            },
            {
                "value": "黄山市",
                "label": "黄山市",
                "num": "341000",
                "children": [{
                        "value": "屯溪区",
                        "label": "屯溪区",
                        "num": "341002"
                    },
                    {
                        "value": "黄山区",
                        "label": "黄山区",
                        "num": "341003"
                    },
                    {
                        "value": "徽州区",
                        "label": "徽州区",
                        "num": "341004"
                    },
                    {
                        "value": "歙县",
                        "label": "歙县",
                        "num": "341021"
                    },
                    {
                        "value": "休宁县",
                        "label": "休宁县",
                        "num": "341022"
                    },
                    {
                        "value": "黟县",
                        "label": "黟县",
                        "num": "341023"
                    },
                    {
                        "value": "祁门县",
                        "label": "祁门县",
                        "num": "341024"
                    }
                ]
            },
            {
                "value": "滁州市",
                "label": "滁州市",
                "num": "341100",
                "children": [{
                        "value": "琅琊区",
                        "label": "琅琊区",
                        "num": "341102"
                    },
                    {
                        "value": "南谯区",
                        "label": "南谯区",
                        "num": "341103"
                    },
                    {
                        "value": "来安县",
                        "label": "来安县",
                        "num": "341122"
                    },
                    {
                        "value": "全椒县",
                        "label": "全椒县",
                        "num": "341124"
                    },
                    {
                        "value": "定远县",
                        "label": "定远县",
                        "num": "341125"
                    },
                    {
                        "value": "凤阳县",
                        "label": "凤阳县",
                        "num": "341126"
                    },
                    {
                        "value": "天长市",
                        "label": "天长市",
                        "num": "341181"
                    },
                    {
                        "value": "明光市",
                        "label": "明光市",
                        "num": "341182"
                    }
                ]
            },
            {
                "value": "阜阳市",
                "label": "阜阳市",
                "num": "341200",
                "children": [{
                        "value": "颍州区",
                        "label": "颍州区",
                        "num": "341202"
                    },
                    {
                        "value": "颍东区",
                        "label": "颍东区",
                        "num": "341203"
                    },
                    {
                        "value": "颍泉区",
                        "label": "颍泉区",
                        "num": "341204"
                    },
                    {
                        "value": "临泉县",
                        "label": "临泉县",
                        "num": "341221"
                    },
                    {
                        "value": "太和县",
                        "label": "太和县",
                        "num": "341222"
                    },
                    {
                        "value": "阜南县",
                        "label": "阜南县",
                        "num": "341225"
                    },
                    {
                        "value": "颍上县",
                        "label": "颍上县",
                        "num": "341226"
                    },
                    {
                        "value": "界首市",
                        "label": "界首市",
                        "num": "341282"
                    }
                ]
            },
            {
                "value": "宿州市",
                "label": "宿州市",
                "num": "341300",
                "children": [{
                        "value": "埇桥区",
                        "label": "埇桥区",
                        "num": "341302"
                    },
                    {
                        "value": "砀山县",
                        "label": "砀山县",
                        "num": "341321"
                    },
                    {
                        "value": "萧县",
                        "label": "萧县",
                        "num": "341322"
                    },
                    {
                        "value": "灵璧县",
                        "label": "灵璧县",
                        "num": "341323"
                    },
                    {
                        "value": "泗县",
                        "label": "泗县",
                        "num": "341324"
                    },
                    {
                        "value": "经济开发区",
                        "label": "经济开发区",
                        "num": "341390"
                    }
                ]
            },
            {
                "value": "六安市",
                "label": "六安市",
                "num": "341500",
                "children": [{
                        "value": "金安区",
                        "label": "金安区",
                        "num": "341502"
                    },
                    {
                        "value": "裕安区",
                        "label": "裕安区",
                        "num": "341503"
                    },
                    {
                        "value": "叶集区",
                        "label": "叶集区",
                        "num": "341504"
                    },
                    {
                        "value": "霍邱县",
                        "label": "霍邱县",
                        "num": "341522"
                    },
                    {
                        "value": "舒城县",
                        "label": "舒城县",
                        "num": "341523"
                    },
                    {
                        "value": "金寨县",
                        "label": "金寨县",
                        "num": "341524"
                    },
                    {
                        "value": "霍山县",
                        "label": "霍山县",
                        "num": "341525"
                    }
                ]
            },
            {
                "value": "亳州市",
                "label": "亳州市",
                "num": "341600",
                "children": [{
                        "value": "谯城区",
                        "label": "谯城区",
                        "num": "341602"
                    },
                    {
                        "value": "涡阳县",
                        "label": "涡阳县",
                        "num": "341621"
                    },
                    {
                        "value": "蒙城县",
                        "label": "蒙城县",
                        "num": "341622"
                    },
                    {
                        "value": "利辛县",
                        "label": "利辛县",
                        "num": "341623"
                    }
                ]
            },
            {
                "value": "池州市",
                "label": "池州市",
                "num": "341700",
                "children": [{
                        "value": "贵池区",
                        "label": "贵池区",
                        "num": "341702"
                    },
                    {
                        "value": "东至县",
                        "label": "东至县",
                        "num": "341721"
                    },
                    {
                        "value": "石台县",
                        "label": "石台县",
                        "num": "341722"
                    },
                    {
                        "value": "青阳县",
                        "label": "青阳县",
                        "num": "341723"
                    }
                ]
            },
            {
                "value": "宣城市",
                "label": "宣城市",
                "num": "341800",
                "children": [{
                        "value": "宣州区",
                        "label": "宣州区",
                        "num": "341802"
                    },
                    {
                        "value": "郎溪县",
                        "label": "郎溪县",
                        "num": "341821"
                    },
                    {
                        "value": "广德县",
                        "label": "广德县",
                        "num": "341822"
                    },
                    {
                        "value": "泾县",
                        "label": "泾县",
                        "num": "341823"
                    },
                    {
                        "value": "绩溪县",
                        "label": "绩溪县",
                        "num": "341824"
                    },
                    {
                        "value": "旌德县",
                        "label": "旌德县",
                        "num": "341825"
                    },
                    {
                        "value": "宁国市",
                        "label": "宁国市",
                        "num": "341881"
                    }
                ]
            }
        ]
    },
    {
        "value": "福建省",
        "label": "福建省",
        "num": "350000",
        "children": [{
                "value": "福州市",
                "label": "福州市",
                "num": "350100",
                "children": [{
                        "value": "鼓楼区",
                        "label": "鼓楼区",
                        "num": "350102"
                    },
                    {
                        "value": "台江区",
                        "label": "台江区",
                        "num": "350103"
                    },
                    {
                        "value": "仓山区",
                        "label": "仓山区",
                        "num": "350104"
                    },
                    {
                        "value": "马尾区",
                        "label": "马尾区",
                        "num": "350105"
                    },
                    {
                        "value": "晋安区",
                        "label": "晋安区",
                        "num": "350111"
                    },
                    {
                        "value": "长乐区",
                        "label": "长乐区",
                        "num": "350112"
                    },
                    {
                        "value": "闽侯县",
                        "label": "闽侯县",
                        "num": "350121"
                    },
                    {
                        "value": "连江县",
                        "label": "连江县",
                        "num": "350122"
                    },
                    {
                        "value": "罗源县",
                        "label": "罗源县",
                        "num": "350123"
                    },
                    {
                        "value": "闽清县",
                        "label": "闽清县",
                        "num": "350124"
                    },
                    {
                        "value": "永泰县",
                        "label": "永泰县",
                        "num": "350125"
                    },
                    {
                        "value": "平潭县",
                        "label": "平潭县",
                        "num": "350128"
                    },
                    {
                        "value": "福清市",
                        "label": "福清市",
                        "num": "350181"
                    }
                ]
            },
            {
                "value": "厦门市",
                "label": "厦门市",
                "num": "350200",
                "children": [{
                        "value": "思明区",
                        "label": "思明区",
                        "num": "350203"
                    },
                    {
                        "value": "海沧区",
                        "label": "海沧区",
                        "num": "350205"
                    },
                    {
                        "value": "湖里区",
                        "label": "湖里区",
                        "num": "350206"
                    },
                    {
                        "value": "集美区",
                        "label": "集美区",
                        "num": "350211"
                    },
                    {
                        "value": "同安区",
                        "label": "同安区",
                        "num": "350212"
                    },
                    {
                        "value": "翔安区",
                        "label": "翔安区",
                        "num": "350213"
                    }
                ]
            },
            {
                "value": "莆田市",
                "label": "莆田市",
                "num": "350300",
                "children": [{
                        "value": "城厢区",
                        "label": "城厢区",
                        "num": "350302"
                    },
                    {
                        "value": "涵江区",
                        "label": "涵江区",
                        "num": "350303"
                    },
                    {
                        "value": "荔城区",
                        "label": "荔城区",
                        "num": "350304"
                    },
                    {
                        "value": "秀屿区",
                        "label": "秀屿区",
                        "num": "350305"
                    },
                    {
                        "value": "仙游县",
                        "label": "仙游县",
                        "num": "350322"
                    }
                ]
            },
            {
                "value": "三明市",
                "label": "三明市",
                "num": "350400",
                "children": [{
                        "value": "梅列区",
                        "label": "梅列区",
                        "num": "350402"
                    },
                    {
                        "value": "三元区",
                        "label": "三元区",
                        "num": "350403"
                    },
                    {
                        "value": "明溪县",
                        "label": "明溪县",
                        "num": "350421"
                    },
                    {
                        "value": "清流县",
                        "label": "清流县",
                        "num": "350423"
                    },
                    {
                        "value": "宁化县",
                        "label": "宁化县",
                        "num": "350424"
                    },
                    {
                        "value": "大田县",
                        "label": "大田县",
                        "num": "350425"
                    },
                    {
                        "value": "尤溪县",
                        "label": "尤溪县",
                        "num": "350426"
                    },
                    {
                        "value": "沙县",
                        "label": "沙县",
                        "num": "350427"
                    },
                    {
                        "value": "将乐县",
                        "label": "将乐县",
                        "num": "350428"
                    },
                    {
                        "value": "泰宁县",
                        "label": "泰宁县",
                        "num": "350429"
                    },
                    {
                        "value": "建宁县",
                        "label": "建宁县",
                        "num": "350430"
                    },
                    {
                        "value": "永安市",
                        "label": "永安市",
                        "num": "350481"
                    }
                ]
            },
            {
                "value": "泉州市",
                "label": "泉州市",
                "num": "350500",
                "children": [{
                        "value": "鲤城区",
                        "label": "鲤城区",
                        "num": "350502"
                    },
                    {
                        "value": "丰泽区",
                        "label": "丰泽区",
                        "num": "350503"
                    },
                    {
                        "value": "洛江区",
                        "label": "洛江区",
                        "num": "350504"
                    },
                    {
                        "value": "泉港区",
                        "label": "泉港区",
                        "num": "350505"
                    },
                    {
                        "value": "惠安县",
                        "label": "惠安县",
                        "num": "350521"
                    },
                    {
                        "value": "安溪县",
                        "label": "安溪县",
                        "num": "350524"
                    },
                    {
                        "value": "永春县",
                        "label": "永春县",
                        "num": "350525"
                    },
                    {
                        "value": "德化县",
                        "label": "德化县",
                        "num": "350526"
                    },
                    {
                        "value": "金门县",
                        "label": "金门县",
                        "num": "350527"
                    },
                    {
                        "value": "石狮市",
                        "label": "石狮市",
                        "num": "350581"
                    },
                    {
                        "value": "晋江市",
                        "label": "晋江市",
                        "num": "350582"
                    },
                    {
                        "value": "南安市",
                        "label": "南安市",
                        "num": "350583"
                    }
                ]
            },
            {
                "value": "漳州市",
                "label": "漳州市",
                "num": "350600",
                "children": [{
                        "value": "芗城区",
                        "label": "芗城区",
                        "num": "350602"
                    },
                    {
                        "value": "龙文区",
                        "label": "龙文区",
                        "num": "350603"
                    },
                    {
                        "value": "云霄县",
                        "label": "云霄县",
                        "num": "350622"
                    },
                    {
                        "value": "漳浦县",
                        "label": "漳浦县",
                        "num": "350623"
                    },
                    {
                        "value": "诏安县",
                        "label": "诏安县",
                        "num": "350624"
                    },
                    {
                        "value": "长泰县",
                        "label": "长泰县",
                        "num": "350625"
                    },
                    {
                        "value": "东山县",
                        "label": "东山县",
                        "num": "350626"
                    },
                    {
                        "value": "南靖县",
                        "label": "南靖县",
                        "num": "350627"
                    },
                    {
                        "value": "平和县",
                        "label": "平和县",
                        "num": "350628"
                    },
                    {
                        "value": "华安县",
                        "label": "华安县",
                        "num": "350629"
                    },
                    {
                        "value": "龙海市",
                        "label": "龙海市",
                        "num": "350681"
                    }
                ]
            },
            {
                "value": "南平市",
                "label": "南平市",
                "num": "350700",
                "children": [{
                        "value": "延平区",
                        "label": "延平区",
                        "num": "350702"
                    },
                    {
                        "value": "建阳区",
                        "label": "建阳区",
                        "num": "350703"
                    },
                    {
                        "value": "顺昌县",
                        "label": "顺昌县",
                        "num": "350721"
                    },
                    {
                        "value": "浦城县",
                        "label": "浦城县",
                        "num": "350722"
                    },
                    {
                        "value": "光泽县",
                        "label": "光泽县",
                        "num": "350723"
                    },
                    {
                        "value": "松溪县",
                        "label": "松溪县",
                        "num": "350724"
                    },
                    {
                        "value": "政和县",
                        "label": "政和县",
                        "num": "350725"
                    },
                    {
                        "value": "邵武市",
                        "label": "邵武市",
                        "num": "350781"
                    },
                    {
                        "value": "武夷山市",
                        "label": "武夷山市",
                        "num": "350782"
                    },
                    {
                        "value": "建瓯市",
                        "label": "建瓯市",
                        "num": "350783"
                    }
                ]
            },
            {
                "value": "龙岩市",
                "label": "龙岩市",
                "num": "350800",
                "children": [{
                        "value": "新罗区",
                        "label": "新罗区",
                        "num": "350802"
                    },
                    {
                        "value": "永定区",
                        "label": "永定区",
                        "num": "350803"
                    },
                    {
                        "value": "长汀县",
                        "label": "长汀县",
                        "num": "350821"
                    },
                    {
                        "value": "上杭县",
                        "label": "上杭县",
                        "num": "350823"
                    },
                    {
                        "value": "武平县",
                        "label": "武平县",
                        "num": "350824"
                    },
                    {
                        "value": "连城县",
                        "label": "连城县",
                        "num": "350825"
                    },
                    {
                        "value": "漳平市",
                        "label": "漳平市",
                        "num": "350881"
                    }
                ]
            },
            {
                "value": "宁德市",
                "label": "宁德市",
                "num": "350900",
                "children": [{
                        "value": "蕉城区",
                        "label": "蕉城区",
                        "num": "350902"
                    },
                    {
                        "value": "霞浦县",
                        "label": "霞浦县",
                        "num": "350921"
                    },
                    {
                        "value": "古田县",
                        "label": "古田县",
                        "num": "350922"
                    },
                    {
                        "value": "屏南县",
                        "label": "屏南县",
                        "num": "350923"
                    },
                    {
                        "value": "寿宁县",
                        "label": "寿宁县",
                        "num": "350924"
                    },
                    {
                        "value": "周宁县",
                        "label": "周宁县",
                        "num": "350925"
                    },
                    {
                        "value": "柘荣县",
                        "label": "柘荣县",
                        "num": "350926"
                    },
                    {
                        "value": "福安市",
                        "label": "福安市",
                        "num": "350981"
                    },
                    {
                        "value": "福鼎市",
                        "label": "福鼎市",
                        "num": "350982"
                    }
                ]
            }
        ]
    },
    {
        "value": "江西省",
        "label": "江西省",
        "num": "360000",
        "children": [{
                "value": "南昌市",
                "label": "南昌市",
                "num": "360100",
                "children": [{
                        "value": "东湖区",
                        "label": "东湖区",
                        "num": "360102"
                    },
                    {
                        "value": "西湖区",
                        "label": "西湖区",
                        "num": "360103"
                    },
                    {
                        "value": "青云谱区",
                        "label": "青云谱区",
                        "num": "360104"
                    },
                    {
                        "value": "湾里区",
                        "label": "湾里区",
                        "num": "360105"
                    },
                    {
                        "value": "青山湖区",
                        "label": "青山湖区",
                        "num": "360111"
                    },
                    {
                        "value": "新建区",
                        "label": "新建区",
                        "num": "360112"
                    },
                    {
                        "value": "南昌县",
                        "label": "南昌县",
                        "num": "360121"
                    },
                    {
                        "value": "安义县",
                        "label": "安义县",
                        "num": "360123"
                    },
                    {
                        "value": "进贤县",
                        "label": "进贤县",
                        "num": "360124"
                    },
                    {
                        "value": "经济技术开发区",
                        "label": "经济技术开发区",
                        "num": "360190"
                    },
                    {
                        "value": "高新区",
                        "label": "高新区",
                        "num": "360192"
                    }
                ]
            },
            {
                "value": "景德镇市",
                "label": "景德镇市",
                "num": "360200",
                "children": [{
                        "value": "昌江区",
                        "label": "昌江区",
                        "num": "360202"
                    },
                    {
                        "value": "珠山区",
                        "label": "珠山区",
                        "num": "360203"
                    },
                    {
                        "value": "浮梁县",
                        "label": "浮梁县",
                        "num": "360222"
                    },
                    {
                        "value": "乐平市",
                        "label": "乐平市",
                        "num": "360281"
                    }
                ]
            },
            {
                "value": "萍乡市",
                "label": "萍乡市",
                "num": "360300",
                "children": [{
                        "value": "安源区",
                        "label": "安源区",
                        "num": "360302"
                    },
                    {
                        "value": "湘东区",
                        "label": "湘东区",
                        "num": "360313"
                    },
                    {
                        "value": "莲花县",
                        "label": "莲花县",
                        "num": "360321"
                    },
                    {
                        "value": "上栗县",
                        "label": "上栗县",
                        "num": "360322"
                    },
                    {
                        "value": "芦溪县",
                        "label": "芦溪县",
                        "num": "360323"
                    }
                ]
            },
            {
                "value": "九江市",
                "label": "九江市",
                "num": "360400",
                "children": [{
                        "value": "濂溪区",
                        "label": "濂溪区",
                        "num": "360402"
                    },
                    {
                        "value": "浔阳区",
                        "label": "浔阳区",
                        "num": "360403"
                    },
                    {
                        "value": "柴桑区",
                        "label": "柴桑区",
                        "num": "360404"
                    },
                    {
                        "value": "武宁县",
                        "label": "武宁县",
                        "num": "360423"
                    },
                    {
                        "value": "修水县",
                        "label": "修水县",
                        "num": "360424"
                    },
                    {
                        "value": "永修县",
                        "label": "永修县",
                        "num": "360425"
                    },
                    {
                        "value": "德安县",
                        "label": "德安县",
                        "num": "360426"
                    },
                    {
                        "value": "都昌县",
                        "label": "都昌县",
                        "num": "360428"
                    },
                    {
                        "value": "湖口县",
                        "label": "湖口县",
                        "num": "360429"
                    },
                    {
                        "value": "彭泽县",
                        "label": "彭泽县",
                        "num": "360430"
                    },
                    {
                        "value": "瑞昌市",
                        "label": "瑞昌市",
                        "num": "360481"
                    },
                    {
                        "value": "共青城市",
                        "label": "共青城市",
                        "num": "360482"
                    },
                    {
                        "value": "庐山市",
                        "label": "庐山市",
                        "num": "360483"
                    },
                    {
                        "value": "经济技术开发区",
                        "label": "经济技术开发区",
                        "num": "360490"
                    }
                ]
            },
            {
                "value": "新余市",
                "label": "新余市",
                "num": "360500",
                "children": [{
                        "value": "渝水区",
                        "label": "渝水区",
                        "num": "360502"
                    },
                    {
                        "value": "分宜县",
                        "label": "分宜县",
                        "num": "360521"
                    }
                ]
            },
            {
                "value": "鹰潭市",
                "label": "鹰潭市",
                "num": "360600",
                "children": [{
                        "value": "月湖区",
                        "label": "月湖区",
                        "num": "360602"
                    },
                    {
                        "value": "余江区",
                        "label": "余江区",
                        "num": "360603"
                    },
                    {
                        "value": "贵溪市",
                        "label": "贵溪市",
                        "num": "360681"
                    }
                ]
            },
            {
                "value": "赣州市",
                "label": "赣州市",
                "num": "360700",
                "children": [{
                        "value": "章贡区",
                        "label": "章贡区",
                        "num": "360702"
                    },
                    {
                        "value": "南康区",
                        "label": "南康区",
                        "num": "360703"
                    },
                    {
                        "value": "赣县区",
                        "label": "赣县区",
                        "num": "360704"
                    },
                    {
                        "value": "信丰县",
                        "label": "信丰县",
                        "num": "360722"
                    },
                    {
                        "value": "大余县",
                        "label": "大余县",
                        "num": "360723"
                    },
                    {
                        "value": "上犹县",
                        "label": "上犹县",
                        "num": "360724"
                    },
                    {
                        "value": "崇义县",
                        "label": "崇义县",
                        "num": "360725"
                    },
                    {
                        "value": "安远县",
                        "label": "安远县",
                        "num": "360726"
                    },
                    {
                        "value": "龙南县",
                        "label": "龙南县",
                        "num": "360727"
                    },
                    {
                        "value": "定南县",
                        "label": "定南县",
                        "num": "360728"
                    },
                    {
                        "value": "全南县",
                        "label": "全南县",
                        "num": "360729"
                    },
                    {
                        "value": "宁都县",
                        "label": "宁都县",
                        "num": "360730"
                    },
                    {
                        "value": "于都县",
                        "label": "于都县",
                        "num": "360731"
                    },
                    {
                        "value": "兴国县",
                        "label": "兴国县",
                        "num": "360732"
                    },
                    {
                        "value": "会昌县",
                        "label": "会昌县",
                        "num": "360733"
                    },
                    {
                        "value": "寻乌县",
                        "label": "寻乌县",
                        "num": "360734"
                    },
                    {
                        "value": "石城县",
                        "label": "石城县",
                        "num": "360735"
                    },
                    {
                        "value": "瑞金市",
                        "label": "瑞金市",
                        "num": "360781"
                    }
                ]
            },
            {
                "value": "吉安市",
                "label": "吉安市",
                "num": "360800",
                "children": [{
                        "value": "吉州区",
                        "label": "吉州区",
                        "num": "360802"
                    },
                    {
                        "value": "青原区",
                        "label": "青原区",
                        "num": "360803"
                    },
                    {
                        "value": "吉安县",
                        "label": "吉安县",
                        "num": "360821"
                    },
                    {
                        "value": "吉水县",
                        "label": "吉水县",
                        "num": "360822"
                    },
                    {
                        "value": "峡江县",
                        "label": "峡江县",
                        "num": "360823"
                    },
                    {
                        "value": "新干县",
                        "label": "新干县",
                        "num": "360824"
                    },
                    {
                        "value": "永丰县",
                        "label": "永丰县",
                        "num": "360825"
                    },
                    {
                        "value": "泰和县",
                        "label": "泰和县",
                        "num": "360826"
                    },
                    {
                        "value": "遂川县",
                        "label": "遂川县",
                        "num": "360827"
                    },
                    {
                        "value": "万安县",
                        "label": "万安县",
                        "num": "360828"
                    },
                    {
                        "value": "安福县",
                        "label": "安福县",
                        "num": "360829"
                    },
                    {
                        "value": "永新县",
                        "label": "永新县",
                        "num": "360830"
                    },
                    {
                        "value": "井冈山市",
                        "label": "井冈山市",
                        "num": "360881"
                    }
                ]
            },
            {
                "value": "宜春市",
                "label": "宜春市",
                "num": "360900",
                "children": [{
                        "value": "袁州区",
                        "label": "袁州区",
                        "num": "360902"
                    },
                    {
                        "value": "奉新县",
                        "label": "奉新县",
                        "num": "360921"
                    },
                    {
                        "value": "万载县",
                        "label": "万载县",
                        "num": "360922"
                    },
                    {
                        "value": "上高县",
                        "label": "上高县",
                        "num": "360923"
                    },
                    {
                        "value": "宜丰县",
                        "label": "宜丰县",
                        "num": "360924"
                    },
                    {
                        "value": "靖安县",
                        "label": "靖安县",
                        "num": "360925"
                    },
                    {
                        "value": "铜鼓县",
                        "label": "铜鼓县",
                        "num": "360926"
                    },
                    {
                        "value": "丰城市",
                        "label": "丰城市",
                        "num": "360981"
                    },
                    {
                        "value": "樟树市",
                        "label": "樟树市",
                        "num": "360982"
                    },
                    {
                        "value": "高安市",
                        "label": "高安市",
                        "num": "360983"
                    }
                ]
            },
            {
                "value": "抚州市",
                "label": "抚州市",
                "num": "361000",
                "children": [{
                        "value": "临川区",
                        "label": "临川区",
                        "num": "361002"
                    },
                    {
                        "value": "东乡区",
                        "label": "东乡区",
                        "num": "361003"
                    },
                    {
                        "value": "南城县",
                        "label": "南城县",
                        "num": "361021"
                    },
                    {
                        "value": "黎川县",
                        "label": "黎川县",
                        "num": "361022"
                    },
                    {
                        "value": "南丰县",
                        "label": "南丰县",
                        "num": "361023"
                    },
                    {
                        "value": "崇仁县",
                        "label": "崇仁县",
                        "num": "361024"
                    },
                    {
                        "value": "乐安县",
                        "label": "乐安县",
                        "num": "361025"
                    },
                    {
                        "value": "宜黄县",
                        "label": "宜黄县",
                        "num": "361026"
                    },
                    {
                        "value": "金溪县",
                        "label": "金溪县",
                        "num": "361027"
                    },
                    {
                        "value": "资溪县",
                        "label": "资溪县",
                        "num": "361028"
                    },
                    {
                        "value": "广昌县",
                        "label": "广昌县",
                        "num": "361030"
                    }
                ]
            },
            {
                "value": "上饶市",
                "label": "上饶市",
                "num": "361100",
                "children": [{
                        "value": "信州区",
                        "label": "信州区",
                        "num": "361102"
                    },
                    {
                        "value": "广丰区",
                        "label": "广丰区",
                        "num": "361103"
                    },
                    {
                        "value": "上饶县",
                        "label": "上饶县",
                        "num": "361121"
                    },
                    {
                        "value": "玉山县",
                        "label": "玉山县",
                        "num": "361123"
                    },
                    {
                        "value": "铅山县",
                        "label": "铅山县",
                        "num": "361124"
                    },
                    {
                        "value": "横峰县",
                        "label": "横峰县",
                        "num": "361125"
                    },
                    {
                        "value": "弋阳县",
                        "label": "弋阳县",
                        "num": "361126"
                    },
                    {
                        "value": "余干县",
                        "label": "余干县",
                        "num": "361127"
                    },
                    {
                        "value": "鄱阳县",
                        "label": "鄱阳县",
                        "num": "361128"
                    },
                    {
                        "value": "万年县",
                        "label": "万年县",
                        "num": "361129"
                    },
                    {
                        "value": "婺源县",
                        "label": "婺源县",
                        "num": "361130"
                    },
                    {
                        "value": "德兴市",
                        "label": "德兴市",
                        "num": "361181"
                    }
                ]
            }
        ]
    },
    {
        "value": "山东省",
        "label": "山东省",
        "num": "370000",
        "children": [{
                "value": "济南市",
                "label": "济南市",
                "num": "370100",
                "children": [{
                        "value": "历下区",
                        "label": "历下区",
                        "num": "370102"
                    },
                    {
                        "value": "市中区",
                        "label": "市中区",
                        "num": "370103"
                    },
                    {
                        "value": "槐荫区",
                        "label": "槐荫区",
                        "num": "370104"
                    },
                    {
                        "value": "天桥区",
                        "label": "天桥区",
                        "num": "370105"
                    },
                    {
                        "value": "历城区",
                        "label": "历城区",
                        "num": "370112"
                    },
                    {
                        "value": "长清区",
                        "label": "长清区",
                        "num": "370113"
                    },
                    {
                        "value": "章丘区",
                        "label": "章丘区",
                        "num": "370114"
                    },
                    {
                        "value": "济阳区",
                        "label": "济阳区",
                        "num": "370115"
                    },
                    {
                        "value": "平阴县",
                        "label": "平阴县",
                        "num": "370124"
                    },
                    {
                        "value": "商河县",
                        "label": "商河县",
                        "num": "370126"
                    },
                    {
                        "value": "高新区",
                        "label": "高新区",
                        "num": "370190"
                    },
                    {
                        "value": "莱芜区",
                        "label": "莱芜区",
                        "num": "370191"
                    }
                ]
            },
            {
                "value": "青岛市",
                "label": "青岛市",
                "num": "370200",
                "children": [{
                        "value": "市南区",
                        "label": "市南区",
                        "num": "370202"
                    },
                    {
                        "value": "市北区",
                        "label": "市北区",
                        "num": "370203"
                    },
                    {
                        "value": "黄岛区",
                        "label": "黄岛区",
                        "num": "370211"
                    },
                    {
                        "value": "崂山区",
                        "label": "崂山区",
                        "num": "370212"
                    },
                    {
                        "value": "李沧区",
                        "label": "李沧区",
                        "num": "370213"
                    },
                    {
                        "value": "城阳区",
                        "label": "城阳区",
                        "num": "370214"
                    },
                    {
                        "value": "即墨区",
                        "label": "即墨区",
                        "num": "370215"
                    },
                    {
                        "value": "胶州市",
                        "label": "胶州市",
                        "num": "370281"
                    },
                    {
                        "value": "平度市",
                        "label": "平度市",
                        "num": "370283"
                    },
                    {
                        "value": "莱西市",
                        "label": "莱西市",
                        "num": "370285"
                    },
                    {
                        "value": "开发区",
                        "label": "开发区",
                        "num": "370290"
                    }
                ]
            },
            {
                "value": "淄博市",
                "label": "淄博市",
                "num": "370300",
                "children": [{
                        "value": "淄川区",
                        "label": "淄川区",
                        "num": "370302"
                    },
                    {
                        "value": "张店区",
                        "label": "张店区",
                        "num": "370303"
                    },
                    {
                        "value": "博山区",
                        "label": "博山区",
                        "num": "370304"
                    },
                    {
                        "value": "临淄区",
                        "label": "临淄区",
                        "num": "370305"
                    },
                    {
                        "value": "周村区",
                        "label": "周村区",
                        "num": "370306"
                    },
                    {
                        "value": "桓台县",
                        "label": "桓台县",
                        "num": "370321"
                    },
                    {
                        "value": "高青县",
                        "label": "高青县",
                        "num": "370322"
                    },
                    {
                        "value": "沂源县",
                        "label": "沂源县",
                        "num": "370323"
                    }
                ]
            },
            {
                "value": "枣庄市",
                "label": "枣庄市",
                "num": "370400",
                "children": [{
                        "value": "市中区",
                        "label": "市中区",
                        "num": "370402"
                    },
                    {
                        "value": "薛城区",
                        "label": "薛城区",
                        "num": "370403"
                    },
                    {
                        "value": "峄城区",
                        "label": "峄城区",
                        "num": "370404"
                    },
                    {
                        "value": "台儿庄区",
                        "label": "台儿庄区",
                        "num": "370405"
                    },
                    {
                        "value": "山亭区",
                        "label": "山亭区",
                        "num": "370406"
                    },
                    {
                        "value": "滕州市",
                        "label": "滕州市",
                        "num": "370481"
                    }
                ]
            },
            {
                "value": "东营市",
                "label": "东营市",
                "num": "370500",
                "children": [{
                        "value": "东营区",
                        "label": "东营区",
                        "num": "370502"
                    },
                    {
                        "value": "河口区",
                        "label": "河口区",
                        "num": "370503"
                    },
                    {
                        "value": "垦利区",
                        "label": "垦利区",
                        "num": "370505"
                    },
                    {
                        "value": "利津县",
                        "label": "利津县",
                        "num": "370522"
                    },
                    {
                        "value": "广饶县",
                        "label": "广饶县",
                        "num": "370523"
                    }
                ]
            },
            {
                "value": "烟台市",
                "label": "烟台市",
                "num": "370600",
                "children": [{
                        "value": "芝罘区",
                        "label": "芝罘区",
                        "num": "370602"
                    },
                    {
                        "value": "福山区",
                        "label": "福山区",
                        "num": "370611"
                    },
                    {
                        "value": "牟平区",
                        "label": "牟平区",
                        "num": "370612"
                    },
                    {
                        "value": "莱山区",
                        "label": "莱山区",
                        "num": "370613"
                    },
                    {
                        "value": "长岛县",
                        "label": "长岛县",
                        "num": "370634"
                    },
                    {
                        "value": "龙口市",
                        "label": "龙口市",
                        "num": "370681"
                    },
                    {
                        "value": "莱阳市",
                        "label": "莱阳市",
                        "num": "370682"
                    },
                    {
                        "value": "莱州市",
                        "label": "莱州市",
                        "num": "370683"
                    },
                    {
                        "value": "蓬莱市",
                        "label": "蓬莱市",
                        "num": "370684"
                    },
                    {
                        "value": "招远市",
                        "label": "招远市",
                        "num": "370685"
                    },
                    {
                        "value": "栖霞市",
                        "label": "栖霞市",
                        "num": "370686"
                    },
                    {
                        "value": "海阳市",
                        "label": "海阳市",
                        "num": "370687"
                    },
                    {
                        "value": "开发区",
                        "label": "开发区",
                        "num": "370690"
                    }
                ]
            },
            {
                "value": "潍坊市",
                "label": "潍坊市",
                "num": "370700",
                "children": [{
                        "value": "潍城区",
                        "label": "潍城区",
                        "num": "370702"
                    },
                    {
                        "value": "寒亭区",
                        "label": "寒亭区",
                        "num": "370703"
                    },
                    {
                        "value": "坊子区",
                        "label": "坊子区",
                        "num": "370704"
                    },
                    {
                        "value": "奎文区",
                        "label": "奎文区",
                        "num": "370705"
                    },
                    {
                        "value": "临朐县",
                        "label": "临朐县",
                        "num": "370724"
                    },
                    {
                        "value": "昌乐县",
                        "label": "昌乐县",
                        "num": "370725"
                    },
                    {
                        "value": "青州市",
                        "label": "青州市",
                        "num": "370781"
                    },
                    {
                        "value": "诸城市",
                        "label": "诸城市",
                        "num": "370782"
                    },
                    {
                        "value": "寿光市",
                        "label": "寿光市",
                        "num": "370783"
                    },
                    {
                        "value": "安丘市",
                        "label": "安丘市",
                        "num": "370784"
                    },
                    {
                        "value": "高密市",
                        "label": "高密市",
                        "num": "370785"
                    },
                    {
                        "value": "昌邑市",
                        "label": "昌邑市",
                        "num": "370786"
                    },
                    {
                        "value": "开发区",
                        "label": "开发区",
                        "num": "370790"
                    },
                    {
                        "value": "高新区",
                        "label": "高新区",
                        "num": "370791"
                    }
                ]
            },
            {
                "value": "济宁市",
                "label": "济宁市",
                "num": "370800",
                "children": [{
                        "value": "任城区",
                        "label": "任城区",
                        "num": "370811"
                    },
                    {
                        "value": "兖州区",
                        "label": "兖州区",
                        "num": "370812"
                    },
                    {
                        "value": "微山县",
                        "label": "微山县",
                        "num": "370826"
                    },
                    {
                        "value": "鱼台县",
                        "label": "鱼台县",
                        "num": "370827"
                    },
                    {
                        "value": "金乡县",
                        "label": "金乡县",
                        "num": "370828"
                    },
                    {
                        "value": "嘉祥县",
                        "label": "嘉祥县",
                        "num": "370829"
                    },
                    {
                        "value": "汶上县",
                        "label": "汶上县",
                        "num": "370830"
                    },
                    {
                        "value": "泗水县",
                        "label": "泗水县",
                        "num": "370831"
                    },
                    {
                        "value": "梁山县",
                        "label": "梁山县",
                        "num": "370832"
                    },
                    {
                        "value": "曲阜市",
                        "label": "曲阜市",
                        "num": "370881"
                    },
                    {
                        "value": "邹城市",
                        "label": "邹城市",
                        "num": "370883"
                    },
                    {
                        "value": "高新区",
                        "label": "高新区",
                        "num": "370890"
                    }
                ]
            },
            {
                "value": "泰安市",
                "label": "泰安市",
                "num": "370900",
                "children": [{
                        "value": "泰山区",
                        "label": "泰山区",
                        "num": "370902"
                    },
                    {
                        "value": "岱岳区",
                        "label": "岱岳区",
                        "num": "370911"
                    },
                    {
                        "value": "宁阳县",
                        "label": "宁阳县",
                        "num": "370921"
                    },
                    {
                        "value": "东平县",
                        "label": "东平县",
                        "num": "370923"
                    },
                    {
                        "value": "新泰市",
                        "label": "新泰市",
                        "num": "370982"
                    },
                    {
                        "value": "肥城市",
                        "label": "肥城市",
                        "num": "370983"
                    }
                ]
            },
            {
                "value": "威海市",
                "label": "威海市",
                "num": "371000",
                "children": [{
                        "value": "环翠区",
                        "label": "环翠区",
                        "num": "371002"
                    },
                    {
                        "value": "文登区",
                        "label": "文登区",
                        "num": "371003"
                    },
                    {
                        "value": "荣成市",
                        "label": "荣成市",
                        "num": "371082"
                    },
                    {
                        "value": "乳山市",
                        "label": "乳山市",
                        "num": "371083"
                    },
                    {
                        "value": "经济技术开发区",
                        "label": "经济技术开发区",
                        "num": "371091"
                    }
                ]
            },
            {
                "value": "日照市",
                "label": "日照市",
                "num": "371100",
                "children": [{
                        "value": "东港区",
                        "label": "东港区",
                        "num": "371102"
                    },
                    {
                        "value": "岚山区",
                        "label": "岚山区",
                        "num": "371103"
                    },
                    {
                        "value": "五莲县",
                        "label": "五莲县",
                        "num": "371121"
                    },
                    {
                        "value": "莒县",
                        "label": "莒县",
                        "num": "371122"
                    }
                ]
            },
            {
                "value": "临沂市",
                "label": "临沂市",
                "num": "371300",
                "children": [{
                        "value": "兰山区",
                        "label": "兰山区",
                        "num": "371302"
                    },
                    {
                        "value": "罗庄区",
                        "label": "罗庄区",
                        "num": "371311"
                    },
                    {
                        "value": "河东区",
                        "label": "河东区",
                        "num": "371312"
                    },
                    {
                        "value": "沂南县",
                        "label": "沂南县",
                        "num": "371321"
                    },
                    {
                        "value": "郯城县",
                        "label": "郯城县",
                        "num": "371322"
                    },
                    {
                        "value": "沂水县",
                        "label": "沂水县",
                        "num": "371323"
                    },
                    {
                        "value": "兰陵县",
                        "label": "兰陵县",
                        "num": "371324"
                    },
                    {
                        "value": "费县",
                        "label": "费县",
                        "num": "371325"
                    },
                    {
                        "value": "平邑县",
                        "label": "平邑县",
                        "num": "371326"
                    },
                    {
                        "value": "莒南县",
                        "label": "莒南县",
                        "num": "371327"
                    },
                    {
                        "value": "蒙阴县",
                        "label": "蒙阴县",
                        "num": "371328"
                    },
                    {
                        "value": "临沭县",
                        "label": "临沭县",
                        "num": "371329"
                    }
                ]
            },
            {
                "value": "德州市",
                "label": "德州市",
                "num": "371400",
                "children": [{
                        "value": "德城区",
                        "label": "德城区",
                        "num": "371402"
                    },
                    {
                        "value": "陵城区",
                        "label": "陵城区",
                        "num": "371403"
                    },
                    {
                        "value": "宁津县",
                        "label": "宁津县",
                        "num": "371422"
                    },
                    {
                        "value": "庆云县",
                        "label": "庆云县",
                        "num": "371423"
                    },
                    {
                        "value": "临邑县",
                        "label": "临邑县",
                        "num": "371424"
                    },
                    {
                        "value": "齐河县",
                        "label": "齐河县",
                        "num": "371425"
                    },
                    {
                        "value": "平原县",
                        "label": "平原县",
                        "num": "371426"
                    },
                    {
                        "value": "夏津县",
                        "label": "夏津县",
                        "num": "371427"
                    },
                    {
                        "value": "武城县",
                        "label": "武城县",
                        "num": "371428"
                    },
                    {
                        "value": "乐陵市",
                        "label": "乐陵市",
                        "num": "371481"
                    },
                    {
                        "value": "禹城市",
                        "label": "禹城市",
                        "num": "371482"
                    }
                ]
            },
            {
                "value": "聊城市",
                "label": "聊城市",
                "num": "371500",
                "children": [{
                        "value": "东昌府区",
                        "label": "东昌府区",
                        "num": "371502"
                    },
                    {
                        "value": "阳谷县",
                        "label": "阳谷县",
                        "num": "371521"
                    },
                    {
                        "value": "莘县",
                        "label": "莘县",
                        "num": "371522"
                    },
                    {
                        "value": "茌平县",
                        "label": "茌平县",
                        "num": "371523"
                    },
                    {
                        "value": "东阿县",
                        "label": "东阿县",
                        "num": "371524"
                    },
                    {
                        "value": "冠县",
                        "label": "冠县",
                        "num": "371525"
                    },
                    {
                        "value": "高唐县",
                        "label": "高唐县",
                        "num": "371526"
                    },
                    {
                        "value": "临清市",
                        "label": "临清市",
                        "num": "371581"
                    }
                ]
            },
            {
                "value": "滨州市",
                "label": "滨州市",
                "num": "371600",
                "children": [{
                        "value": "滨城区",
                        "label": "滨城区",
                        "num": "371602"
                    },
                    {
                        "value": "沾化区",
                        "label": "沾化区",
                        "num": "371603"
                    },
                    {
                        "value": "惠民县",
                        "label": "惠民县",
                        "num": "371621"
                    },
                    {
                        "value": "阳信县",
                        "label": "阳信县",
                        "num": "371622"
                    },
                    {
                        "value": "无棣县",
                        "label": "无棣县",
                        "num": "371623"
                    },
                    {
                        "value": "博兴县",
                        "label": "博兴县",
                        "num": "371625"
                    },
                    {
                        "value": "邹平市",
                        "label": "邹平市",
                        "num": "371681"
                    }
                ]
            },
            {
                "value": "菏泽市",
                "label": "菏泽市",
                "num": "371700",
                "children": [{
                        "value": "牡丹区",
                        "label": "牡丹区",
                        "num": "371702"
                    },
                    {
                        "value": "定陶区",
                        "label": "定陶区",
                        "num": "371703"
                    },
                    {
                        "value": "曹县",
                        "label": "曹县",
                        "num": "371721"
                    },
                    {
                        "value": "单县",
                        "label": "单县",
                        "num": "371722"
                    },
                    {
                        "value": "成武县",
                        "label": "成武县",
                        "num": "371723"
                    },
                    {
                        "value": "巨野县",
                        "label": "巨野县",
                        "num": "371724"
                    },
                    {
                        "value": "郓城县",
                        "label": "郓城县",
                        "num": "371725"
                    },
                    {
                        "value": "鄄城县",
                        "label": "鄄城县",
                        "num": "371726"
                    },
                    {
                        "value": "东明县",
                        "label": "东明县",
                        "num": "371728"
                    }
                ]
            }
        ]
    },
    {
        "value": "河南省",
        "label": "河南省",
        "num": "410000",
        "children": [{
                "value": "郑州市",
                "label": "郑州市",
                "num": "410100",
                "children": [{
                        "value": "中原区",
                        "label": "中原区",
                        "num": "410102"
                    },
                    {
                        "value": "二七区",
                        "label": "二七区",
                        "num": "410103"
                    },
                    {
                        "value": "管城回族区",
                        "label": "管城回族区",
                        "num": "410104"
                    },
                    {
                        "value": "金水区",
                        "label": "金水区",
                        "num": "410105"
                    },
                    {
                        "value": "上街区",
                        "label": "上街区",
                        "num": "410106"
                    },
                    {
                        "value": "惠济区",
                        "label": "惠济区",
                        "num": "410108"
                    },
                    {
                        "value": "中牟县",
                        "label": "中牟县",
                        "num": "410122"
                    },
                    {
                        "value": "巩义市",
                        "label": "巩义市",
                        "num": "410181"
                    },
                    {
                        "value": "荥阳市",
                        "label": "荥阳市",
                        "num": "410182"
                    },
                    {
                        "value": "新密市",
                        "label": "新密市",
                        "num": "410183"
                    },
                    {
                        "value": "新郑市",
                        "label": "新郑市",
                        "num": "410184"
                    },
                    {
                        "value": "登封市",
                        "label": "登封市",
                        "num": "410185"
                    },
                    {
                        "value": "高新技术开发区",
                        "label": "高新技术开发区",
                        "num": "410190"
                    },
                    {
                        "value": "经济技术开发区",
                        "label": "经济技术开发区",
                        "num": "410191"
                    }
                ]
            },
            {
                "value": "开封市",
                "label": "开封市",
                "num": "410200",
                "children": [{
                        "value": "龙亭区",
                        "label": "龙亭区",
                        "num": "410202"
                    },
                    {
                        "value": "顺河回族区",
                        "label": "顺河回族区",
                        "num": "410203"
                    },
                    {
                        "value": "鼓楼区",
                        "label": "鼓楼区",
                        "num": "410204"
                    },
                    {
                        "value": "禹王台区",
                        "label": "禹王台区",
                        "num": "410205"
                    },
                    {
                        "value": "祥符区",
                        "label": "祥符区",
                        "num": "410212"
                    },
                    {
                        "value": "杞县",
                        "label": "杞县",
                        "num": "410221"
                    },
                    {
                        "value": "通许县",
                        "label": "通许县",
                        "num": "410222"
                    },
                    {
                        "value": "尉氏县",
                        "label": "尉氏县",
                        "num": "410223"
                    },
                    {
                        "value": "兰考县",
                        "label": "兰考县",
                        "num": "410225"
                    }
                ]
            },
            {
                "value": "洛阳市",
                "label": "洛阳市",
                "num": "410300",
                "children": [{
                        "value": "老城区",
                        "label": "老城区",
                        "num": "410302"
                    },
                    {
                        "value": "西工区",
                        "label": "西工区",
                        "num": "410303"
                    },
                    {
                        "value": "瀍河回族区",
                        "label": "瀍河回族区",
                        "num": "410304"
                    },
                    {
                        "value": "涧西区",
                        "label": "涧西区",
                        "num": "410305"
                    },
                    {
                        "value": "吉利区",
                        "label": "吉利区",
                        "num": "410306"
                    },
                    {
                        "value": "洛龙区",
                        "label": "洛龙区",
                        "num": "410311"
                    },
                    {
                        "value": "孟津县",
                        "label": "孟津县",
                        "num": "410322"
                    },
                    {
                        "value": "新安县",
                        "label": "新安县",
                        "num": "410323"
                    },
                    {
                        "value": "栾川县",
                        "label": "栾川县",
                        "num": "410324"
                    },
                    {
                        "value": "嵩县",
                        "label": "嵩县",
                        "num": "410325"
                    },
                    {
                        "value": "汝阳县",
                        "label": "汝阳县",
                        "num": "410326"
                    },
                    {
                        "value": "宜阳县",
                        "label": "宜阳县",
                        "num": "410327"
                    },
                    {
                        "value": "洛宁县",
                        "label": "洛宁县",
                        "num": "410328"
                    },
                    {
                        "value": "伊川县",
                        "label": "伊川县",
                        "num": "410329"
                    },
                    {
                        "value": "偃师市",
                        "label": "偃师市",
                        "num": "410381"
                    }
                ]
            },
            {
                "value": "平顶山市",
                "label": "平顶山市",
                "num": "410400",
                "children": [{
                        "value": "新华区",
                        "label": "新华区",
                        "num": "410402"
                    },
                    {
                        "value": "卫东区",
                        "label": "卫东区",
                        "num": "410403"
                    },
                    {
                        "value": "石龙区",
                        "label": "石龙区",
                        "num": "410404"
                    },
                    {
                        "value": "湛河区",
                        "label": "湛河区",
                        "num": "410411"
                    },
                    {
                        "value": "宝丰县",
                        "label": "宝丰县",
                        "num": "410421"
                    },
                    {
                        "value": "叶县",
                        "label": "叶县",
                        "num": "410422"
                    },
                    {
                        "value": "鲁山县",
                        "label": "鲁山县",
                        "num": "410423"
                    },
                    {
                        "value": "郏县",
                        "label": "郏县",
                        "num": "410425"
                    },
                    {
                        "value": "舞钢市",
                        "label": "舞钢市",
                        "num": "410481"
                    },
                    {
                        "value": "汝州市",
                        "label": "汝州市",
                        "num": "410482"
                    }
                ]
            },
            {
                "value": "安阳市",
                "label": "安阳市",
                "num": "410500",
                "children": [{
                        "value": "文峰区",
                        "label": "文峰区",
                        "num": "410502"
                    },
                    {
                        "value": "北关区",
                        "label": "北关区",
                        "num": "410503"
                    },
                    {
                        "value": "殷都区",
                        "label": "殷都区",
                        "num": "410505"
                    },
                    {
                        "value": "龙安区",
                        "label": "龙安区",
                        "num": "410506"
                    },
                    {
                        "value": "安阳县",
                        "label": "安阳县",
                        "num": "410522"
                    },
                    {
                        "value": "汤阴县",
                        "label": "汤阴县",
                        "num": "410523"
                    },
                    {
                        "value": "滑县",
                        "label": "滑县",
                        "num": "410526"
                    },
                    {
                        "value": "内黄县",
                        "label": "内黄县",
                        "num": "410527"
                    },
                    {
                        "value": "林州市",
                        "label": "林州市",
                        "num": "410581"
                    },
                    {
                        "value": "开发区",
                        "label": "开发区",
                        "num": "410590"
                    }
                ]
            },
            {
                "value": "鹤壁市",
                "label": "鹤壁市",
                "num": "410600",
                "children": [{
                        "value": "鹤山区",
                        "label": "鹤山区",
                        "num": "410602"
                    },
                    {
                        "value": "山城区",
                        "label": "山城区",
                        "num": "410603"
                    },
                    {
                        "value": "淇滨区",
                        "label": "淇滨区",
                        "num": "410611"
                    },
                    {
                        "value": "浚县",
                        "label": "浚县",
                        "num": "410621"
                    },
                    {
                        "value": "淇县",
                        "label": "淇县",
                        "num": "410622"
                    }
                ]
            },
            {
                "value": "新乡市",
                "label": "新乡市",
                "num": "410700",
                "children": [{
                        "value": "红旗区",
                        "label": "红旗区",
                        "num": "410702"
                    },
                    {
                        "value": "卫滨区",
                        "label": "卫滨区",
                        "num": "410703"
                    },
                    {
                        "value": "凤泉区",
                        "label": "凤泉区",
                        "num": "410704"
                    },
                    {
                        "value": "牧野区",
                        "label": "牧野区",
                        "num": "410711"
                    },
                    {
                        "value": "新乡县",
                        "label": "新乡县",
                        "num": "410721"
                    },
                    {
                        "value": "获嘉县",
                        "label": "获嘉县",
                        "num": "410724"
                    },
                    {
                        "value": "原阳县",
                        "label": "原阳县",
                        "num": "410725"
                    },
                    {
                        "value": "延津县",
                        "label": "延津县",
                        "num": "410726"
                    },
                    {
                        "value": "封丘县",
                        "label": "封丘县",
                        "num": "410727"
                    },
                    {
                        "value": "长垣县",
                        "label": "长垣县",
                        "num": "410728"
                    },
                    {
                        "value": "卫辉市",
                        "label": "卫辉市",
                        "num": "410781"
                    },
                    {
                        "value": "辉县市",
                        "label": "辉县市",
                        "num": "410782"
                    }
                ]
            },
            {
                "value": "焦作市",
                "label": "焦作市",
                "num": "410800",
                "children": [{
                        "value": "解放区",
                        "label": "解放区",
                        "num": "410802"
                    },
                    {
                        "value": "中站区",
                        "label": "中站区",
                        "num": "410803"
                    },
                    {
                        "value": "马村区",
                        "label": "马村区",
                        "num": "410804"
                    },
                    {
                        "value": "山阳区",
                        "label": "山阳区",
                        "num": "410811"
                    },
                    {
                        "value": "修武县",
                        "label": "修武县",
                        "num": "410821"
                    },
                    {
                        "value": "博爱县",
                        "label": "博爱县",
                        "num": "410822"
                    },
                    {
                        "value": "武陟县",
                        "label": "武陟县",
                        "num": "410823"
                    },
                    {
                        "value": "温县",
                        "label": "温县",
                        "num": "410825"
                    },
                    {
                        "value": "沁阳市",
                        "label": "沁阳市",
                        "num": "410882"
                    },
                    {
                        "value": "孟州市",
                        "label": "孟州市",
                        "num": "410883"
                    }
                ]
            },
            {
                "value": "濮阳市",
                "label": "濮阳市",
                "num": "410900",
                "children": [{
                        "value": "华龙区",
                        "label": "华龙区",
                        "num": "410902"
                    },
                    {
                        "value": "清丰县",
                        "label": "清丰县",
                        "num": "410922"
                    },
                    {
                        "value": "南乐县",
                        "label": "南乐县",
                        "num": "410923"
                    },
                    {
                        "value": "范县",
                        "label": "范县",
                        "num": "410926"
                    },
                    {
                        "value": "台前县",
                        "label": "台前县",
                        "num": "410927"
                    },
                    {
                        "value": "濮阳县",
                        "label": "濮阳县",
                        "num": "410928"
                    }
                ]
            },
            {
                "value": "许昌市",
                "label": "许昌市",
                "num": "411000",
                "children": [{
                        "value": "魏都区",
                        "label": "魏都区",
                        "num": "411002"
                    },
                    {
                        "value": "建安区",
                        "label": "建安区",
                        "num": "411003"
                    },
                    {
                        "value": "鄢陵县",
                        "label": "鄢陵县",
                        "num": "411024"
                    },
                    {
                        "value": "襄城县",
                        "label": "襄城县",
                        "num": "411025"
                    },
                    {
                        "value": "禹州市",
                        "label": "禹州市",
                        "num": "411081"
                    },
                    {
                        "value": "长葛市",
                        "label": "长葛市",
                        "num": "411082"
                    }
                ]
            },
            {
                "value": "漯河市",
                "label": "漯河市",
                "num": "411100",
                "children": [{
                        "value": "源汇区",
                        "label": "源汇区",
                        "num": "411102"
                    },
                    {
                        "value": "郾城区",
                        "label": "郾城区",
                        "num": "411103"
                    },
                    {
                        "value": "召陵区",
                        "label": "召陵区",
                        "num": "411104"
                    },
                    {
                        "value": "舞阳县",
                        "label": "舞阳县",
                        "num": "411121"
                    },
                    {
                        "value": "临颍县",
                        "label": "临颍县",
                        "num": "411122"
                    }
                ]
            },
            {
                "value": "三门峡市",
                "label": "三门峡市",
                "num": "411200",
                "children": [{
                        "value": "湖滨区",
                        "label": "湖滨区",
                        "num": "411202"
                    },
                    {
                        "value": "陕州区",
                        "label": "陕州区",
                        "num": "411203"
                    },
                    {
                        "value": "渑池县",
                        "label": "渑池县",
                        "num": "411221"
                    },
                    {
                        "value": "卢氏县",
                        "label": "卢氏县",
                        "num": "411224"
                    },
                    {
                        "value": "义马市",
                        "label": "义马市",
                        "num": "411281"
                    },
                    {
                        "value": "灵宝市",
                        "label": "灵宝市",
                        "num": "411282"
                    }
                ]
            },
            {
                "value": "南阳市",
                "label": "南阳市",
                "num": "411300",
                "children": [{
                        "value": "宛城区",
                        "label": "宛城区",
                        "num": "411302"
                    },
                    {
                        "value": "卧龙区",
                        "label": "卧龙区",
                        "num": "411303"
                    },
                    {
                        "value": "南召县",
                        "label": "南召县",
                        "num": "411321"
                    },
                    {
                        "value": "方城县",
                        "label": "方城县",
                        "num": "411322"
                    },
                    {
                        "value": "西峡县",
                        "label": "西峡县",
                        "num": "411323"
                    },
                    {
                        "value": "镇平县",
                        "label": "镇平县",
                        "num": "411324"
                    },
                    {
                        "value": "内乡县",
                        "label": "内乡县",
                        "num": "411325"
                    },
                    {
                        "value": "淅川县",
                        "label": "淅川县",
                        "num": "411326"
                    },
                    {
                        "value": "社旗县",
                        "label": "社旗县",
                        "num": "411327"
                    },
                    {
                        "value": "唐河县",
                        "label": "唐河县",
                        "num": "411328"
                    },
                    {
                        "value": "新野县",
                        "label": "新野县",
                        "num": "411329"
                    },
                    {
                        "value": "桐柏县",
                        "label": "桐柏县",
                        "num": "411330"
                    },
                    {
                        "value": "邓州市",
                        "label": "邓州市",
                        "num": "411381"
                    }
                ]
            },
            {
                "value": "商丘市",
                "label": "商丘市",
                "num": "411400",
                "children": [{
                        "value": "梁园区",
                        "label": "梁园区",
                        "num": "411402"
                    },
                    {
                        "value": "睢阳区",
                        "label": "睢阳区",
                        "num": "411403"
                    },
                    {
                        "value": "民权县",
                        "label": "民权县",
                        "num": "411421"
                    },
                    {
                        "value": "睢县",
                        "label": "睢县",
                        "num": "411422"
                    },
                    {
                        "value": "宁陵县",
                        "label": "宁陵县",
                        "num": "411423"
                    },
                    {
                        "value": "柘城县",
                        "label": "柘城县",
                        "num": "411424"
                    },
                    {
                        "value": "虞城县",
                        "label": "虞城县",
                        "num": "411425"
                    },
                    {
                        "value": "夏邑县",
                        "label": "夏邑县",
                        "num": "411426"
                    },
                    {
                        "value": "永城市",
                        "label": "永城市",
                        "num": "411481"
                    }
                ]
            },
            {
                "value": "信阳市",
                "label": "信阳市",
                "num": "411500",
                "children": [{
                        "value": "浉河区",
                        "label": "浉河区",
                        "num": "411502"
                    },
                    {
                        "value": "平桥区",
                        "label": "平桥区",
                        "num": "411503"
                    },
                    {
                        "value": "罗山县",
                        "label": "罗山县",
                        "num": "411521"
                    },
                    {
                        "value": "光山县",
                        "label": "光山县",
                        "num": "411522"
                    },
                    {
                        "value": "新县",
                        "label": "新县",
                        "num": "411523"
                    },
                    {
                        "value": "商城县",
                        "label": "商城县",
                        "num": "411524"
                    },
                    {
                        "value": "固始县",
                        "label": "固始县",
                        "num": "411525"
                    },
                    {
                        "value": "潢川县",
                        "label": "潢川县",
                        "num": "411526"
                    },
                    {
                        "value": "淮滨县",
                        "label": "淮滨县",
                        "num": "411527"
                    },
                    {
                        "value": "息县",
                        "label": "息县",
                        "num": "411528"
                    }
                ]
            },
            {
                "value": "周口市",
                "label": "周口市",
                "num": "411600",
                "children": [{
                        "value": "川汇区",
                        "label": "川汇区",
                        "num": "411602"
                    },
                    {
                        "value": "扶沟县",
                        "label": "扶沟县",
                        "num": "411621"
                    },
                    {
                        "value": "西华县",
                        "label": "西华县",
                        "num": "411622"
                    },
                    {
                        "value": "商水县",
                        "label": "商水县",
                        "num": "411623"
                    },
                    {
                        "value": "沈丘县",
                        "label": "沈丘县",
                        "num": "411624"
                    },
                    {
                        "value": "郸城县",
                        "label": "郸城县",
                        "num": "411625"
                    },
                    {
                        "value": "淮阳县",
                        "label": "淮阳县",
                        "num": "411626"
                    },
                    {
                        "value": "太康县",
                        "label": "太康县",
                        "num": "411627"
                    },
                    {
                        "value": "鹿邑县",
                        "label": "鹿邑县",
                        "num": "411628"
                    },
                    {
                        "value": "项城市",
                        "label": "项城市",
                        "num": "411681"
                    },
                    {
                        "value": "经济开发区",
                        "label": "经济开发区",
                        "num": "411690"
                    }
                ]
            },
            {
                "value": "驻马店市",
                "label": "驻马店市",
                "num": "411700",
                "children": [{
                        "value": "驿城区",
                        "label": "驿城区",
                        "num": "411702"
                    },
                    {
                        "value": "西平县",
                        "label": "西平县",
                        "num": "411721"
                    },
                    {
                        "value": "上蔡县",
                        "label": "上蔡县",
                        "num": "411722"
                    },
                    {
                        "value": "平舆县",
                        "label": "平舆县",
                        "num": "411723"
                    },
                    {
                        "value": "正阳县",
                        "label": "正阳县",
                        "num": "411724"
                    },
                    {
                        "value": "确山县",
                        "label": "确山县",
                        "num": "411725"
                    },
                    {
                        "value": "泌阳县",
                        "label": "泌阳县",
                        "num": "411726"
                    },
                    {
                        "value": "汝南县",
                        "label": "汝南县",
                        "num": "411727"
                    },
                    {
                        "value": "遂平县",
                        "label": "遂平县",
                        "num": "411728"
                    },
                    {
                        "value": "新蔡县",
                        "label": "新蔡县",
                        "num": "411729"
                    }
                ]
            },
            {
                "value": "省直辖县",
                "label": "省直辖县",
                "num": "419000",
                "children": [{
                    "value": "济源市",
                    "label": "济源市",
                    "num": "419001"
                }]
            }
        ]
    },
    {
        "value": "湖北省",
        "label": "湖北省",
        "num": "420000",
        "children": [{
                "value": "武汉市",
                "label": "武汉市",
                "num": "420100",
                "children": [{
                        "value": "江岸区",
                        "label": "江岸区",
                        "num": "420102"
                    },
                    {
                        "value": "江汉区",
                        "label": "江汉区",
                        "num": "420103"
                    },
                    {
                        "value": "硚口区",
                        "label": "硚口区",
                        "num": "420104"
                    },
                    {
                        "value": "汉阳区",
                        "label": "汉阳区",
                        "num": "420105"
                    },
                    {
                        "value": "武昌区",
                        "label": "武昌区",
                        "num": "420106"
                    },
                    {
                        "value": "青山区",
                        "label": "青山区",
                        "num": "420107"
                    },
                    {
                        "value": "洪山区",
                        "label": "洪山区",
                        "num": "420111"
                    },
                    {
                        "value": "东西湖区",
                        "label": "东西湖区",
                        "num": "420112"
                    },
                    {
                        "value": "汉南区",
                        "label": "汉南区",
                        "num": "420113"
                    },
                    {
                        "value": "蔡甸区",
                        "label": "蔡甸区",
                        "num": "420114"
                    },
                    {
                        "value": "江夏区",
                        "label": "江夏区",
                        "num": "420115"
                    },
                    {
                        "value": "黄陂区",
                        "label": "黄陂区",
                        "num": "420116"
                    },
                    {
                        "value": "新洲区",
                        "label": "新洲区",
                        "num": "420117"
                    }
                ]
            },
            {
                "value": "黄石市",
                "label": "黄石市",
                "num": "420200",
                "children": [{
                        "value": "黄石港区",
                        "label": "黄石港区",
                        "num": "420202"
                    },
                    {
                        "value": "西塞山区",
                        "label": "西塞山区",
                        "num": "420203"
                    },
                    {
                        "value": "下陆区",
                        "label": "下陆区",
                        "num": "420204"
                    },
                    {
                        "value": "铁山区",
                        "label": "铁山区",
                        "num": "420205"
                    },
                    {
                        "value": "阳新县",
                        "label": "阳新县",
                        "num": "420222"
                    },
                    {
                        "value": "大冶市",
                        "label": "大冶市",
                        "num": "420281"
                    }
                ]
            },
            {
                "value": "十堰市",
                "label": "十堰市",
                "num": "420300",
                "children": [{
                        "value": "茅箭区",
                        "label": "茅箭区",
                        "num": "420302"
                    },
                    {
                        "value": "张湾区",
                        "label": "张湾区",
                        "num": "420303"
                    },
                    {
                        "value": "郧阳区",
                        "label": "郧阳区",
                        "num": "420304"
                    },
                    {
                        "value": "郧西县",
                        "label": "郧西县",
                        "num": "420322"
                    },
                    {
                        "value": "竹山县",
                        "label": "竹山县",
                        "num": "420323"
                    },
                    {
                        "value": "竹溪县",
                        "label": "竹溪县",
                        "num": "420324"
                    },
                    {
                        "value": "房县",
                        "label": "房县",
                        "num": "420325"
                    },
                    {
                        "value": "丹江口市",
                        "label": "丹江口市",
                        "num": "420381"
                    }
                ]
            },
            {
                "value": "宜昌市",
                "label": "宜昌市",
                "num": "420500",
                "children": [{
                        "value": "西陵区",
                        "label": "西陵区",
                        "num": "420502"
                    },
                    {
                        "value": "伍家岗区",
                        "label": "伍家岗区",
                        "num": "420503"
                    },
                    {
                        "value": "点军区",
                        "label": "点军区",
                        "num": "420504"
                    },
                    {
                        "value": "猇亭区",
                        "label": "猇亭区",
                        "num": "420505"
                    },
                    {
                        "value": "夷陵区",
                        "label": "夷陵区",
                        "num": "420506"
                    },
                    {
                        "value": "远安县",
                        "label": "远安县",
                        "num": "420525"
                    },
                    {
                        "value": "兴山县",
                        "label": "兴山县",
                        "num": "420526"
                    },
                    {
                        "value": "秭归县",
                        "label": "秭归县",
                        "num": "420527"
                    },
                    {
                        "value": "长阳土家族自治县",
                        "label": "长阳土家族自治县",
                        "num": "420528"
                    },
                    {
                        "value": "五峰土家族自治县",
                        "label": "五峰土家族自治县",
                        "num": "420529"
                    },
                    {
                        "value": "宜都市",
                        "label": "宜都市",
                        "num": "420581"
                    },
                    {
                        "value": "当阳市",
                        "label": "当阳市",
                        "num": "420582"
                    },
                    {
                        "value": "枝江市",
                        "label": "枝江市",
                        "num": "420583"
                    },
                    {
                        "value": "经济开发区",
                        "label": "经济开发区",
                        "num": "420590"
                    }
                ]
            },
            {
                "value": "襄阳市",
                "label": "襄阳市",
                "num": "420600",
                "children": [{
                        "value": "襄城区",
                        "label": "襄城区",
                        "num": "420602"
                    },
                    {
                        "value": "樊城区",
                        "label": "樊城区",
                        "num": "420606"
                    },
                    {
                        "value": "襄州区",
                        "label": "襄州区",
                        "num": "420607"
                    },
                    {
                        "value": "南漳县",
                        "label": "南漳县",
                        "num": "420624"
                    },
                    {
                        "value": "谷城县",
                        "label": "谷城县",
                        "num": "420625"
                    },
                    {
                        "value": "保康县",
                        "label": "保康县",
                        "num": "420626"
                    },
                    {
                        "value": "老河口市",
                        "label": "老河口市",
                        "num": "420682"
                    },
                    {
                        "value": "枣阳市",
                        "label": "枣阳市",
                        "num": "420683"
                    },
                    {
                        "value": "宜城市",
                        "label": "宜城市",
                        "num": "420684"
                    }
                ]
            },
            {
                "value": "鄂州市",
                "label": "鄂州市",
                "num": "420700",
                "children": [{
                        "value": "梁子湖区",
                        "label": "梁子湖区",
                        "num": "420702"
                    },
                    {
                        "value": "华容区",
                        "label": "华容区",
                        "num": "420703"
                    },
                    {
                        "value": "鄂城区",
                        "label": "鄂城区",
                        "num": "420704"
                    }
                ]
            },
            {
                "value": "荆门市",
                "label": "荆门市",
                "num": "420800",
                "children": [{
                        "value": "东宝区",
                        "label": "东宝区",
                        "num": "420802"
                    },
                    {
                        "value": "掇刀区",
                        "label": "掇刀区",
                        "num": "420804"
                    },
                    {
                        "value": "沙洋县",
                        "label": "沙洋县",
                        "num": "420822"
                    },
                    {
                        "value": "钟祥市",
                        "label": "钟祥市",
                        "num": "420881"
                    },
                    {
                        "value": "京山市",
                        "label": "京山市",
                        "num": "420882"
                    }
                ]
            },
            {
                "value": "孝感市",
                "label": "孝感市",
                "num": "420900",
                "children": [{
                        "value": "孝南区",
                        "label": "孝南区",
                        "num": "420902"
                    },
                    {
                        "value": "孝昌县",
                        "label": "孝昌县",
                        "num": "420921"
                    },
                    {
                        "value": "大悟县",
                        "label": "大悟县",
                        "num": "420922"
                    },
                    {
                        "value": "云梦县",
                        "label": "云梦县",
                        "num": "420923"
                    },
                    {
                        "value": "应城市",
                        "label": "应城市",
                        "num": "420981"
                    },
                    {
                        "value": "安陆市",
                        "label": "安陆市",
                        "num": "420982"
                    },
                    {
                        "value": "汉川市",
                        "label": "汉川市",
                        "num": "420984"
                    }
                ]
            },
            {
                "value": "荆州市",
                "label": "荆州市",
                "num": "421000",
                "children": [{
                        "value": "沙市区",
                        "label": "沙市区",
                        "num": "421002"
                    },
                    {
                        "value": "荆州区",
                        "label": "荆州区",
                        "num": "421003"
                    },
                    {
                        "value": "公安县",
                        "label": "公安县",
                        "num": "421022"
                    },
                    {
                        "value": "监利县",
                        "label": "监利县",
                        "num": "421023"
                    },
                    {
                        "value": "江陵县",
                        "label": "江陵县",
                        "num": "421024"
                    },
                    {
                        "value": "石首市",
                        "label": "石首市",
                        "num": "421081"
                    },
                    {
                        "value": "洪湖市",
                        "label": "洪湖市",
                        "num": "421083"
                    },
                    {
                        "value": "松滋市",
                        "label": "松滋市",
                        "num": "421087"
                    }
                ]
            },
            {
                "value": "黄冈市",
                "label": "黄冈市",
                "num": "421100",
                "children": [{
                        "value": "黄州区",
                        "label": "黄州区",
                        "num": "421102"
                    },
                    {
                        "value": "团风县",
                        "label": "团风县",
                        "num": "421121"
                    },
                    {
                        "value": "红安县",
                        "label": "红安县",
                        "num": "421122"
                    },
                    {
                        "value": "罗田县",
                        "label": "罗田县",
                        "num": "421123"
                    },
                    {
                        "value": "英山县",
                        "label": "英山县",
                        "num": "421124"
                    },
                    {
                        "value": "浠水县",
                        "label": "浠水县",
                        "num": "421125"
                    },
                    {
                        "value": "蕲春县",
                        "label": "蕲春县",
                        "num": "421126"
                    },
                    {
                        "value": "黄梅县",
                        "label": "黄梅县",
                        "num": "421127"
                    },
                    {
                        "value": "麻城市",
                        "label": "麻城市",
                        "num": "421181"
                    },
                    {
                        "value": "武穴市",
                        "label": "武穴市",
                        "num": "421182"
                    }
                ]
            },
            {
                "value": "咸宁市",
                "label": "咸宁市",
                "num": "421200",
                "children": [{
                        "value": "咸安区",
                        "label": "咸安区",
                        "num": "421202"
                    },
                    {
                        "value": "嘉鱼县",
                        "label": "嘉鱼县",
                        "num": "421221"
                    },
                    {
                        "value": "通城县",
                        "label": "通城县",
                        "num": "421222"
                    },
                    {
                        "value": "崇阳县",
                        "label": "崇阳县",
                        "num": "421223"
                    },
                    {
                        "value": "通山县",
                        "label": "通山县",
                        "num": "421224"
                    },
                    {
                        "value": "赤壁市",
                        "label": "赤壁市",
                        "num": "421281"
                    }
                ]
            },
            {
                "value": "随州市",
                "label": "随州市",
                "num": "421300",
                "children": [{
                        "value": "曾都区",
                        "label": "曾都区",
                        "num": "421303"
                    },
                    {
                        "value": "随县",
                        "label": "随县",
                        "num": "421321"
                    },
                    {
                        "value": "广水市",
                        "label": "广水市",
                        "num": "421381"
                    }
                ]
            },
            {
                "value": "恩施土家族苗族自治州",
                "label": "恩施土家族苗族自治州",
                "num": "422800",
                "children": [{
                        "value": "恩施市",
                        "label": "恩施市",
                        "num": "422801"
                    },
                    {
                        "value": "利川市",
                        "label": "利川市",
                        "num": "422802"
                    },
                    {
                        "value": "建始县",
                        "label": "建始县",
                        "num": "422822"
                    },
                    {
                        "value": "巴东县",
                        "label": "巴东县",
                        "num": "422823"
                    },
                    {
                        "value": "宣恩县",
                        "label": "宣恩县",
                        "num": "422825"
                    },
                    {
                        "value": "咸丰县",
                        "label": "咸丰县",
                        "num": "422826"
                    },
                    {
                        "value": "来凤县",
                        "label": "来凤县",
                        "num": "422827"
                    },
                    {
                        "value": "鹤峰县",
                        "label": "鹤峰县",
                        "num": "422828"
                    }
                ]
            },
            {
                "value": "省直辖县",
                "label": "省直辖县",
                "num": "429000",
                "children": [{
                        "value": "仙桃市",
                        "label": "仙桃市",
                        "num": "429004"
                    },
                    {
                        "value": "潜江市",
                        "label": "潜江市",
                        "num": "429005"
                    },
                    {
                        "value": "天门市",
                        "label": "天门市",
                        "num": "429006"
                    },
                    {
                        "value": "神农架林区",
                        "label": "神农架林区",
                        "num": "429021"
                    }
                ]
            }
        ]
    },
    {
        "value": "湖南省",
        "label": "湖南省",
        "num": "430000",
        "children": [{
                "value": "长沙市",
                "label": "长沙市",
                "num": "430100",
                "children": [{
                        "value": "芙蓉区",
                        "label": "芙蓉区",
                        "num": "430102"
                    },
                    {
                        "value": "天心区",
                        "label": "天心区",
                        "num": "430103"
                    },
                    {
                        "value": "岳麓区",
                        "label": "岳麓区",
                        "num": "430104"
                    },
                    {
                        "value": "开福区",
                        "label": "开福区",
                        "num": "430105"
                    },
                    {
                        "value": "雨花区",
                        "label": "雨花区",
                        "num": "430111"
                    },
                    {
                        "value": "望城区",
                        "label": "望城区",
                        "num": "430112"
                    },
                    {
                        "value": "长沙县",
                        "label": "长沙县",
                        "num": "430121"
                    },
                    {
                        "value": "浏阳市",
                        "label": "浏阳市",
                        "num": "430181"
                    },
                    {
                        "value": "宁乡市",
                        "label": "宁乡市",
                        "num": "430182"
                    }
                ]
            },
            {
                "value": "株洲市",
                "label": "株洲市",
                "num": "430200",
                "children": [{
                        "value": "荷塘区",
                        "label": "荷塘区",
                        "num": "430202"
                    },
                    {
                        "value": "芦淞区",
                        "label": "芦淞区",
                        "num": "430203"
                    },
                    {
                        "value": "石峰区",
                        "label": "石峰区",
                        "num": "430204"
                    },
                    {
                        "value": "天元区",
                        "label": "天元区",
                        "num": "430211"
                    },
                    {
                        "value": "渌口区",
                        "label": "渌口区",
                        "num": "430212"
                    },
                    {
                        "value": "攸县",
                        "label": "攸县",
                        "num": "430223"
                    },
                    {
                        "value": "茶陵县",
                        "label": "茶陵县",
                        "num": "430224"
                    },
                    {
                        "value": "炎陵县",
                        "label": "炎陵县",
                        "num": "430225"
                    },
                    {
                        "value": "醴陵市",
                        "label": "醴陵市",
                        "num": "430281"
                    }
                ]
            },
            {
                "value": "湘潭市",
                "label": "湘潭市",
                "num": "430300",
                "children": [{
                        "value": "雨湖区",
                        "label": "雨湖区",
                        "num": "430302"
                    },
                    {
                        "value": "岳塘区",
                        "label": "岳塘区",
                        "num": "430304"
                    },
                    {
                        "value": "湘潭县",
                        "label": "湘潭县",
                        "num": "430321"
                    },
                    {
                        "value": "湘乡市",
                        "label": "湘乡市",
                        "num": "430381"
                    },
                    {
                        "value": "韶山市",
                        "label": "韶山市",
                        "num": "430382"
                    }
                ]
            },
            {
                "value": "衡阳市",
                "label": "衡阳市",
                "num": "430400",
                "children": [{
                        "value": "珠晖区",
                        "label": "珠晖区",
                        "num": "430405"
                    },
                    {
                        "value": "雁峰区",
                        "label": "雁峰区",
                        "num": "430406"
                    },
                    {
                        "value": "石鼓区",
                        "label": "石鼓区",
                        "num": "430407"
                    },
                    {
                        "value": "蒸湘区",
                        "label": "蒸湘区",
                        "num": "430408"
                    },
                    {
                        "value": "南岳区",
                        "label": "南岳区",
                        "num": "430412"
                    },
                    {
                        "value": "衡阳县",
                        "label": "衡阳县",
                        "num": "430421"
                    },
                    {
                        "value": "衡南县",
                        "label": "衡南县",
                        "num": "430422"
                    },
                    {
                        "value": "衡山县",
                        "label": "衡山县",
                        "num": "430423"
                    },
                    {
                        "value": "衡东县",
                        "label": "衡东县",
                        "num": "430424"
                    },
                    {
                        "value": "祁东县",
                        "label": "祁东县",
                        "num": "430426"
                    },
                    {
                        "value": "耒阳市",
                        "label": "耒阳市",
                        "num": "430481"
                    },
                    {
                        "value": "常宁市",
                        "label": "常宁市",
                        "num": "430482"
                    }
                ]
            },
            {
                "value": "邵阳市",
                "label": "邵阳市",
                "num": "430500",
                "children": [{
                        "value": "双清区",
                        "label": "双清区",
                        "num": "430502"
                    },
                    {
                        "value": "大祥区",
                        "label": "大祥区",
                        "num": "430503"
                    },
                    {
                        "value": "北塔区",
                        "label": "北塔区",
                        "num": "430511"
                    },
                    {
                        "value": "邵东县",
                        "label": "邵东县",
                        "num": "430521"
                    },
                    {
                        "value": "新邵县",
                        "label": "新邵县",
                        "num": "430522"
                    },
                    {
                        "value": "邵阳县",
                        "label": "邵阳县",
                        "num": "430523"
                    },
                    {
                        "value": "隆回县",
                        "label": "隆回县",
                        "num": "430524"
                    },
                    {
                        "value": "洞口县",
                        "label": "洞口县",
                        "num": "430525"
                    },
                    {
                        "value": "绥宁县",
                        "label": "绥宁县",
                        "num": "430527"
                    },
                    {
                        "value": "新宁县",
                        "label": "新宁县",
                        "num": "430528"
                    },
                    {
                        "value": "城步苗族自治县",
                        "label": "城步苗族自治县",
                        "num": "430529"
                    },
                    {
                        "value": "武冈市",
                        "label": "武冈市",
                        "num": "430581"
                    }
                ]
            },
            {
                "value": "岳阳市",
                "label": "岳阳市",
                "num": "430600",
                "children": [{
                        "value": "岳阳楼区",
                        "label": "岳阳楼区",
                        "num": "430602"
                    },
                    {
                        "value": "云溪区",
                        "label": "云溪区",
                        "num": "430603"
                    },
                    {
                        "value": "君山区",
                        "label": "君山区",
                        "num": "430611"
                    },
                    {
                        "value": "岳阳县",
                        "label": "岳阳县",
                        "num": "430621"
                    },
                    {
                        "value": "华容县",
                        "label": "华容县",
                        "num": "430623"
                    },
                    {
                        "value": "湘阴县",
                        "label": "湘阴县",
                        "num": "430624"
                    },
                    {
                        "value": "平江县",
                        "label": "平江县",
                        "num": "430626"
                    },
                    {
                        "value": "汨罗市",
                        "label": "汨罗市",
                        "num": "430681"
                    },
                    {
                        "value": "临湘市",
                        "label": "临湘市",
                        "num": "430682"
                    }
                ]
            },
            {
                "value": "常德市",
                "label": "常德市",
                "num": "430700",
                "children": [{
                        "value": "武陵区",
                        "label": "武陵区",
                        "num": "430702"
                    },
                    {
                        "value": "鼎城区",
                        "label": "鼎城区",
                        "num": "430703"
                    },
                    {
                        "value": "安乡县",
                        "label": "安乡县",
                        "num": "430721"
                    },
                    {
                        "value": "汉寿县",
                        "label": "汉寿县",
                        "num": "430722"
                    },
                    {
                        "value": "澧县",
                        "label": "澧县",
                        "num": "430723"
                    },
                    {
                        "value": "临澧县",
                        "label": "临澧县",
                        "num": "430724"
                    },
                    {
                        "value": "桃源县",
                        "label": "桃源县",
                        "num": "430725"
                    },
                    {
                        "value": "石门县",
                        "label": "石门县",
                        "num": "430726"
                    },
                    {
                        "value": "津市市",
                        "label": "津市市",
                        "num": "430781"
                    }
                ]
            },
            {
                "value": "张家界市",
                "label": "张家界市",
                "num": "430800",
                "children": [{
                        "value": "永定区",
                        "label": "永定区",
                        "num": "430802"
                    },
                    {
                        "value": "武陵源区",
                        "label": "武陵源区",
                        "num": "430811"
                    },
                    {
                        "value": "慈利县",
                        "label": "慈利县",
                        "num": "430821"
                    },
                    {
                        "value": "桑植县",
                        "label": "桑植县",
                        "num": "430822"
                    }
                ]
            },
            {
                "value": "益阳市",
                "label": "益阳市",
                "num": "430900",
                "children": [{
                        "value": "资阳区",
                        "label": "资阳区",
                        "num": "430902"
                    },
                    {
                        "value": "赫山区",
                        "label": "赫山区",
                        "num": "430903"
                    },
                    {
                        "value": "南县",
                        "label": "南县",
                        "num": "430921"
                    },
                    {
                        "value": "桃江县",
                        "label": "桃江县",
                        "num": "430922"
                    },
                    {
                        "value": "安化县",
                        "label": "安化县",
                        "num": "430923"
                    },
                    {
                        "value": "沅江市",
                        "label": "沅江市",
                        "num": "430981"
                    }
                ]
            },
            {
                "value": "郴州市",
                "label": "郴州市",
                "num": "431000",
                "children": [{
                        "value": "北湖区",
                        "label": "北湖区",
                        "num": "431002"
                    },
                    {
                        "value": "苏仙区",
                        "label": "苏仙区",
                        "num": "431003"
                    },
                    {
                        "value": "桂阳县",
                        "label": "桂阳县",
                        "num": "431021"
                    },
                    {
                        "value": "宜章县",
                        "label": "宜章县",
                        "num": "431022"
                    },
                    {
                        "value": "永兴县",
                        "label": "永兴县",
                        "num": "431023"
                    },
                    {
                        "value": "嘉禾县",
                        "label": "嘉禾县",
                        "num": "431024"
                    },
                    {
                        "value": "临武县",
                        "label": "临武县",
                        "num": "431025"
                    },
                    {
                        "value": "汝城县",
                        "label": "汝城县",
                        "num": "431026"
                    },
                    {
                        "value": "桂东县",
                        "label": "桂东县",
                        "num": "431027"
                    },
                    {
                        "value": "安仁县",
                        "label": "安仁县",
                        "num": "431028"
                    },
                    {
                        "value": "资兴市",
                        "label": "资兴市",
                        "num": "431081"
                    }
                ]
            },
            {
                "value": "永州市",
                "label": "永州市",
                "num": "431100",
                "children": [{
                        "value": "零陵区",
                        "label": "零陵区",
                        "num": "431102"
                    },
                    {
                        "value": "冷水滩区",
                        "label": "冷水滩区",
                        "num": "431103"
                    },
                    {
                        "value": "祁阳县",
                        "label": "祁阳县",
                        "num": "431121"
                    },
                    {
                        "value": "东安县",
                        "label": "东安县",
                        "num": "431122"
                    },
                    {
                        "value": "双牌县",
                        "label": "双牌县",
                        "num": "431123"
                    },
                    {
                        "value": "道县",
                        "label": "道县",
                        "num": "431124"
                    },
                    {
                        "value": "江永县",
                        "label": "江永县",
                        "num": "431125"
                    },
                    {
                        "value": "宁远县",
                        "label": "宁远县",
                        "num": "431126"
                    },
                    {
                        "value": "蓝山县",
                        "label": "蓝山县",
                        "num": "431127"
                    },
                    {
                        "value": "新田县",
                        "label": "新田县",
                        "num": "431128"
                    },
                    {
                        "value": "江华瑶族自治县",
                        "label": "江华瑶族自治县",
                        "num": "431129"
                    }
                ]
            },
            {
                "value": "怀化市",
                "label": "怀化市",
                "num": "431200",
                "children": [{
                        "value": "鹤城区",
                        "label": "鹤城区",
                        "num": "431202"
                    },
                    {
                        "value": "中方县",
                        "label": "中方县",
                        "num": "431221"
                    },
                    {
                        "value": "沅陵县",
                        "label": "沅陵县",
                        "num": "431222"
                    },
                    {
                        "value": "辰溪县",
                        "label": "辰溪县",
                        "num": "431223"
                    },
                    {
                        "value": "溆浦县",
                        "label": "溆浦县",
                        "num": "431224"
                    },
                    {
                        "value": "会同县",
                        "label": "会同县",
                        "num": "431225"
                    },
                    {
                        "value": "麻阳苗族自治县",
                        "label": "麻阳苗族自治县",
                        "num": "431226"
                    },
                    {
                        "value": "新晃侗族自治县",
                        "label": "新晃侗族自治县",
                        "num": "431227"
                    },
                    {
                        "value": "芷江侗族自治县",
                        "label": "芷江侗族自治县",
                        "num": "431228"
                    },
                    {
                        "value": "靖州苗族侗族自治县",
                        "label": "靖州苗族侗族自治县",
                        "num": "431229"
                    },
                    {
                        "value": "通道侗族自治县",
                        "label": "通道侗族自治县",
                        "num": "431230"
                    },
                    {
                        "value": "洪江市",
                        "label": "洪江市",
                        "num": "431281"
                    }
                ]
            },
            {
                "value": "娄底市",
                "label": "娄底市",
                "num": "431300",
                "children": [{
                        "value": "娄星区",
                        "label": "娄星区",
                        "num": "431302"
                    },
                    {
                        "value": "双峰县",
                        "label": "双峰县",
                        "num": "431321"
                    },
                    {
                        "value": "新化县",
                        "label": "新化县",
                        "num": "431322"
                    },
                    {
                        "value": "冷水江市",
                        "label": "冷水江市",
                        "num": "431381"
                    },
                    {
                        "value": "涟源市",
                        "label": "涟源市",
                        "num": "431382"
                    }
                ]
            },
            {
                "value": "湘西土家族苗族自治州",
                "label": "湘西土家族苗族自治州",
                "num": "433100",
                "children": [{
                        "value": "吉首市",
                        "label": "吉首市",
                        "num": "433101"
                    },
                    {
                        "value": "泸溪县",
                        "label": "泸溪县",
                        "num": "433122"
                    },
                    {
                        "value": "凤凰县",
                        "label": "凤凰县",
                        "num": "433123"
                    },
                    {
                        "value": "花垣县",
                        "label": "花垣县",
                        "num": "433124"
                    },
                    {
                        "value": "保靖县",
                        "label": "保靖县",
                        "num": "433125"
                    },
                    {
                        "value": "古丈县",
                        "label": "古丈县",
                        "num": "433126"
                    },
                    {
                        "value": "永顺县",
                        "label": "永顺县",
                        "num": "433127"
                    },
                    {
                        "value": "龙山县",
                        "label": "龙山县",
                        "num": "433130"
                    }
                ]
            }
        ]
    },
    {
        "value": "广东省",
        "label": "广东省",
        "num": "440000",
        "children": [{
                "value": "广州市",
                "label": "广州市",
                "num": "440100",
                "children": [{
                        "value": "荔湾区",
                        "label": "荔湾区",
                        "num": "440103"
                    },
                    {
                        "value": "越秀区",
                        "label": "越秀区",
                        "num": "440104"
                    },
                    {
                        "value": "海珠区",
                        "label": "海珠区",
                        "num": "440105"
                    },
                    {
                        "value": "天河区",
                        "label": "天河区",
                        "num": "440106"
                    },
                    {
                        "value": "白云区",
                        "label": "白云区",
                        "num": "440111"
                    },
                    {
                        "value": "黄埔区",
                        "label": "黄埔区",
                        "num": "440112"
                    },
                    {
                        "value": "番禺区",
                        "label": "番禺区",
                        "num": "440113"
                    },
                    {
                        "value": "花都区",
                        "label": "花都区",
                        "num": "440114"
                    },
                    {
                        "value": "南沙区",
                        "label": "南沙区",
                        "num": "440115"
                    },
                    {
                        "value": "从化区",
                        "label": "从化区",
                        "num": "440117"
                    },
                    {
                        "value": "增城区",
                        "label": "增城区",
                        "num": "440118"
                    }
                ]
            },
            {
                "value": "韶关市",
                "label": "韶关市",
                "num": "440200",
                "children": [{
                        "value": "武江区",
                        "label": "武江区",
                        "num": "440203"
                    },
                    {
                        "value": "浈江区",
                        "label": "浈江区",
                        "num": "440204"
                    },
                    {
                        "value": "曲江区",
                        "label": "曲江区",
                        "num": "440205"
                    },
                    {
                        "value": "始兴县",
                        "label": "始兴县",
                        "num": "440222"
                    },
                    {
                        "value": "仁化县",
                        "label": "仁化县",
                        "num": "440224"
                    },
                    {
                        "value": "翁源县",
                        "label": "翁源县",
                        "num": "440229"
                    },
                    {
                        "value": "乳源瑶族自治县",
                        "label": "乳源瑶族自治县",
                        "num": "440232"
                    },
                    {
                        "value": "新丰县",
                        "label": "新丰县",
                        "num": "440233"
                    },
                    {
                        "value": "乐昌市",
                        "label": "乐昌市",
                        "num": "440281"
                    },
                    {
                        "value": "南雄市",
                        "label": "南雄市",
                        "num": "440282"
                    }
                ]
            },
            {
                "value": "深圳市",
                "label": "深圳市",
                "num": "440300",
                "children": [{
                        "value": "罗湖区",
                        "label": "罗湖区",
                        "num": "440303"
                    },
                    {
                        "value": "福田区",
                        "label": "福田区",
                        "num": "440304"
                    },
                    {
                        "value": "南山区",
                        "label": "南山区",
                        "num": "440305"
                    },
                    {
                        "value": "宝安区",
                        "label": "宝安区",
                        "num": "440306"
                    },
                    {
                        "value": "龙岗区",
                        "label": "龙岗区",
                        "num": "440307"
                    },
                    {
                        "value": "盐田区",
                        "label": "盐田区",
                        "num": "440308"
                    },
                    {
                        "value": "龙华区",
                        "label": "龙华区",
                        "num": "440309"
                    },
                    {
                        "value": "坪山区",
                        "label": "坪山区",
                        "num": "440310"
                    },
                    {
                        "value": "光明区",
                        "label": "光明区",
                        "num": "440311"
                    }
                ]
            },
            {
                "value": "珠海市",
                "label": "珠海市",
                "num": "440400",
                "children": [{
                        "value": "香洲区",
                        "label": "香洲区",
                        "num": "440402"
                    },
                    {
                        "value": "斗门区",
                        "label": "斗门区",
                        "num": "440403"
                    },
                    {
                        "value": "金湾区",
                        "label": "金湾区",
                        "num": "440404"
                    }
                ]
            },
            {
                "value": "汕头市",
                "label": "汕头市",
                "num": "440500",
                "children": [{
                        "value": "龙湖区",
                        "label": "龙湖区",
                        "num": "440507"
                    },
                    {
                        "value": "金平区",
                        "label": "金平区",
                        "num": "440511"
                    },
                    {
                        "value": "濠江区",
                        "label": "濠江区",
                        "num": "440512"
                    },
                    {
                        "value": "潮阳区",
                        "label": "潮阳区",
                        "num": "440513"
                    },
                    {
                        "value": "潮南区",
                        "label": "潮南区",
                        "num": "440514"
                    },
                    {
                        "value": "澄海区",
                        "label": "澄海区",
                        "num": "440515"
                    },
                    {
                        "value": "南澳县",
                        "label": "南澳县",
                        "num": "440523"
                    }
                ]
            },
            {
                "value": "佛山市",
                "label": "佛山市",
                "num": "440600",
                "children": [{
                        "value": "禅城区",
                        "label": "禅城区",
                        "num": "440604"
                    },
                    {
                        "value": "南海区",
                        "label": "南海区",
                        "num": "440605"
                    },
                    {
                        "value": "顺德区",
                        "label": "顺德区",
                        "num": "440606"
                    },
                    {
                        "value": "三水区",
                        "label": "三水区",
                        "num": "440607"
                    },
                    {
                        "value": "高明区",
                        "label": "高明区",
                        "num": "440608"
                    }
                ]
            },
            {
                "value": "江门市",
                "label": "江门市",
                "num": "440700",
                "children": [{
                        "value": "蓬江区",
                        "label": "蓬江区",
                        "num": "440703"
                    },
                    {
                        "value": "江海区",
                        "label": "江海区",
                        "num": "440704"
                    },
                    {
                        "value": "新会区",
                        "label": "新会区",
                        "num": "440705"
                    },
                    {
                        "value": "台山市",
                        "label": "台山市",
                        "num": "440781"
                    },
                    {
                        "value": "开平市",
                        "label": "开平市",
                        "num": "440783"
                    },
                    {
                        "value": "鹤山市",
                        "label": "鹤山市",
                        "num": "440784"
                    },
                    {
                        "value": "恩平市",
                        "label": "恩平市",
                        "num": "440785"
                    }
                ]
            },
            {
                "value": "湛江市",
                "label": "湛江市",
                "num": "440800",
                "children": [{
                        "value": "赤坎区",
                        "label": "赤坎区",
                        "num": "440802"
                    },
                    {
                        "value": "霞山区",
                        "label": "霞山区",
                        "num": "440803"
                    },
                    {
                        "value": "坡头区",
                        "label": "坡头区",
                        "num": "440804"
                    },
                    {
                        "value": "麻章区",
                        "label": "麻章区",
                        "num": "440811"
                    },
                    {
                        "value": "遂溪县",
                        "label": "遂溪县",
                        "num": "440823"
                    },
                    {
                        "value": "徐闻县",
                        "label": "徐闻县",
                        "num": "440825"
                    },
                    {
                        "value": "廉江市",
                        "label": "廉江市",
                        "num": "440881"
                    },
                    {
                        "value": "雷州市",
                        "label": "雷州市",
                        "num": "440882"
                    },
                    {
                        "value": "吴川市",
                        "label": "吴川市",
                        "num": "440883"
                    },
                    {
                        "value": "经济技术开发区",
                        "label": "经济技术开发区",
                        "num": "440890"
                    }
                ]
            },
            {
                "value": "茂名市",
                "label": "茂名市",
                "num": "440900",
                "children": [{
                        "value": "茂南区",
                        "label": "茂南区",
                        "num": "440902"
                    },
                    {
                        "value": "电白区",
                        "label": "电白区",
                        "num": "440904"
                    },
                    {
                        "value": "高州市",
                        "label": "高州市",
                        "num": "440981"
                    },
                    {
                        "value": "化州市",
                        "label": "化州市",
                        "num": "440982"
                    },
                    {
                        "value": "信宜市",
                        "label": "信宜市",
                        "num": "440983"
                    }
                ]
            },
            {
                "value": "肇庆市",
                "label": "肇庆市",
                "num": "441200",
                "children": [{
                        "value": "端州区",
                        "label": "端州区",
                        "num": "441202"
                    },
                    {
                        "value": "鼎湖区",
                        "label": "鼎湖区",
                        "num": "441203"
                    },
                    {
                        "value": "高要区",
                        "label": "高要区",
                        "num": "441204"
                    },
                    {
                        "value": "广宁县",
                        "label": "广宁县",
                        "num": "441223"
                    },
                    {
                        "value": "怀集县",
                        "label": "怀集县",
                        "num": "441224"
                    },
                    {
                        "value": "封开县",
                        "label": "封开县",
                        "num": "441225"
                    },
                    {
                        "value": "德庆县",
                        "label": "德庆县",
                        "num": "441226"
                    },
                    {
                        "value": "四会市",
                        "label": "四会市",
                        "num": "441284"
                    }
                ]
            },
            {
                "value": "惠州市",
                "label": "惠州市",
                "num": "441300",
                "children": [{
                        "value": "惠城区",
                        "label": "惠城区",
                        "num": "441302"
                    },
                    {
                        "value": "惠阳区",
                        "label": "惠阳区",
                        "num": "441303"
                    },
                    {
                        "value": "博罗县",
                        "label": "博罗县",
                        "num": "441322"
                    },
                    {
                        "value": "惠东县",
                        "label": "惠东县",
                        "num": "441323"
                    },
                    {
                        "value": "龙门县",
                        "label": "龙门县",
                        "num": "441324"
                    }
                ]
            },
            {
                "value": "梅州市",
                "label": "梅州市",
                "num": "441400",
                "children": [{
                        "value": "梅江区",
                        "label": "梅江区",
                        "num": "441402"
                    },
                    {
                        "value": "梅县区",
                        "label": "梅县区",
                        "num": "441403"
                    },
                    {
                        "value": "大埔县",
                        "label": "大埔县",
                        "num": "441422"
                    },
                    {
                        "value": "丰顺县",
                        "label": "丰顺县",
                        "num": "441423"
                    },
                    {
                        "value": "五华县",
                        "label": "五华县",
                        "num": "441424"
                    },
                    {
                        "value": "平远县",
                        "label": "平远县",
                        "num": "441426"
                    },
                    {
                        "value": "蕉岭县",
                        "label": "蕉岭县",
                        "num": "441427"
                    },
                    {
                        "value": "兴宁市",
                        "label": "兴宁市",
                        "num": "441481"
                    }
                ]
            },
            {
                "value": "汕尾市",
                "label": "汕尾市",
                "num": "441500",
                "children": [{
                        "value": "城区",
                        "label": "城区",
                        "num": "441502"
                    },
                    {
                        "value": "海丰县",
                        "label": "海丰县",
                        "num": "441521"
                    },
                    {
                        "value": "陆河县",
                        "label": "陆河县",
                        "num": "441523"
                    },
                    {
                        "value": "陆丰市",
                        "label": "陆丰市",
                        "num": "441581"
                    }
                ]
            },
            {
                "value": "河源市",
                "label": "河源市",
                "num": "441600",
                "children": [{
                        "value": "源城区",
                        "label": "源城区",
                        "num": "441602"
                    },
                    {
                        "value": "紫金县",
                        "label": "紫金县",
                        "num": "441621"
                    },
                    {
                        "value": "龙川县",
                        "label": "龙川县",
                        "num": "441622"
                    },
                    {
                        "value": "连平县",
                        "label": "连平县",
                        "num": "441623"
                    },
                    {
                        "value": "和平县",
                        "label": "和平县",
                        "num": "441624"
                    },
                    {
                        "value": "东源县",
                        "label": "东源县",
                        "num": "441625"
                    }
                ]
            },
            {
                "value": "阳江市",
                "label": "阳江市",
                "num": "441700",
                "children": [{
                        "value": "江城区",
                        "label": "江城区",
                        "num": "441702"
                    },
                    {
                        "value": "阳东区",
                        "label": "阳东区",
                        "num": "441704"
                    },
                    {
                        "value": "阳西县",
                        "label": "阳西县",
                        "num": "441721"
                    },
                    {
                        "value": "阳春市",
                        "label": "阳春市",
                        "num": "441781"
                    }
                ]
            },
            {
                "value": "清远市",
                "label": "清远市",
                "num": "441800",
                "children": [{
                        "value": "清城区",
                        "label": "清城区",
                        "num": "441802"
                    },
                    {
                        "value": "清新区",
                        "label": "清新区",
                        "num": "441803"
                    },
                    {
                        "value": "佛冈县",
                        "label": "佛冈县",
                        "num": "441821"
                    },
                    {
                        "value": "阳山县",
                        "label": "阳山县",
                        "num": "441823"
                    },
                    {
                        "value": "连山壮族瑶族自治县",
                        "label": "连山壮族瑶族自治县",
                        "num": "441825"
                    },
                    {
                        "value": "连南瑶族自治县",
                        "label": "连南瑶族自治县",
                        "num": "441826"
                    },
                    {
                        "value": "英德市",
                        "label": "英德市",
                        "num": "441881"
                    },
                    {
                        "value": "连州市",
                        "label": "连州市",
                        "num": "441882"
                    }
                ]
            },
            {
                "value": "东莞市",
                "label": "东莞市",
                "num": "441900",
                "children": [{
                        "value": "中堂镇",
                        "label": "中堂镇",
                        "num": "441901"
                    },
                    {
                        "value": "南城街道办事处",
                        "label": "南城街道办事处",
                        "num": "441903"
                    },
                    {
                        "value": "长安镇",
                        "label": "长安镇",
                        "num": "441904"
                    },
                    {
                        "value": "东坑镇",
                        "label": "东坑镇",
                        "num": "441905"
                    },
                    {
                        "value": "樟木头镇",
                        "label": "樟木头镇",
                        "num": "441906"
                    },
                    {
                        "value": "莞城街道办事处",
                        "label": "莞城街道办事处",
                        "num": "441907"
                    },
                    {
                        "value": "石龙镇",
                        "label": "石龙镇",
                        "num": "441908"
                    },
                    {
                        "value": "桥头镇",
                        "label": "桥头镇",
                        "num": "441909"
                    },
                    {
                        "value": "万江街道办事处",
                        "label": "万江街道办事处",
                        "num": "441910"
                    },
                    {
                        "value": "麻涌镇",
                        "label": "麻涌镇",
                        "num": "441911"
                    },
                    {
                        "value": "虎门镇",
                        "label": "虎门镇",
                        "num": "441912"
                    },
                    {
                        "value": "谢岗镇",
                        "label": "谢岗镇",
                        "num": "441913"
                    },
                    {
                        "value": "石碣镇",
                        "label": "石碣镇",
                        "num": "441914"
                    },
                    {
                        "value": "茶山镇",
                        "label": "茶山镇",
                        "num": "441915"
                    },
                    {
                        "value": "东城街道办事处",
                        "label": "东城街道办事处",
                        "num": "441916"
                    },
                    {
                        "value": "洪梅镇",
                        "label": "洪梅镇",
                        "num": "441917"
                    },
                    {
                        "value": "道滘镇",
                        "label": "道滘镇",
                        "num": "441918"
                    },
                    {
                        "value": "高埗镇",
                        "label": "高埗镇",
                        "num": "441919"
                    },
                    {
                        "value": "企石镇",
                        "label": "企石镇",
                        "num": "441920"
                    },
                    {
                        "value": "凤岗镇",
                        "label": "凤岗镇",
                        "num": "441921"
                    },
                    {
                        "value": "大岭山镇",
                        "label": "大岭山镇",
                        "num": "441922"
                    },
                    {
                        "value": "松山湖管委会",
                        "label": "松山湖管委会",
                        "num": "441923"
                    },
                    {
                        "value": "清溪镇",
                        "label": "清溪镇",
                        "num": "441924"
                    },
                    {
                        "value": "望牛墩镇",
                        "label": "望牛墩镇",
                        "num": "441925"
                    },
                    {
                        "value": "厚街镇",
                        "label": "厚街镇",
                        "num": "441926"
                    },
                    {
                        "value": "常平镇",
                        "label": "常平镇",
                        "num": "441927"
                    },
                    {
                        "value": "寮步镇",
                        "label": "寮步镇",
                        "num": "441928"
                    },
                    {
                        "value": "石排镇",
                        "label": "石排镇",
                        "num": "441929"
                    },
                    {
                        "value": "横沥镇",
                        "label": "横沥镇",
                        "num": "441930"
                    },
                    {
                        "value": "塘厦镇",
                        "label": "塘厦镇",
                        "num": "441931"
                    },
                    {
                        "value": "黄江镇",
                        "label": "黄江镇",
                        "num": "441932"
                    },
                    {
                        "value": "大朗镇",
                        "label": "大朗镇",
                        "num": "441933"
                    },
                    {
                        "value": "东莞港",
                        "label": "东莞港",
                        "num": "441934"
                    },
                    {
                        "value": "东莞生态园",
                        "label": "东莞生态园",
                        "num": "441935"
                    },
                    {
                        "value": "沙田镇",
                        "label": "沙田镇",
                        "num": "441990"
                    }
                ]
            },
            {
                "value": "中山市",
                "label": "中山市",
                "num": "442000",
                "children": [{
                        "value": "南头镇",
                        "label": "南头镇",
                        "num": "442001"
                    },
                    {
                        "value": "神湾镇",
                        "label": "神湾镇",
                        "num": "442002"
                    },
                    {
                        "value": "东凤镇",
                        "label": "东凤镇",
                        "num": "442003"
                    },
                    {
                        "value": "五桂山街道办事处",
                        "label": "五桂山街道办事处",
                        "num": "442004"
                    },
                    {
                        "value": "黄圃镇",
                        "label": "黄圃镇",
                        "num": "442005"
                    },
                    {
                        "value": "小榄镇",
                        "label": "小榄镇",
                        "num": "442006"
                    },
                    {
                        "value": "石岐区街道办事处",
                        "label": "石岐区街道办事处",
                        "num": "442007"
                    },
                    {
                        "value": "横栏镇",
                        "label": "横栏镇",
                        "num": "442008"
                    },
                    {
                        "value": "三角镇",
                        "label": "三角镇",
                        "num": "442009"
                    },
                    {
                        "value": "三乡镇",
                        "label": "三乡镇",
                        "num": "442010"
                    },
                    {
                        "value": "港口镇",
                        "label": "港口镇",
                        "num": "442011"
                    },
                    {
                        "value": "沙溪镇",
                        "label": "沙溪镇",
                        "num": "442012"
                    },
                    {
                        "value": "板芙镇",
                        "label": "板芙镇",
                        "num": "442013"
                    },
                    {
                        "value": "东升镇",
                        "label": "东升镇",
                        "num": "442015"
                    },
                    {
                        "value": "阜沙镇",
                        "label": "阜沙镇",
                        "num": "442016"
                    },
                    {
                        "value": "民众镇",
                        "label": "民众镇",
                        "num": "442017"
                    },
                    {
                        "value": "东区街道办事处",
                        "label": "东区街道办事处",
                        "num": "442018"
                    },
                    {
                        "value": "火炬开发区街道办事处",
                        "label": "火炬开发区街道办事处",
                        "num": "442019"
                    },
                    {
                        "value": "西区街道办事处",
                        "label": "西区街道办事处",
                        "num": "442020"
                    },
                    {
                        "value": "南区街道办事处",
                        "label": "南区街道办事处",
                        "num": "442021"
                    },
                    {
                        "value": "古镇镇",
                        "label": "古镇镇",
                        "num": "442022"
                    },
                    {
                        "value": "坦洲镇",
                        "label": "坦洲镇",
                        "num": "442023"
                    },
                    {
                        "value": "大涌镇",
                        "label": "大涌镇",
                        "num": "442024"
                    },
                    {
                        "value": "南朗镇",
                        "label": "南朗镇",
                        "num": "442025"
                    }
                ]
            },
            {
                "value": "潮州市",
                "label": "潮州市",
                "num": "445100",
                "children": [{
                        "value": "湘桥区",
                        "label": "湘桥区",
                        "num": "445102"
                    },
                    {
                        "value": "潮安区",
                        "label": "潮安区",
                        "num": "445103"
                    },
                    {
                        "value": "饶平县",
                        "label": "饶平县",
                        "num": "445122"
                    }
                ]
            },
            {
                "value": "揭阳市",
                "label": "揭阳市",
                "num": "445200",
                "children": [{
                        "value": "榕城区",
                        "label": "榕城区",
                        "num": "445202"
                    },
                    {
                        "value": "揭东区",
                        "label": "揭东区",
                        "num": "445203"
                    },
                    {
                        "value": "揭西县",
                        "label": "揭西县",
                        "num": "445222"
                    },
                    {
                        "value": "惠来县",
                        "label": "惠来县",
                        "num": "445224"
                    },
                    {
                        "value": "普宁市",
                        "label": "普宁市",
                        "num": "445281"
                    }
                ]
            },
            {
                "value": "云浮市",
                "label": "云浮市",
                "num": "445300",
                "children": [{
                        "value": "云城区",
                        "label": "云城区",
                        "num": "445302"
                    },
                    {
                        "value": "云安区",
                        "label": "云安区",
                        "num": "445303"
                    },
                    {
                        "value": "新兴县",
                        "label": "新兴县",
                        "num": "445321"
                    },
                    {
                        "value": "郁南县",
                        "label": "郁南县",
                        "num": "445322"
                    },
                    {
                        "value": "罗定市",
                        "label": "罗定市",
                        "num": "445381"
                    }
                ]
            }
        ]
    },
    {
        "value": "广西壮族自治区",
        "label": "广西壮族自治区",
        "num": "450000",
        "children": [{
                "value": "南宁市",
                "label": "南宁市",
                "num": "450100",
                "children": [{
                        "value": "兴宁区",
                        "label": "兴宁区",
                        "num": "450102"
                    },
                    {
                        "value": "青秀区",
                        "label": "青秀区",
                        "num": "450103"
                    },
                    {
                        "value": "江南区",
                        "label": "江南区",
                        "num": "450105"
                    },
                    {
                        "value": "西乡塘区",
                        "label": "西乡塘区",
                        "num": "450107"
                    },
                    {
                        "value": "良庆区",
                        "label": "良庆区",
                        "num": "450108"
                    },
                    {
                        "value": "邕宁区",
                        "label": "邕宁区",
                        "num": "450109"
                    },
                    {
                        "value": "武鸣区",
                        "label": "武鸣区",
                        "num": "450110"
                    },
                    {
                        "value": "隆安县",
                        "label": "隆安县",
                        "num": "450123"
                    },
                    {
                        "value": "马山县",
                        "label": "马山县",
                        "num": "450124"
                    },
                    {
                        "value": "上林县",
                        "label": "上林县",
                        "num": "450125"
                    },
                    {
                        "value": "宾阳县",
                        "label": "宾阳县",
                        "num": "450126"
                    },
                    {
                        "value": "横县",
                        "label": "横县",
                        "num": "450127"
                    }
                ]
            },
            {
                "value": "柳州市",
                "label": "柳州市",
                "num": "450200",
                "children": [{
                        "value": "城中区",
                        "label": "城中区",
                        "num": "450202"
                    },
                    {
                        "value": "鱼峰区",
                        "label": "鱼峰区",
                        "num": "450203"
                    },
                    {
                        "value": "柳南区",
                        "label": "柳南区",
                        "num": "450204"
                    },
                    {
                        "value": "柳北区",
                        "label": "柳北区",
                        "num": "450205"
                    },
                    {
                        "value": "柳江区",
                        "label": "柳江区",
                        "num": "450206"
                    },
                    {
                        "value": "柳城县",
                        "label": "柳城县",
                        "num": "450222"
                    },
                    {
                        "value": "鹿寨县",
                        "label": "鹿寨县",
                        "num": "450223"
                    },
                    {
                        "value": "融安县",
                        "label": "融安县",
                        "num": "450224"
                    },
                    {
                        "value": "融水苗族自治县",
                        "label": "融水苗族自治县",
                        "num": "450225"
                    },
                    {
                        "value": "三江侗族自治县",
                        "label": "三江侗族自治县",
                        "num": "450226"
                    }
                ]
            },
            {
                "value": "桂林市",
                "label": "桂林市",
                "num": "450300",
                "children": [{
                        "value": "秀峰区",
                        "label": "秀峰区",
                        "num": "450302"
                    },
                    {
                        "value": "叠彩区",
                        "label": "叠彩区",
                        "num": "450303"
                    },
                    {
                        "value": "象山区",
                        "label": "象山区",
                        "num": "450304"
                    },
                    {
                        "value": "七星区",
                        "label": "七星区",
                        "num": "450305"
                    },
                    {
                        "value": "雁山区",
                        "label": "雁山区",
                        "num": "450311"
                    },
                    {
                        "value": "临桂区",
                        "label": "临桂区",
                        "num": "450312"
                    },
                    {
                        "value": "阳朔县",
                        "label": "阳朔县",
                        "num": "450321"
                    },
                    {
                        "value": "灵川县",
                        "label": "灵川县",
                        "num": "450323"
                    },
                    {
                        "value": "全州县",
                        "label": "全州县",
                        "num": "450324"
                    },
                    {
                        "value": "兴安县",
                        "label": "兴安县",
                        "num": "450325"
                    },
                    {
                        "value": "永福县",
                        "label": "永福县",
                        "num": "450326"
                    },
                    {
                        "value": "灌阳县",
                        "label": "灌阳县",
                        "num": "450327"
                    },
                    {
                        "value": "龙胜各族自治县",
                        "label": "龙胜各族自治县",
                        "num": "450328"
                    },
                    {
                        "value": "资源县",
                        "label": "资源县",
                        "num": "450329"
                    },
                    {
                        "value": "平乐县",
                        "label": "平乐县",
                        "num": "450330"
                    },
                    {
                        "value": "恭城瑶族自治县",
                        "label": "恭城瑶族自治县",
                        "num": "450332"
                    },
                    {
                        "value": "荔浦市",
                        "label": "荔浦市",
                        "num": "450381"
                    }
                ]
            },
            {
                "value": "梧州市",
                "label": "梧州市",
                "num": "450400",
                "children": [{
                        "value": "万秀区",
                        "label": "万秀区",
                        "num": "450403"
                    },
                    {
                        "value": "长洲区",
                        "label": "长洲区",
                        "num": "450405"
                    },
                    {
                        "value": "龙圩区",
                        "label": "龙圩区",
                        "num": "450406"
                    },
                    {
                        "value": "苍梧县",
                        "label": "苍梧县",
                        "num": "450421"
                    },
                    {
                        "value": "藤县",
                        "label": "藤县",
                        "num": "450422"
                    },
                    {
                        "value": "蒙山县",
                        "label": "蒙山县",
                        "num": "450423"
                    },
                    {
                        "value": "岑溪市",
                        "label": "岑溪市",
                        "num": "450481"
                    }
                ]
            },
            {
                "value": "北海市",
                "label": "北海市",
                "num": "450500",
                "children": [{
                        "value": "海城区",
                        "label": "海城区",
                        "num": "450502"
                    },
                    {
                        "value": "银海区",
                        "label": "银海区",
                        "num": "450503"
                    },
                    {
                        "value": "铁山港区",
                        "label": "铁山港区",
                        "num": "450512"
                    },
                    {
                        "value": "合浦县",
                        "label": "合浦县",
                        "num": "450521"
                    }
                ]
            },
            {
                "value": "防城港市",
                "label": "防城港市",
                "num": "450600",
                "children": [{
                        "value": "港口区",
                        "label": "港口区",
                        "num": "450602"
                    },
                    {
                        "value": "防城区",
                        "label": "防城区",
                        "num": "450603"
                    },
                    {
                        "value": "上思县",
                        "label": "上思县",
                        "num": "450621"
                    },
                    {
                        "value": "东兴市",
                        "label": "东兴市",
                        "num": "450681"
                    }
                ]
            },
            {
                "value": "钦州市",
                "label": "钦州市",
                "num": "450700",
                "children": [{
                        "value": "钦南区",
                        "label": "钦南区",
                        "num": "450702"
                    },
                    {
                        "value": "钦北区",
                        "label": "钦北区",
                        "num": "450703"
                    },
                    {
                        "value": "灵山县",
                        "label": "灵山县",
                        "num": "450721"
                    },
                    {
                        "value": "浦北县",
                        "label": "浦北县",
                        "num": "450722"
                    }
                ]
            },
            {
                "value": "贵港市",
                "label": "贵港市",
                "num": "450800",
                "children": [{
                        "value": "港北区",
                        "label": "港北区",
                        "num": "450802"
                    },
                    {
                        "value": "港南区",
                        "label": "港南区",
                        "num": "450803"
                    },
                    {
                        "value": "覃塘区",
                        "label": "覃塘区",
                        "num": "450804"
                    },
                    {
                        "value": "平南县",
                        "label": "平南县",
                        "num": "450821"
                    },
                    {
                        "value": "桂平市",
                        "label": "桂平市",
                        "num": "450881"
                    }
                ]
            },
            {
                "value": "玉林市",
                "label": "玉林市",
                "num": "450900",
                "children": [{
                        "value": "玉州区",
                        "label": "玉州区",
                        "num": "450902"
                    },
                    {
                        "value": "福绵区",
                        "label": "福绵区",
                        "num": "450903"
                    },
                    {
                        "value": "容县",
                        "label": "容县",
                        "num": "450921"
                    },
                    {
                        "value": "陆川县",
                        "label": "陆川县",
                        "num": "450922"
                    },
                    {
                        "value": "博白县",
                        "label": "博白县",
                        "num": "450923"
                    },
                    {
                        "value": "兴业县",
                        "label": "兴业县",
                        "num": "450924"
                    },
                    {
                        "value": "北流市",
                        "label": "北流市",
                        "num": "450981"
                    }
                ]
            },
            {
                "value": "百色市",
                "label": "百色市",
                "num": "451000",
                "children": [{
                        "value": "右江区",
                        "label": "右江区",
                        "num": "451002"
                    },
                    {
                        "value": "田阳县",
                        "label": "田阳县",
                        "num": "451021"
                    },
                    {
                        "value": "田东县",
                        "label": "田东县",
                        "num": "451022"
                    },
                    {
                        "value": "平果县",
                        "label": "平果县",
                        "num": "451023"
                    },
                    {
                        "value": "德保县",
                        "label": "德保县",
                        "num": "451024"
                    },
                    {
                        "value": "那坡县",
                        "label": "那坡县",
                        "num": "451026"
                    },
                    {
                        "value": "凌云县",
                        "label": "凌云县",
                        "num": "451027"
                    },
                    {
                        "value": "乐业县",
                        "label": "乐业县",
                        "num": "451028"
                    },
                    {
                        "value": "田林县",
                        "label": "田林县",
                        "num": "451029"
                    },
                    {
                        "value": "西林县",
                        "label": "西林县",
                        "num": "451030"
                    },
                    {
                        "value": "隆林各族自治县",
                        "label": "隆林各族自治县",
                        "num": "451031"
                    },
                    {
                        "value": "靖西市",
                        "label": "靖西市",
                        "num": "451081"
                    }
                ]
            },
            {
                "value": "贺州市",
                "label": "贺州市",
                "num": "451100",
                "children": [{
                        "value": "八步区",
                        "label": "八步区",
                        "num": "451102"
                    },
                    {
                        "value": "平桂区",
                        "label": "平桂区",
                        "num": "451103"
                    },
                    {
                        "value": "昭平县",
                        "label": "昭平县",
                        "num": "451121"
                    },
                    {
                        "value": "钟山县",
                        "label": "钟山县",
                        "num": "451122"
                    },
                    {
                        "value": "富川瑶族自治县",
                        "label": "富川瑶族自治县",
                        "num": "451123"
                    }
                ]
            },
            {
                "value": "河池市",
                "label": "河池市",
                "num": "451200",
                "children": [{
                        "value": "金城江区",
                        "label": "金城江区",
                        "num": "451202"
                    },
                    {
                        "value": "宜州区",
                        "label": "宜州区",
                        "num": "451203"
                    },
                    {
                        "value": "南丹县",
                        "label": "南丹县",
                        "num": "451221"
                    },
                    {
                        "value": "天峨县",
                        "label": "天峨县",
                        "num": "451222"
                    },
                    {
                        "value": "凤山县",
                        "label": "凤山县",
                        "num": "451223"
                    },
                    {
                        "value": "东兰县",
                        "label": "东兰县",
                        "num": "451224"
                    },
                    {
                        "value": "罗城仫佬族自治县",
                        "label": "罗城仫佬族自治县",
                        "num": "451225"
                    },
                    {
                        "value": "环江毛南族自治县",
                        "label": "环江毛南族自治县",
                        "num": "451226"
                    },
                    {
                        "value": "巴马瑶族自治县",
                        "label": "巴马瑶族自治县",
                        "num": "451227"
                    },
                    {
                        "value": "都安瑶族自治县",
                        "label": "都安瑶族自治县",
                        "num": "451228"
                    },
                    {
                        "value": "大化瑶族自治县",
                        "label": "大化瑶族自治县",
                        "num": "451229"
                    }
                ]
            },
            {
                "value": "来宾市",
                "label": "来宾市",
                "num": "451300",
                "children": [{
                        "value": "兴宾区",
                        "label": "兴宾区",
                        "num": "451302"
                    },
                    {
                        "value": "忻城县",
                        "label": "忻城县",
                        "num": "451321"
                    },
                    {
                        "value": "象州县",
                        "label": "象州县",
                        "num": "451322"
                    },
                    {
                        "value": "武宣县",
                        "label": "武宣县",
                        "num": "451323"
                    },
                    {
                        "value": "金秀瑶族自治县",
                        "label": "金秀瑶族自治县",
                        "num": "451324"
                    },
                    {
                        "value": "合山市",
                        "label": "合山市",
                        "num": "451381"
                    }
                ]
            },
            {
                "value": "崇左市",
                "label": "崇左市",
                "num": "451400",
                "children": [{
                        "value": "江州区",
                        "label": "江州区",
                        "num": "451402"
                    },
                    {
                        "value": "扶绥县",
                        "label": "扶绥县",
                        "num": "451421"
                    },
                    {
                        "value": "宁明县",
                        "label": "宁明县",
                        "num": "451422"
                    },
                    {
                        "value": "龙州县",
                        "label": "龙州县",
                        "num": "451423"
                    },
                    {
                        "value": "大新县",
                        "label": "大新县",
                        "num": "451424"
                    },
                    {
                        "value": "天等县",
                        "label": "天等县",
                        "num": "451425"
                    },
                    {
                        "value": "凭祥市",
                        "label": "凭祥市",
                        "num": "451481"
                    }
                ]
            }
        ]
    },
    {
        "value": "海南省",
        "label": "海南省",
        "num": "460000",
        "children": [{
                "value": "海口市",
                "label": "海口市",
                "num": "460100",
                "children": [{
                        "value": "秀英区",
                        "label": "秀英区",
                        "num": "460105"
                    },
                    {
                        "value": "龙华区",
                        "label": "龙华区",
                        "num": "460106"
                    },
                    {
                        "value": "琼山区",
                        "label": "琼山区",
                        "num": "460107"
                    },
                    {
                        "value": "美兰区",
                        "label": "美兰区",
                        "num": "460108"
                    }
                ]
            },
            {
                "value": "三亚市",
                "label": "三亚市",
                "num": "460200",
                "children": [{
                        "value": "海棠区",
                        "label": "海棠区",
                        "num": "460202"
                    },
                    {
                        "value": "吉阳区",
                        "label": "吉阳区",
                        "num": "460203"
                    },
                    {
                        "value": "天涯区",
                        "label": "天涯区",
                        "num": "460204"
                    },
                    {
                        "value": "崖州区",
                        "label": "崖州区",
                        "num": "460205"
                    }
                ]
            },
            {
                "value": "三沙市",
                "label": "三沙市",
                "num": "460300",
                "children": [{
                        "value": "西沙群岛",
                        "label": "西沙群岛",
                        "num": "460321"
                    },
                    {
                        "value": "南沙群岛",
                        "label": "南沙群岛",
                        "num": "460322"
                    },
                    {
                        "value": "中沙群岛的岛礁及其海域",
                        "label": "中沙群岛的岛礁及其海域",
                        "num": "460323"
                    }
                ]
            },
            {
                "value": "儋州市",
                "label": "儋州市",
                "num": "460400",
                "children": [{
                        "value": "那大镇",
                        "label": "那大镇",
                        "num": "460401"
                    },
                    {
                        "value": "和庆镇",
                        "label": "和庆镇",
                        "num": "460402"
                    },
                    {
                        "value": "南丰镇",
                        "label": "南丰镇",
                        "num": "460403"
                    },
                    {
                        "value": "大成镇",
                        "label": "大成镇",
                        "num": "460404"
                    },
                    {
                        "value": "雅星镇",
                        "label": "雅星镇",
                        "num": "460405"
                    },
                    {
                        "value": "兰洋镇",
                        "label": "兰洋镇",
                        "num": "460406"
                    },
                    {
                        "value": "光村镇",
                        "label": "光村镇",
                        "num": "460407"
                    },
                    {
                        "value": "木棠镇",
                        "label": "木棠镇",
                        "num": "460408"
                    },
                    {
                        "value": "海头镇",
                        "label": "海头镇",
                        "num": "460409"
                    },
                    {
                        "value": "峨蔓镇",
                        "label": "峨蔓镇",
                        "num": "460410"
                    },
                    {
                        "value": "王五镇",
                        "label": "王五镇",
                        "num": "460411"
                    },
                    {
                        "value": "白马井镇",
                        "label": "白马井镇",
                        "num": "460412"
                    },
                    {
                        "value": "中和镇",
                        "label": "中和镇",
                        "num": "460413"
                    },
                    {
                        "value": "排浦镇",
                        "label": "排浦镇",
                        "num": "460414"
                    },
                    {
                        "value": "东成镇",
                        "label": "东成镇",
                        "num": "460415"
                    },
                    {
                        "value": "新州镇",
                        "label": "新州镇",
                        "num": "460416"
                    },
                    {
                        "value": "洋浦经济开发区",
                        "label": "洋浦经济开发区",
                        "num": "460417"
                    },
                    {
                        "value": "华南热作学院",
                        "label": "华南热作学院",
                        "num": "460418"
                    }
                ]
            },
            {
                "value": "省直辖县",
                "label": "省直辖县",
                "num": "469000",
                "children": [{
                        "value": "五指山市",
                        "label": "五指山市",
                        "num": "469001"
                    },
                    {
                        "value": "琼海市",
                        "label": "琼海市",
                        "num": "469002"
                    },
                    {
                        "value": "文昌市",
                        "label": "文昌市",
                        "num": "469005"
                    },
                    {
                        "value": "万宁市",
                        "label": "万宁市",
                        "num": "469006"
                    },
                    {
                        "value": "东方市",
                        "label": "东方市",
                        "num": "469007"
                    },
                    {
                        "value": "定安县",
                        "label": "定安县",
                        "num": "469021"
                    },
                    {
                        "value": "屯昌县",
                        "label": "屯昌县",
                        "num": "469022"
                    },
                    {
                        "value": "澄迈县",
                        "label": "澄迈县",
                        "num": "469023"
                    },
                    {
                        "value": "临高县",
                        "label": "临高县",
                        "num": "469024"
                    },
                    {
                        "value": "白沙黎族自治县",
                        "label": "白沙黎族自治县",
                        "num": "469025"
                    },
                    {
                        "value": "昌江黎族自治县",
                        "label": "昌江黎族自治县",
                        "num": "469026"
                    },
                    {
                        "value": "乐东黎族自治县",
                        "label": "乐东黎族自治县",
                        "num": "469027"
                    },
                    {
                        "value": "陵水黎族自治县",
                        "label": "陵水黎族自治县",
                        "num": "469028"
                    },
                    {
                        "value": "保亭黎族苗族自治县",
                        "label": "保亭黎族苗族自治县",
                        "num": "469029"
                    },
                    {
                        "value": "琼中黎族苗族自治县",
                        "label": "琼中黎族苗族自治县",
                        "num": "469030"
                    }
                ]
            }
        ]
    },
    {
        "value": "重庆市",
        "label": "重庆市",
        "num": "500000",
        "children": [{
                "value": "重庆市",
                "label": "重庆市",
                "num": "500100",
                "children": [{
                        "value": "万州区",
                        "label": "万州区",
                        "num": "500101"
                    },
                    {
                        "value": "涪陵区",
                        "label": "涪陵区",
                        "num": "500102"
                    },
                    {
                        "value": "渝中区",
                        "label": "渝中区",
                        "num": "500103"
                    },
                    {
                        "value": "大渡口区",
                        "label": "大渡口区",
                        "num": "500104"
                    },
                    {
                        "value": "江北区",
                        "label": "江北区",
                        "num": "500105"
                    },
                    {
                        "value": "沙坪坝区",
                        "label": "沙坪坝区",
                        "num": "500106"
                    },
                    {
                        "value": "九龙坡区",
                        "label": "九龙坡区",
                        "num": "500107"
                    },
                    {
                        "value": "南岸区",
                        "label": "南岸区",
                        "num": "500108"
                    },
                    {
                        "value": "北碚区",
                        "label": "北碚区",
                        "num": "500109"
                    },
                    {
                        "value": "綦江区",
                        "label": "綦江区",
                        "num": "500110"
                    },
                    {
                        "value": "大足区",
                        "label": "大足区",
                        "num": "500111"
                    },
                    {
                        "value": "渝北区",
                        "label": "渝北区",
                        "num": "500112"
                    },
                    {
                        "value": "巴南区",
                        "label": "巴南区",
                        "num": "500113"
                    },
                    {
                        "value": "黔江区",
                        "label": "黔江区",
                        "num": "500114"
                    },
                    {
                        "value": "长寿区",
                        "label": "长寿区",
                        "num": "500115"
                    },
                    {
                        "value": "江津区",
                        "label": "江津区",
                        "num": "500116"
                    },
                    {
                        "value": "合川区",
                        "label": "合川区",
                        "num": "500117"
                    },
                    {
                        "value": "永川区",
                        "label": "永川区",
                        "num": "500118"
                    },
                    {
                        "value": "南川区",
                        "label": "南川区",
                        "num": "500119"
                    },
                    {
                        "value": "璧山区",
                        "label": "璧山区",
                        "num": "500120"
                    },
                    {
                        "value": "铜梁区",
                        "label": "铜梁区",
                        "num": "500151"
                    },
                    {
                        "value": "潼南区",
                        "label": "潼南区",
                        "num": "500152"
                    },
                    {
                        "value": "荣昌区",
                        "label": "荣昌区",
                        "num": "500153"
                    },
                    {
                        "value": "开州区",
                        "label": "开州区",
                        "num": "500154"
                    },
                    {
                        "value": "梁平区",
                        "label": "梁平区",
                        "num": "500155"
                    },
                    {
                        "value": "武隆区",
                        "label": "武隆区",
                        "num": "500156"
                    }
                ]
            },
            {
                "value": "县",
                "label": "县",
                "num": "500200",
                "children": [{
                        "value": "城口县",
                        "label": "城口县",
                        "num": "500229"
                    },
                    {
                        "value": "丰都县",
                        "label": "丰都县",
                        "num": "500230"
                    },
                    {
                        "value": "垫江县",
                        "label": "垫江县",
                        "num": "500231"
                    },
                    {
                        "value": "忠县",
                        "label": "忠县",
                        "num": "500233"
                    },
                    {
                        "value": "云阳县",
                        "label": "云阳县",
                        "num": "500235"
                    },
                    {
                        "value": "奉节县",
                        "label": "奉节县",
                        "num": "500236"
                    },
                    {
                        "value": "巫山县",
                        "label": "巫山县",
                        "num": "500237"
                    },
                    {
                        "value": "巫溪县",
                        "label": "巫溪县",
                        "num": "500238"
                    },
                    {
                        "value": "石柱土家族自治县",
                        "label": "石柱土家族自治县",
                        "num": "500240"
                    },
                    {
                        "value": "秀山土家族苗族自治县",
                        "label": "秀山土家族苗族自治县",
                        "num": "500241"
                    },
                    {
                        "value": "酉阳土家族苗族自治县",
                        "label": "酉阳土家族苗族自治县",
                        "num": "500242"
                    },
                    {
                        "value": "彭水苗族土家族自治县",
                        "label": "彭水苗族土家族自治县",
                        "num": "500243"
                    }
                ]
            }
        ]
    },
    {
        "value": "四川省",
        "label": "四川省",
        "num": "510000",
        "children": [{
                "value": "成都市",
                "label": "成都市",
                "num": "510100",
                "children": [{
                        "value": "锦江区",
                        "label": "锦江区",
                        "num": "510104"
                    },
                    {
                        "value": "青羊区",
                        "label": "青羊区",
                        "num": "510105"
                    },
                    {
                        "value": "金牛区",
                        "label": "金牛区",
                        "num": "510106"
                    },
                    {
                        "value": "武侯区",
                        "label": "武侯区",
                        "num": "510107"
                    },
                    {
                        "value": "成华区",
                        "label": "成华区",
                        "num": "510108"
                    },
                    {
                        "value": "龙泉驿区",
                        "label": "龙泉驿区",
                        "num": "510112"
                    },
                    {
                        "value": "青白江区",
                        "label": "青白江区",
                        "num": "510113"
                    },
                    {
                        "value": "新都区",
                        "label": "新都区",
                        "num": "510114"
                    },
                    {
                        "value": "温江区",
                        "label": "温江区",
                        "num": "510115"
                    },
                    {
                        "value": "双流区",
                        "label": "双流区",
                        "num": "510116"
                    },
                    {
                        "value": "郫都区",
                        "label": "郫都区",
                        "num": "510117"
                    },
                    {
                        "value": "金堂县",
                        "label": "金堂县",
                        "num": "510121"
                    },
                    {
                        "value": "大邑县",
                        "label": "大邑县",
                        "num": "510129"
                    },
                    {
                        "value": "蒲江县",
                        "label": "蒲江县",
                        "num": "510131"
                    },
                    {
                        "value": "新津县",
                        "label": "新津县",
                        "num": "510132"
                    },
                    {
                        "value": "都江堰市",
                        "label": "都江堰市",
                        "num": "510181"
                    },
                    {
                        "value": "彭州市",
                        "label": "彭州市",
                        "num": "510182"
                    },
                    {
                        "value": "邛崃市",
                        "label": "邛崃市",
                        "num": "510183"
                    },
                    {
                        "value": "崇州市",
                        "label": "崇州市",
                        "num": "510184"
                    },
                    {
                        "value": "简阳市",
                        "label": "简阳市",
                        "num": "510185"
                    },
                    {
                        "value": "高新区",
                        "label": "高新区",
                        "num": "510191"
                    }
                ]
            },
            {
                "value": "自贡市",
                "label": "自贡市",
                "num": "510300",
                "children": [{
                        "value": "自流井区",
                        "label": "自流井区",
                        "num": "510302"
                    },
                    {
                        "value": "贡井区",
                        "label": "贡井区",
                        "num": "510303"
                    },
                    {
                        "value": "大安区",
                        "label": "大安区",
                        "num": "510304"
                    },
                    {
                        "value": "沿滩区",
                        "label": "沿滩区",
                        "num": "510311"
                    },
                    {
                        "value": "荣县",
                        "label": "荣县",
                        "num": "510321"
                    },
                    {
                        "value": "富顺县",
                        "label": "富顺县",
                        "num": "510322"
                    }
                ]
            },
            {
                "value": "攀枝花市",
                "label": "攀枝花市",
                "num": "510400",
                "children": [{
                        "value": "东区",
                        "label": "东区",
                        "num": "510402"
                    },
                    {
                        "value": "西区",
                        "label": "西区",
                        "num": "510403"
                    },
                    {
                        "value": "仁和区",
                        "label": "仁和区",
                        "num": "510411"
                    },
                    {
                        "value": "米易县",
                        "label": "米易县",
                        "num": "510421"
                    },
                    {
                        "value": "盐边县",
                        "label": "盐边县",
                        "num": "510422"
                    }
                ]
            },
            {
                "value": "泸州市",
                "label": "泸州市",
                "num": "510500",
                "children": [{
                        "value": "江阳区",
                        "label": "江阳区",
                        "num": "510502"
                    },
                    {
                        "value": "纳溪区",
                        "label": "纳溪区",
                        "num": "510503"
                    },
                    {
                        "value": "龙马潭区",
                        "label": "龙马潭区",
                        "num": "510504"
                    },
                    {
                        "value": "泸县",
                        "label": "泸县",
                        "num": "510521"
                    },
                    {
                        "value": "合江县",
                        "label": "合江县",
                        "num": "510522"
                    },
                    {
                        "value": "叙永县",
                        "label": "叙永县",
                        "num": "510524"
                    },
                    {
                        "value": "古蔺县",
                        "label": "古蔺县",
                        "num": "510525"
                    }
                ]
            },
            {
                "value": "德阳市",
                "label": "德阳市",
                "num": "510600",
                "children": [{
                        "value": "旌阳区",
                        "label": "旌阳区",
                        "num": "510603"
                    },
                    {
                        "value": "罗江区",
                        "label": "罗江区",
                        "num": "510604"
                    },
                    {
                        "value": "中江县",
                        "label": "中江县",
                        "num": "510623"
                    },
                    {
                        "value": "广汉市",
                        "label": "广汉市",
                        "num": "510681"
                    },
                    {
                        "value": "什邡市",
                        "label": "什邡市",
                        "num": "510682"
                    },
                    {
                        "value": "绵竹市",
                        "label": "绵竹市",
                        "num": "510683"
                    }
                ]
            },
            {
                "value": "绵阳市",
                "label": "绵阳市",
                "num": "510700",
                "children": [{
                        "value": "涪城区",
                        "label": "涪城区",
                        "num": "510703"
                    },
                    {
                        "value": "游仙区",
                        "label": "游仙区",
                        "num": "510704"
                    },
                    {
                        "value": "安州区",
                        "label": "安州区",
                        "num": "510705"
                    },
                    {
                        "value": "三台县",
                        "label": "三台县",
                        "num": "510722"
                    },
                    {
                        "value": "盐亭县",
                        "label": "盐亭县",
                        "num": "510723"
                    },
                    {
                        "value": "梓潼县",
                        "label": "梓潼县",
                        "num": "510725"
                    },
                    {
                        "value": "北川羌族自治县",
                        "label": "北川羌族自治县",
                        "num": "510726"
                    },
                    {
                        "value": "平武县",
                        "label": "平武县",
                        "num": "510727"
                    },
                    {
                        "value": "江油市",
                        "label": "江油市",
                        "num": "510781"
                    },
                    {
                        "value": "高新区",
                        "label": "高新区",
                        "num": "510791"
                    }
                ]
            },
            {
                "value": "广元市",
                "label": "广元市",
                "num": "510800",
                "children": [{
                        "value": "利州区",
                        "label": "利州区",
                        "num": "510802"
                    },
                    {
                        "value": "昭化区",
                        "label": "昭化区",
                        "num": "510811"
                    },
                    {
                        "value": "朝天区",
                        "label": "朝天区",
                        "num": "510812"
                    },
                    {
                        "value": "旺苍县",
                        "label": "旺苍县",
                        "num": "510821"
                    },
                    {
                        "value": "青川县",
                        "label": "青川县",
                        "num": "510822"
                    },
                    {
                        "value": "剑阁县",
                        "label": "剑阁县",
                        "num": "510823"
                    },
                    {
                        "value": "苍溪县",
                        "label": "苍溪县",
                        "num": "510824"
                    }
                ]
            },
            {
                "value": "遂宁市",
                "label": "遂宁市",
                "num": "510900",
                "children": [{
                        "value": "船山区",
                        "label": "船山区",
                        "num": "510903"
                    },
                    {
                        "value": "安居区",
                        "label": "安居区",
                        "num": "510904"
                    },
                    {
                        "value": "蓬溪县",
                        "label": "蓬溪县",
                        "num": "510921"
                    },
                    {
                        "value": "射洪县",
                        "label": "射洪县",
                        "num": "510922"
                    },
                    {
                        "value": "大英县",
                        "label": "大英县",
                        "num": "510923"
                    }
                ]
            },
            {
                "value": "内江市",
                "label": "内江市",
                "num": "511000",
                "children": [{
                        "value": "市中区",
                        "label": "市中区",
                        "num": "511002"
                    },
                    {
                        "value": "东兴区",
                        "label": "东兴区",
                        "num": "511011"
                    },
                    {
                        "value": "威远县",
                        "label": "威远县",
                        "num": "511024"
                    },
                    {
                        "value": "资中县",
                        "label": "资中县",
                        "num": "511025"
                    },
                    {
                        "value": "隆昌市",
                        "label": "隆昌市",
                        "num": "511083"
                    }
                ]
            },
            {
                "value": "乐山市",
                "label": "乐山市",
                "num": "511100",
                "children": [{
                        "value": "市中区",
                        "label": "市中区",
                        "num": "511102"
                    },
                    {
                        "value": "沙湾区",
                        "label": "沙湾区",
                        "num": "511111"
                    },
                    {
                        "value": "五通桥区",
                        "label": "五通桥区",
                        "num": "511112"
                    },
                    {
                        "value": "金口河区",
                        "label": "金口河区",
                        "num": "511113"
                    },
                    {
                        "value": "犍为县",
                        "label": "犍为县",
                        "num": "511123"
                    },
                    {
                        "value": "井研县",
                        "label": "井研县",
                        "num": "511124"
                    },
                    {
                        "value": "夹江县",
                        "label": "夹江县",
                        "num": "511126"
                    },
                    {
                        "value": "沐川县",
                        "label": "沐川县",
                        "num": "511129"
                    },
                    {
                        "value": "峨边彝族自治县",
                        "label": "峨边彝族自治县",
                        "num": "511132"
                    },
                    {
                        "value": "马边彝族自治县",
                        "label": "马边彝族自治县",
                        "num": "511133"
                    },
                    {
                        "value": "峨眉山市",
                        "label": "峨眉山市",
                        "num": "511181"
                    }
                ]
            },
            {
                "value": "南充市",
                "label": "南充市",
                "num": "511300",
                "children": [{
                        "value": "顺庆区",
                        "label": "顺庆区",
                        "num": "511302"
                    },
                    {
                        "value": "高坪区",
                        "label": "高坪区",
                        "num": "511303"
                    },
                    {
                        "value": "嘉陵区",
                        "label": "嘉陵区",
                        "num": "511304"
                    },
                    {
                        "value": "南部县",
                        "label": "南部县",
                        "num": "511321"
                    },
                    {
                        "value": "营山县",
                        "label": "营山县",
                        "num": "511322"
                    },
                    {
                        "value": "蓬安县",
                        "label": "蓬安县",
                        "num": "511323"
                    },
                    {
                        "value": "仪陇县",
                        "label": "仪陇县",
                        "num": "511324"
                    },
                    {
                        "value": "西充县",
                        "label": "西充县",
                        "num": "511325"
                    },
                    {
                        "value": "阆中市",
                        "label": "阆中市",
                        "num": "511381"
                    }
                ]
            },
            {
                "value": "眉山市",
                "label": "眉山市",
                "num": "511400",
                "children": [{
                        "value": "东坡区",
                        "label": "东坡区",
                        "num": "511402"
                    },
                    {
                        "value": "彭山区",
                        "label": "彭山区",
                        "num": "511403"
                    },
                    {
                        "value": "仁寿县",
                        "label": "仁寿县",
                        "num": "511421"
                    },
                    {
                        "value": "洪雅县",
                        "label": "洪雅县",
                        "num": "511423"
                    },
                    {
                        "value": "丹棱县",
                        "label": "丹棱县",
                        "num": "511424"
                    },
                    {
                        "value": "青神县",
                        "label": "青神县",
                        "num": "511425"
                    }
                ]
            },
            {
                "value": "宜宾市",
                "label": "宜宾市",
                "num": "511500",
                "children": [{
                        "value": "翠屏区",
                        "label": "翠屏区",
                        "num": "511502"
                    },
                    {
                        "value": "南溪区",
                        "label": "南溪区",
                        "num": "511503"
                    },
                    {
                        "value": "叙州区",
                        "label": "叙州区",
                        "num": "511504"
                    },
                    {
                        "value": "江安县",
                        "label": "江安县",
                        "num": "511523"
                    },
                    {
                        "value": "长宁县",
                        "label": "长宁县",
                        "num": "511524"
                    },
                    {
                        "value": "高县",
                        "label": "高县",
                        "num": "511525"
                    },
                    {
                        "value": "珙县",
                        "label": "珙县",
                        "num": "511526"
                    },
                    {
                        "value": "筠连县",
                        "label": "筠连县",
                        "num": "511527"
                    },
                    {
                        "value": "兴文县",
                        "label": "兴文县",
                        "num": "511528"
                    },
                    {
                        "value": "屏山县",
                        "label": "屏山县",
                        "num": "511529"
                    }
                ]
            },
            {
                "value": "广安市",
                "label": "广安市",
                "num": "511600",
                "children": [{
                        "value": "广安区",
                        "label": "广安区",
                        "num": "511602"
                    },
                    {
                        "value": "前锋区",
                        "label": "前锋区",
                        "num": "511603"
                    },
                    {
                        "value": "岳池县",
                        "label": "岳池县",
                        "num": "511621"
                    },
                    {
                        "value": "武胜县",
                        "label": "武胜县",
                        "num": "511622"
                    },
                    {
                        "value": "邻水县",
                        "label": "邻水县",
                        "num": "511623"
                    },
                    {
                        "value": "华蓥市",
                        "label": "华蓥市",
                        "num": "511681"
                    }
                ]
            },
            {
                "value": "达州市",
                "label": "达州市",
                "num": "511700",
                "children": [{
                        "value": "通川区",
                        "label": "通川区",
                        "num": "511702"
                    },
                    {
                        "value": "达川区",
                        "label": "达川区",
                        "num": "511703"
                    },
                    {
                        "value": "宣汉县",
                        "label": "宣汉县",
                        "num": "511722"
                    },
                    {
                        "value": "开江县",
                        "label": "开江县",
                        "num": "511723"
                    },
                    {
                        "value": "大竹县",
                        "label": "大竹县",
                        "num": "511724"
                    },
                    {
                        "value": "渠县",
                        "label": "渠县",
                        "num": "511725"
                    },
                    {
                        "value": "万源市",
                        "label": "万源市",
                        "num": "511781"
                    }
                ]
            },
            {
                "value": "雅安市",
                "label": "雅安市",
                "num": "511800",
                "children": [{
                        "value": "雨城区",
                        "label": "雨城区",
                        "num": "511802"
                    },
                    {
                        "value": "名山区",
                        "label": "名山区",
                        "num": "511803"
                    },
                    {
                        "value": "荥经县",
                        "label": "荥经县",
                        "num": "511822"
                    },
                    {
                        "value": "汉源县",
                        "label": "汉源县",
                        "num": "511823"
                    },
                    {
                        "value": "石棉县",
                        "label": "石棉县",
                        "num": "511824"
                    },
                    {
                        "value": "天全县",
                        "label": "天全县",
                        "num": "511825"
                    },
                    {
                        "value": "芦山县",
                        "label": "芦山县",
                        "num": "511826"
                    },
                    {
                        "value": "宝兴县",
                        "label": "宝兴县",
                        "num": "511827"
                    }
                ]
            },
            {
                "value": "巴中市",
                "label": "巴中市",
                "num": "511900",
                "children": [{
                        "value": "巴州区",
                        "label": "巴州区",
                        "num": "511902"
                    },
                    {
                        "value": "恩阳区",
                        "label": "恩阳区",
                        "num": "511903"
                    },
                    {
                        "value": "通江县",
                        "label": "通江县",
                        "num": "511921"
                    },
                    {
                        "value": "南江县",
                        "label": "南江县",
                        "num": "511922"
                    },
                    {
                        "value": "平昌县",
                        "label": "平昌县",
                        "num": "511923"
                    }
                ]
            },
            {
                "value": "资阳市",
                "label": "资阳市",
                "num": "512000",
                "children": [{
                        "value": "雁江区",
                        "label": "雁江区",
                        "num": "512002"
                    },
                    {
                        "value": "安岳县",
                        "label": "安岳县",
                        "num": "512021"
                    },
                    {
                        "value": "乐至县",
                        "label": "乐至县",
                        "num": "512022"
                    }
                ]
            },
            {
                "value": "阿坝藏族羌族自治州",
                "label": "阿坝藏族羌族自治州",
                "num": "513200",
                "children": [{
                        "value": "马尔康市",
                        "label": "马尔康市",
                        "num": "513201"
                    },
                    {
                        "value": "汶川县",
                        "label": "汶川县",
                        "num": "513221"
                    },
                    {
                        "value": "理县",
                        "label": "理县",
                        "num": "513222"
                    },
                    {
                        "value": "茂县",
                        "label": "茂县",
                        "num": "513223"
                    },
                    {
                        "value": "松潘县",
                        "label": "松潘县",
                        "num": "513224"
                    },
                    {
                        "value": "九寨沟县",
                        "label": "九寨沟县",
                        "num": "513225"
                    },
                    {
                        "value": "金川县",
                        "label": "金川县",
                        "num": "513226"
                    },
                    {
                        "value": "小金县",
                        "label": "小金县",
                        "num": "513227"
                    },
                    {
                        "value": "黑水县",
                        "label": "黑水县",
                        "num": "513228"
                    },
                    {
                        "value": "壤塘县",
                        "label": "壤塘县",
                        "num": "513230"
                    },
                    {
                        "value": "阿坝县",
                        "label": "阿坝县",
                        "num": "513231"
                    },
                    {
                        "value": "若尔盖县",
                        "label": "若尔盖县",
                        "num": "513232"
                    },
                    {
                        "value": "红原县",
                        "label": "红原县",
                        "num": "513233"
                    }
                ]
            },
            {
                "value": "甘孜藏族自治州",
                "label": "甘孜藏族自治州",
                "num": "513300",
                "children": [{
                        "value": "康定市",
                        "label": "康定市",
                        "num": "513301"
                    },
                    {
                        "value": "泸定县",
                        "label": "泸定县",
                        "num": "513322"
                    },
                    {
                        "value": "丹巴县",
                        "label": "丹巴县",
                        "num": "513323"
                    },
                    {
                        "value": "九龙县",
                        "label": "九龙县",
                        "num": "513324"
                    },
                    {
                        "value": "雅江县",
                        "label": "雅江县",
                        "num": "513325"
                    },
                    {
                        "value": "道孚县",
                        "label": "道孚县",
                        "num": "513326"
                    },
                    {
                        "value": "炉霍县",
                        "label": "炉霍县",
                        "num": "513327"
                    },
                    {
                        "value": "甘孜县",
                        "label": "甘孜县",
                        "num": "513328"
                    },
                    {
                        "value": "新龙县",
                        "label": "新龙县",
                        "num": "513329"
                    },
                    {
                        "value": "德格县",
                        "label": "德格县",
                        "num": "513330"
                    },
                    {
                        "value": "白玉县",
                        "label": "白玉县",
                        "num": "513331"
                    },
                    {
                        "value": "石渠县",
                        "label": "石渠县",
                        "num": "513332"
                    },
                    {
                        "value": "色达县",
                        "label": "色达县",
                        "num": "513333"
                    },
                    {
                        "value": "理塘县",
                        "label": "理塘县",
                        "num": "513334"
                    },
                    {
                        "value": "巴塘县",
                        "label": "巴塘县",
                        "num": "513335"
                    },
                    {
                        "value": "乡城县",
                        "label": "乡城县",
                        "num": "513336"
                    },
                    {
                        "value": "稻城县",
                        "label": "稻城县",
                        "num": "513337"
                    },
                    {
                        "value": "得荣县",
                        "label": "得荣县",
                        "num": "513338"
                    }
                ]
            },
            {
                "value": "凉山彝族自治州",
                "label": "凉山彝族自治州",
                "num": "513400",
                "children": [{
                        "value": "西昌市",
                        "label": "西昌市",
                        "num": "513401"
                    },
                    {
                        "value": "木里藏族自治县",
                        "label": "木里藏族自治县",
                        "num": "513422"
                    },
                    {
                        "value": "盐源县",
                        "label": "盐源县",
                        "num": "513423"
                    },
                    {
                        "value": "德昌县",
                        "label": "德昌县",
                        "num": "513424"
                    },
                    {
                        "value": "会理县",
                        "label": "会理县",
                        "num": "513425"
                    },
                    {
                        "value": "会东县",
                        "label": "会东县",
                        "num": "513426"
                    },
                    {
                        "value": "宁南县",
                        "label": "宁南县",
                        "num": "513427"
                    },
                    {
                        "value": "普格县",
                        "label": "普格县",
                        "num": "513428"
                    },
                    {
                        "value": "布拖县",
                        "label": "布拖县",
                        "num": "513429"
                    },
                    {
                        "value": "金阳县",
                        "label": "金阳县",
                        "num": "513430"
                    },
                    {
                        "value": "昭觉县",
                        "label": "昭觉县",
                        "num": "513431"
                    },
                    {
                        "value": "喜德县",
                        "label": "喜德县",
                        "num": "513432"
                    },
                    {
                        "value": "冕宁县",
                        "label": "冕宁县",
                        "num": "513433"
                    },
                    {
                        "value": "越西县",
                        "label": "越西县",
                        "num": "513434"
                    },
                    {
                        "value": "甘洛县",
                        "label": "甘洛县",
                        "num": "513435"
                    },
                    {
                        "value": "美姑县",
                        "label": "美姑县",
                        "num": "513436"
                    },
                    {
                        "value": "雷波县",
                        "label": "雷波县",
                        "num": "513437"
                    }
                ]
            }
        ]
    },
    {
        "value": "贵州省",
        "label": "贵州省",
        "num": "520000",
        "children": [{
                "value": "贵阳市",
                "label": "贵阳市",
                "num": "520100",
                "children": [{
                        "value": "南明区",
                        "label": "南明区",
                        "num": "520102"
                    },
                    {
                        "value": "云岩区",
                        "label": "云岩区",
                        "num": "520103"
                    },
                    {
                        "value": "花溪区",
                        "label": "花溪区",
                        "num": "520111"
                    },
                    {
                        "value": "乌当区",
                        "label": "乌当区",
                        "num": "520112"
                    },
                    {
                        "value": "白云区",
                        "label": "白云区",
                        "num": "520113"
                    },
                    {
                        "value": "观山湖区",
                        "label": "观山湖区",
                        "num": "520115"
                    },
                    {
                        "value": "开阳县",
                        "label": "开阳县",
                        "num": "520121"
                    },
                    {
                        "value": "息烽县",
                        "label": "息烽县",
                        "num": "520122"
                    },
                    {
                        "value": "修文县",
                        "label": "修文县",
                        "num": "520123"
                    },
                    {
                        "value": "清镇市",
                        "label": "清镇市",
                        "num": "520181"
                    }
                ]
            },
            {
                "value": "六盘水市",
                "label": "六盘水市",
                "num": "520200",
                "children": [{
                        "value": "钟山区",
                        "label": "钟山区",
                        "num": "520201"
                    },
                    {
                        "value": "六枝特区",
                        "label": "六枝特区",
                        "num": "520203"
                    },
                    {
                        "value": "水城县",
                        "label": "水城县",
                        "num": "520221"
                    },
                    {
                        "value": "盘州市",
                        "label": "盘州市",
                        "num": "520281"
                    }
                ]
            },
            {
                "value": "遵义市",
                "label": "遵义市",
                "num": "520300",
                "children": [{
                        "value": "红花岗区",
                        "label": "红花岗区",
                        "num": "520302"
                    },
                    {
                        "value": "汇川区",
                        "label": "汇川区",
                        "num": "520303"
                    },
                    {
                        "value": "播州区",
                        "label": "播州区",
                        "num": "520304"
                    },
                    {
                        "value": "桐梓县",
                        "label": "桐梓县",
                        "num": "520322"
                    },
                    {
                        "value": "绥阳县",
                        "label": "绥阳县",
                        "num": "520323"
                    },
                    {
                        "value": "正安县",
                        "label": "正安县",
                        "num": "520324"
                    },
                    {
                        "value": "道真仡佬族苗族自治县",
                        "label": "道真仡佬族苗族自治县",
                        "num": "520325"
                    },
                    {
                        "value": "务川仡佬族苗族自治县",
                        "label": "务川仡佬族苗族自治县",
                        "num": "520326"
                    },
                    {
                        "value": "凤冈县",
                        "label": "凤冈县",
                        "num": "520327"
                    },
                    {
                        "value": "湄潭县",
                        "label": "湄潭县",
                        "num": "520328"
                    },
                    {
                        "value": "余庆县",
                        "label": "余庆县",
                        "num": "520329"
                    },
                    {
                        "value": "习水县",
                        "label": "习水县",
                        "num": "520330"
                    },
                    {
                        "value": "赤水市",
                        "label": "赤水市",
                        "num": "520381"
                    },
                    {
                        "value": "仁怀市",
                        "label": "仁怀市",
                        "num": "520382"
                    }
                ]
            },
            {
                "value": "安顺市",
                "label": "安顺市",
                "num": "520400",
                "children": [{
                        "value": "西秀区",
                        "label": "西秀区",
                        "num": "520402"
                    },
                    {
                        "value": "平坝区",
                        "label": "平坝区",
                        "num": "520403"
                    },
                    {
                        "value": "普定县",
                        "label": "普定县",
                        "num": "520422"
                    },
                    {
                        "value": "镇宁布依族苗族自治县",
                        "label": "镇宁布依族苗族自治县",
                        "num": "520423"
                    },
                    {
                        "value": "关岭布依族苗族自治县",
                        "label": "关岭布依族苗族自治县",
                        "num": "520424"
                    },
                    {
                        "value": "紫云苗族布依族自治县",
                        "label": "紫云苗族布依族自治县",
                        "num": "520425"
                    }
                ]
            },
            {
                "value": "毕节市",
                "label": "毕节市",
                "num": "520500",
                "children": [{
                        "value": "七星关区",
                        "label": "七星关区",
                        "num": "520502"
                    },
                    {
                        "value": "大方县",
                        "label": "大方县",
                        "num": "520521"
                    },
                    {
                        "value": "黔西县",
                        "label": "黔西县",
                        "num": "520522"
                    },
                    {
                        "value": "金沙县",
                        "label": "金沙县",
                        "num": "520523"
                    },
                    {
                        "value": "织金县",
                        "label": "织金县",
                        "num": "520524"
                    },
                    {
                        "value": "纳雍县",
                        "label": "纳雍县",
                        "num": "520525"
                    },
                    {
                        "value": "威宁彝族回族苗族自治县",
                        "label": "威宁彝族回族苗族自治县",
                        "num": "520526"
                    },
                    {
                        "value": "赫章县",
                        "label": "赫章县",
                        "num": "520527"
                    }
                ]
            },
            {
                "value": "铜仁市",
                "label": "铜仁市",
                "num": "520600",
                "children": [{
                        "value": "碧江区",
                        "label": "碧江区",
                        "num": "520602"
                    },
                    {
                        "value": "万山区",
                        "label": "万山区",
                        "num": "520603"
                    },
                    {
                        "value": "江口县",
                        "label": "江口县",
                        "num": "520621"
                    },
                    {
                        "value": "玉屏侗族自治县",
                        "label": "玉屏侗族自治县",
                        "num": "520622"
                    },
                    {
                        "value": "石阡县",
                        "label": "石阡县",
                        "num": "520623"
                    },
                    {
                        "value": "思南县",
                        "label": "思南县",
                        "num": "520624"
                    },
                    {
                        "value": "印江土家族苗族自治县",
                        "label": "印江土家族苗族自治县",
                        "num": "520625"
                    },
                    {
                        "value": "德江县",
                        "label": "德江县",
                        "num": "520626"
                    },
                    {
                        "value": "沿河土家族自治县",
                        "label": "沿河土家族自治县",
                        "num": "520627"
                    },
                    {
                        "value": "松桃苗族自治县",
                        "label": "松桃苗族自治县",
                        "num": "520628"
                    }
                ]
            },
            {
                "value": "黔西南布依族苗族自治州",
                "label": "黔西南布依族苗族自治州",
                "num": "522300",
                "children": [{
                        "value": "兴义市",
                        "label": "兴义市",
                        "num": "522301"
                    },
                    {
                        "value": "兴仁市",
                        "label": "兴仁市",
                        "num": "522302"
                    },
                    {
                        "value": "普安县",
                        "label": "普安县",
                        "num": "522323"
                    },
                    {
                        "value": "晴隆县",
                        "label": "晴隆县",
                        "num": "522324"
                    },
                    {
                        "value": "贞丰县",
                        "label": "贞丰县",
                        "num": "522325"
                    },
                    {
                        "value": "望谟县",
                        "label": "望谟县",
                        "num": "522326"
                    },
                    {
                        "value": "册亨县",
                        "label": "册亨县",
                        "num": "522327"
                    },
                    {
                        "value": "安龙县",
                        "label": "安龙县",
                        "num": "522328"
                    }
                ]
            },
            {
                "value": "黔东南苗族侗族自治州",
                "label": "黔东南苗族侗族自治州",
                "num": "522600",
                "children": [{
                        "value": "凯里市",
                        "label": "凯里市",
                        "num": "522601"
                    },
                    {
                        "value": "黄平县",
                        "label": "黄平县",
                        "num": "522622"
                    },
                    {
                        "value": "施秉县",
                        "label": "施秉县",
                        "num": "522623"
                    },
                    {
                        "value": "三穗县",
                        "label": "三穗县",
                        "num": "522624"
                    },
                    {
                        "value": "镇远县",
                        "label": "镇远县",
                        "num": "522625"
                    },
                    {
                        "value": "岑巩县",
                        "label": "岑巩县",
                        "num": "522626"
                    },
                    {
                        "value": "天柱县",
                        "label": "天柱县",
                        "num": "522627"
                    },
                    {
                        "value": "锦屏县",
                        "label": "锦屏县",
                        "num": "522628"
                    },
                    {
                        "value": "剑河县",
                        "label": "剑河县",
                        "num": "522629"
                    },
                    {
                        "value": "台江县",
                        "label": "台江县",
                        "num": "522630"
                    },
                    {
                        "value": "黎平县",
                        "label": "黎平县",
                        "num": "522631"
                    },
                    {
                        "value": "榕江县",
                        "label": "榕江县",
                        "num": "522632"
                    },
                    {
                        "value": "从江县",
                        "label": "从江县",
                        "num": "522633"
                    },
                    {
                        "value": "雷山县",
                        "label": "雷山县",
                        "num": "522634"
                    },
                    {
                        "value": "麻江县",
                        "label": "麻江县",
                        "num": "522635"
                    },
                    {
                        "value": "丹寨县",
                        "label": "丹寨县",
                        "num": "522636"
                    }
                ]
            },
            {
                "value": "黔南布依族苗族自治州",
                "label": "黔南布依族苗族自治州",
                "num": "522700",
                "children": [{
                        "value": "都匀市",
                        "label": "都匀市",
                        "num": "522701"
                    },
                    {
                        "value": "福泉市",
                        "label": "福泉市",
                        "num": "522702"
                    },
                    {
                        "value": "荔波县",
                        "label": "荔波县",
                        "num": "522722"
                    },
                    {
                        "value": "贵定县",
                        "label": "贵定县",
                        "num": "522723"
                    },
                    {
                        "value": "瓮安县",
                        "label": "瓮安县",
                        "num": "522725"
                    },
                    {
                        "value": "独山县",
                        "label": "独山县",
                        "num": "522726"
                    },
                    {
                        "value": "平塘县",
                        "label": "平塘县",
                        "num": "522727"
                    },
                    {
                        "value": "罗甸县",
                        "label": "罗甸县",
                        "num": "522728"
                    },
                    {
                        "value": "长顺县",
                        "label": "长顺县",
                        "num": "522729"
                    },
                    {
                        "value": "龙里县",
                        "label": "龙里县",
                        "num": "522730"
                    },
                    {
                        "value": "惠水县",
                        "label": "惠水县",
                        "num": "522731"
                    },
                    {
                        "value": "三都水族自治县",
                        "label": "三都水族自治县",
                        "num": "522732"
                    }
                ]
            }
        ]
    },
    {
        "value": "云南省",
        "label": "云南省",
        "num": "530000",
        "children": [{
                "value": "昆明市",
                "label": "昆明市",
                "num": "530100",
                "children": [{
                        "value": "五华区",
                        "label": "五华区",
                        "num": "530102"
                    },
                    {
                        "value": "盘龙区",
                        "label": "盘龙区",
                        "num": "530103"
                    },
                    {
                        "value": "官渡区",
                        "label": "官渡区",
                        "num": "530111"
                    },
                    {
                        "value": "西山区",
                        "label": "西山区",
                        "num": "530112"
                    },
                    {
                        "value": "东川区",
                        "label": "东川区",
                        "num": "530113"
                    },
                    {
                        "value": "呈贡区",
                        "label": "呈贡区",
                        "num": "530114"
                    },
                    {
                        "value": "晋宁区",
                        "label": "晋宁区",
                        "num": "530115"
                    },
                    {
                        "value": "富民县",
                        "label": "富民县",
                        "num": "530124"
                    },
                    {
                        "value": "宜良县",
                        "label": "宜良县",
                        "num": "530125"
                    },
                    {
                        "value": "石林彝族自治县",
                        "label": "石林彝族自治县",
                        "num": "530126"
                    },
                    {
                        "value": "嵩明县",
                        "label": "嵩明县",
                        "num": "530127"
                    },
                    {
                        "value": "禄劝彝族苗族自治县",
                        "label": "禄劝彝族苗族自治县",
                        "num": "530128"
                    },
                    {
                        "value": "寻甸回族彝族自治县",
                        "label": "寻甸回族彝族自治县",
                        "num": "530129"
                    },
                    {
                        "value": "安宁市",
                        "label": "安宁市",
                        "num": "530181"
                    }
                ]
            },
            {
                "value": "曲靖市",
                "label": "曲靖市",
                "num": "530300",
                "children": [{
                        "value": "麒麟区",
                        "label": "麒麟区",
                        "num": "530302"
                    },
                    {
                        "value": "沾益区",
                        "label": "沾益区",
                        "num": "530303"
                    },
                    {
                        "value": "马龙区",
                        "label": "马龙区",
                        "num": "530304"
                    },
                    {
                        "value": "陆良县",
                        "label": "陆良县",
                        "num": "530322"
                    },
                    {
                        "value": "师宗县",
                        "label": "师宗县",
                        "num": "530323"
                    },
                    {
                        "value": "罗平县",
                        "label": "罗平县",
                        "num": "530324"
                    },
                    {
                        "value": "富源县",
                        "label": "富源县",
                        "num": "530325"
                    },
                    {
                        "value": "会泽县",
                        "label": "会泽县",
                        "num": "530326"
                    },
                    {
                        "value": "宣威市",
                        "label": "宣威市",
                        "num": "530381"
                    }
                ]
            },
            {
                "value": "玉溪市",
                "label": "玉溪市",
                "num": "530400",
                "children": [{
                        "value": "红塔区",
                        "label": "红塔区",
                        "num": "530402"
                    },
                    {
                        "value": "江川区",
                        "label": "江川区",
                        "num": "530403"
                    },
                    {
                        "value": "澄江县",
                        "label": "澄江县",
                        "num": "530422"
                    },
                    {
                        "value": "通海县",
                        "label": "通海县",
                        "num": "530423"
                    },
                    {
                        "value": "华宁县",
                        "label": "华宁县",
                        "num": "530424"
                    },
                    {
                        "value": "易门县",
                        "label": "易门县",
                        "num": "530425"
                    },
                    {
                        "value": "峨山彝族自治县",
                        "label": "峨山彝族自治县",
                        "num": "530426"
                    },
                    {
                        "value": "新平彝族傣族自治县",
                        "label": "新平彝族傣族自治县",
                        "num": "530427"
                    },
                    {
                        "value": "元江哈尼族彝族傣族自治县",
                        "label": "元江哈尼族彝族傣族自治县",
                        "num": "530428"
                    }
                ]
            },
            {
                "value": "保山市",
                "label": "保山市",
                "num": "530500",
                "children": [{
                        "value": "隆阳区",
                        "label": "隆阳区",
                        "num": "530502"
                    },
                    {
                        "value": "施甸县",
                        "label": "施甸县",
                        "num": "530521"
                    },
                    {
                        "value": "龙陵县",
                        "label": "龙陵县",
                        "num": "530523"
                    },
                    {
                        "value": "昌宁县",
                        "label": "昌宁县",
                        "num": "530524"
                    },
                    {
                        "value": "腾冲市",
                        "label": "腾冲市",
                        "num": "530581"
                    }
                ]
            },
            {
                "value": "昭通市",
                "label": "昭通市",
                "num": "530600",
                "children": [{
                        "value": "昭阳区",
                        "label": "昭阳区",
                        "num": "530602"
                    },
                    {
                        "value": "鲁甸县",
                        "label": "鲁甸县",
                        "num": "530621"
                    },
                    {
                        "value": "巧家县",
                        "label": "巧家县",
                        "num": "530622"
                    },
                    {
                        "value": "盐津县",
                        "label": "盐津县",
                        "num": "530623"
                    },
                    {
                        "value": "大关县",
                        "label": "大关县",
                        "num": "530624"
                    },
                    {
                        "value": "永善县",
                        "label": "永善县",
                        "num": "530625"
                    },
                    {
                        "value": "绥江县",
                        "label": "绥江县",
                        "num": "530626"
                    },
                    {
                        "value": "镇雄县",
                        "label": "镇雄县",
                        "num": "530627"
                    },
                    {
                        "value": "彝良县",
                        "label": "彝良县",
                        "num": "530628"
                    },
                    {
                        "value": "威信县",
                        "label": "威信县",
                        "num": "530629"
                    },
                    {
                        "value": "水富市",
                        "label": "水富市",
                        "num": "530681"
                    }
                ]
            },
            {
                "value": "丽江市",
                "label": "丽江市",
                "num": "530700",
                "children": [{
                        "value": "古城区",
                        "label": "古城区",
                        "num": "530702"
                    },
                    {
                        "value": "玉龙纳西族自治县",
                        "label": "玉龙纳西族自治县",
                        "num": "530721"
                    },
                    {
                        "value": "永胜县",
                        "label": "永胜县",
                        "num": "530722"
                    },
                    {
                        "value": "华坪县",
                        "label": "华坪县",
                        "num": "530723"
                    },
                    {
                        "value": "宁蒗彝族自治县",
                        "label": "宁蒗彝族自治县",
                        "num": "530724"
                    }
                ]
            },
            {
                "value": "普洱市",
                "label": "普洱市",
                "num": "530800",
                "children": [{
                        "value": "思茅区",
                        "label": "思茅区",
                        "num": "530802"
                    },
                    {
                        "value": "宁洱哈尼族彝族自治县",
                        "label": "宁洱哈尼族彝族自治县",
                        "num": "530821"
                    },
                    {
                        "value": "墨江哈尼族自治县",
                        "label": "墨江哈尼族自治县",
                        "num": "530822"
                    },
                    {
                        "value": "景东彝族自治县",
                        "label": "景东彝族自治县",
                        "num": "530823"
                    },
                    {
                        "value": "景谷傣族彝族自治县",
                        "label": "景谷傣族彝族自治县",
                        "num": "530824"
                    },
                    {
                        "value": "镇沅彝族哈尼族拉祜族自治县",
                        "label": "镇沅彝族哈尼族拉祜族自治县",
                        "num": "530825"
                    },
                    {
                        "value": "江城哈尼族彝族自治县",
                        "label": "江城哈尼族彝族自治县",
                        "num": "530826"
                    },
                    {
                        "value": "孟连傣族拉祜族佤族自治县",
                        "label": "孟连傣族拉祜族佤族自治县",
                        "num": "530827"
                    },
                    {
                        "value": "澜沧拉祜族自治县",
                        "label": "澜沧拉祜族自治县",
                        "num": "530828"
                    },
                    {
                        "value": "西盟佤族自治县",
                        "label": "西盟佤族自治县",
                        "num": "530829"
                    }
                ]
            },
            {
                "value": "临沧市",
                "label": "临沧市",
                "num": "530900",
                "children": [{
                        "value": "临翔区",
                        "label": "临翔区",
                        "num": "530902"
                    },
                    {
                        "value": "凤庆县",
                        "label": "凤庆县",
                        "num": "530921"
                    },
                    {
                        "value": "云县",
                        "label": "云县",
                        "num": "530922"
                    },
                    {
                        "value": "永德县",
                        "label": "永德县",
                        "num": "530923"
                    },
                    {
                        "value": "镇康县",
                        "label": "镇康县",
                        "num": "530924"
                    },
                    {
                        "value": "双江拉祜族佤族布朗族傣族自治县",
                        "label": "双江拉祜族佤族布朗族傣族自治县",
                        "num": "530925"
                    },
                    {
                        "value": "耿马傣族佤族自治县",
                        "label": "耿马傣族佤族自治县",
                        "num": "530926"
                    },
                    {
                        "value": "沧源佤族自治县",
                        "label": "沧源佤族自治县",
                        "num": "530927"
                    }
                ]
            },
            {
                "value": "楚雄彝族自治州",
                "label": "楚雄彝族自治州",
                "num": "532300",
                "children": [{
                        "value": "楚雄市",
                        "label": "楚雄市",
                        "num": "532301"
                    },
                    {
                        "value": "双柏县",
                        "label": "双柏县",
                        "num": "532322"
                    },
                    {
                        "value": "牟定县",
                        "label": "牟定县",
                        "num": "532323"
                    },
                    {
                        "value": "南华县",
                        "label": "南华县",
                        "num": "532324"
                    },
                    {
                        "value": "姚安县",
                        "label": "姚安县",
                        "num": "532325"
                    },
                    {
                        "value": "大姚县",
                        "label": "大姚县",
                        "num": "532326"
                    },
                    {
                        "value": "永仁县",
                        "label": "永仁县",
                        "num": "532327"
                    },
                    {
                        "value": "元谋县",
                        "label": "元谋县",
                        "num": "532328"
                    },
                    {
                        "value": "武定县",
                        "label": "武定县",
                        "num": "532329"
                    },
                    {
                        "value": "禄丰县",
                        "label": "禄丰县",
                        "num": "532331"
                    }
                ]
            },
            {
                "value": "红河哈尼族彝族自治州",
                "label": "红河哈尼族彝族自治州",
                "num": "532500",
                "children": [{
                        "value": "个旧市",
                        "label": "个旧市",
                        "num": "532501"
                    },
                    {
                        "value": "开远市",
                        "label": "开远市",
                        "num": "532502"
                    },
                    {
                        "value": "蒙自市",
                        "label": "蒙自市",
                        "num": "532503"
                    },
                    {
                        "value": "弥勒市",
                        "label": "弥勒市",
                        "num": "532504"
                    },
                    {
                        "value": "屏边苗族自治县",
                        "label": "屏边苗族自治县",
                        "num": "532523"
                    },
                    {
                        "value": "建水县",
                        "label": "建水县",
                        "num": "532524"
                    },
                    {
                        "value": "石屏县",
                        "label": "石屏县",
                        "num": "532525"
                    },
                    {
                        "value": "泸西县",
                        "label": "泸西县",
                        "num": "532527"
                    },
                    {
                        "value": "元阳县",
                        "label": "元阳县",
                        "num": "532528"
                    },
                    {
                        "value": "红河县",
                        "label": "红河县",
                        "num": "532529"
                    },
                    {
                        "value": "金平苗族瑶族傣族自治县",
                        "label": "金平苗族瑶族傣族自治县",
                        "num": "532530"
                    },
                    {
                        "value": "绿春县",
                        "label": "绿春县",
                        "num": "532531"
                    },
                    {
                        "value": "河口瑶族自治县",
                        "label": "河口瑶族自治县",
                        "num": "532532"
                    }
                ]
            },
            {
                "value": "文山壮族苗族自治州",
                "label": "文山壮族苗族自治州",
                "num": "532600",
                "children": [{
                        "value": "文山市",
                        "label": "文山市",
                        "num": "532601"
                    },
                    {
                        "value": "砚山县",
                        "label": "砚山县",
                        "num": "532622"
                    },
                    {
                        "value": "西畴县",
                        "label": "西畴县",
                        "num": "532623"
                    },
                    {
                        "value": "麻栗坡县",
                        "label": "麻栗坡县",
                        "num": "532624"
                    },
                    {
                        "value": "马关县",
                        "label": "马关县",
                        "num": "532625"
                    },
                    {
                        "value": "丘北县",
                        "label": "丘北县",
                        "num": "532626"
                    },
                    {
                        "value": "广南县",
                        "label": "广南县",
                        "num": "532627"
                    },
                    {
                        "value": "富宁县",
                        "label": "富宁县",
                        "num": "532628"
                    }
                ]
            },
            {
                "value": "西双版纳傣族自治州",
                "label": "西双版纳傣族自治州",
                "num": "532800",
                "children": [{
                        "value": "景洪市",
                        "label": "景洪市",
                        "num": "532801"
                    },
                    {
                        "value": "勐海县",
                        "label": "勐海县",
                        "num": "532822"
                    },
                    {
                        "value": "勐腊县",
                        "label": "勐腊县",
                        "num": "532823"
                    }
                ]
            },
            {
                "value": "大理白族自治州",
                "label": "大理白族自治州",
                "num": "532900",
                "children": [{
                        "value": "大理市",
                        "label": "大理市",
                        "num": "532901"
                    },
                    {
                        "value": "漾濞彝族自治县",
                        "label": "漾濞彝族自治县",
                        "num": "532922"
                    },
                    {
                        "value": "祥云县",
                        "label": "祥云县",
                        "num": "532923"
                    },
                    {
                        "value": "宾川县",
                        "label": "宾川县",
                        "num": "532924"
                    },
                    {
                        "value": "弥渡县",
                        "label": "弥渡县",
                        "num": "532925"
                    },
                    {
                        "value": "南涧彝族自治县",
                        "label": "南涧彝族自治县",
                        "num": "532926"
                    },
                    {
                        "value": "巍山彝族回族自治县",
                        "label": "巍山彝族回族自治县",
                        "num": "532927"
                    },
                    {
                        "value": "永平县",
                        "label": "永平县",
                        "num": "532928"
                    },
                    {
                        "value": "云龙县",
                        "label": "云龙县",
                        "num": "532929"
                    },
                    {
                        "value": "洱源县",
                        "label": "洱源县",
                        "num": "532930"
                    },
                    {
                        "value": "剑川县",
                        "label": "剑川县",
                        "num": "532931"
                    },
                    {
                        "value": "鹤庆县",
                        "label": "鹤庆县",
                        "num": "532932"
                    }
                ]
            },
            {
                "value": "德宏傣族景颇族自治州",
                "label": "德宏傣族景颇族自治州",
                "num": "533100",
                "children": [{
                        "value": "瑞丽市",
                        "label": "瑞丽市",
                        "num": "533102"
                    },
                    {
                        "value": "芒市",
                        "label": "芒市",
                        "num": "533103"
                    },
                    {
                        "value": "梁河县",
                        "label": "梁河县",
                        "num": "533122"
                    },
                    {
                        "value": "盈江县",
                        "label": "盈江县",
                        "num": "533123"
                    },
                    {
                        "value": "陇川县",
                        "label": "陇川县",
                        "num": "533124"
                    }
                ]
            },
            {
                "value": "怒江傈僳族自治州",
                "label": "怒江傈僳族自治州",
                "num": "533300",
                "children": [{
                        "value": "泸水市",
                        "label": "泸水市",
                        "num": "533301"
                    },
                    {
                        "value": "福贡县",
                        "label": "福贡县",
                        "num": "533323"
                    },
                    {
                        "value": "贡山独龙族怒族自治县",
                        "label": "贡山独龙族怒族自治县",
                        "num": "533324"
                    },
                    {
                        "value": "兰坪白族普米族自治县",
                        "label": "兰坪白族普米族自治县",
                        "num": "533325"
                    }
                ]
            },
            {
                "value": "迪庆藏族自治州",
                "label": "迪庆藏族自治州",
                "num": "533400",
                "children": [{
                        "value": "香格里拉市",
                        "label": "香格里拉市",
                        "num": "533401"
                    },
                    {
                        "value": "德钦县",
                        "label": "德钦县",
                        "num": "533422"
                    },
                    {
                        "value": "维西傈僳族自治县",
                        "label": "维西傈僳族自治县",
                        "num": "533423"
                    }
                ]
            }
        ]
    },
    {
        "value": "西藏自治区",
        "label": "西藏自治区",
        "num": "540000",
        "children": [{
                "value": "拉萨市",
                "label": "拉萨市",
                "num": "540100",
                "children": [{
                        "value": "城关区",
                        "label": "城关区",
                        "num": "540102"
                    },
                    {
                        "value": "堆龙德庆区",
                        "label": "堆龙德庆区",
                        "num": "540103"
                    },
                    {
                        "value": "达孜区",
                        "label": "达孜区",
                        "num": "540104"
                    },
                    {
                        "value": "林周县",
                        "label": "林周县",
                        "num": "540121"
                    },
                    {
                        "value": "当雄县",
                        "label": "当雄县",
                        "num": "540122"
                    },
                    {
                        "value": "尼木县",
                        "label": "尼木县",
                        "num": "540123"
                    },
                    {
                        "value": "曲水县",
                        "label": "曲水县",
                        "num": "540124"
                    },
                    {
                        "value": "墨竹工卡县",
                        "label": "墨竹工卡县",
                        "num": "540127"
                    }
                ]
            },
            {
                "value": "日喀则市",
                "label": "日喀则市",
                "num": "540200",
                "children": [{
                        "value": "桑珠孜区",
                        "label": "桑珠孜区",
                        "num": "540202"
                    },
                    {
                        "value": "南木林县",
                        "label": "南木林县",
                        "num": "540221"
                    },
                    {
                        "value": "江孜县",
                        "label": "江孜县",
                        "num": "540222"
                    },
                    {
                        "value": "定日县",
                        "label": "定日县",
                        "num": "540223"
                    },
                    {
                        "value": "萨迦县",
                        "label": "萨迦县",
                        "num": "540224"
                    },
                    {
                        "value": "拉孜县",
                        "label": "拉孜县",
                        "num": "540225"
                    },
                    {
                        "value": "昂仁县",
                        "label": "昂仁县",
                        "num": "540226"
                    },
                    {
                        "value": "谢通门县",
                        "label": "谢通门县",
                        "num": "540227"
                    },
                    {
                        "value": "白朗县",
                        "label": "白朗县",
                        "num": "540228"
                    },
                    {
                        "value": "仁布县",
                        "label": "仁布县",
                        "num": "540229"
                    },
                    {
                        "value": "康马县",
                        "label": "康马县",
                        "num": "540230"
                    },
                    {
                        "value": "定结县",
                        "label": "定结县",
                        "num": "540231"
                    },
                    {
                        "value": "仲巴县",
                        "label": "仲巴县",
                        "num": "540232"
                    },
                    {
                        "value": "亚东县",
                        "label": "亚东县",
                        "num": "540233"
                    },
                    {
                        "value": "吉隆县",
                        "label": "吉隆县",
                        "num": "540234"
                    },
                    {
                        "value": "聂拉木县",
                        "label": "聂拉木县",
                        "num": "540235"
                    },
                    {
                        "value": "萨嘎县",
                        "label": "萨嘎县",
                        "num": "540236"
                    },
                    {
                        "value": "岗巴县",
                        "label": "岗巴县",
                        "num": "540237"
                    }
                ]
            },
            {
                "value": "昌都市",
                "label": "昌都市",
                "num": "540300",
                "children": [{
                        "value": "卡若区",
                        "label": "卡若区",
                        "num": "540302"
                    },
                    {
                        "value": "江达县",
                        "label": "江达县",
                        "num": "540321"
                    },
                    {
                        "value": "贡觉县",
                        "label": "贡觉县",
                        "num": "540322"
                    },
                    {
                        "value": "类乌齐县",
                        "label": "类乌齐县",
                        "num": "540323"
                    },
                    {
                        "value": "丁青县",
                        "label": "丁青县",
                        "num": "540324"
                    },
                    {
                        "value": "察雅县",
                        "label": "察雅县",
                        "num": "540325"
                    },
                    {
                        "value": "八宿县",
                        "label": "八宿县",
                        "num": "540326"
                    },
                    {
                        "value": "左贡县",
                        "label": "左贡县",
                        "num": "540327"
                    },
                    {
                        "value": "芒康县",
                        "label": "芒康县",
                        "num": "540328"
                    },
                    {
                        "value": "洛隆县",
                        "label": "洛隆县",
                        "num": "540329"
                    },
                    {
                        "value": "边坝县",
                        "label": "边坝县",
                        "num": "540330"
                    }
                ]
            },
            {
                "value": "林芝市",
                "label": "林芝市",
                "num": "540400",
                "children": [{
                        "value": "巴宜区",
                        "label": "巴宜区",
                        "num": "540402"
                    },
                    {
                        "value": "工布江达县",
                        "label": "工布江达县",
                        "num": "540421"
                    },
                    {
                        "value": "米林县",
                        "label": "米林县",
                        "num": "540422"
                    },
                    {
                        "value": "墨脱县",
                        "label": "墨脱县",
                        "num": "540423"
                    },
                    {
                        "value": "波密县",
                        "label": "波密县",
                        "num": "540424"
                    },
                    {
                        "value": "察隅县",
                        "label": "察隅县",
                        "num": "540425"
                    },
                    {
                        "value": "朗县",
                        "label": "朗县",
                        "num": "540426"
                    }
                ]
            },
            {
                "value": "山南市",
                "label": "山南市",
                "num": "540500",
                "children": [{
                        "value": "乃东区",
                        "label": "乃东区",
                        "num": "540502"
                    },
                    {
                        "value": "扎囊县",
                        "label": "扎囊县",
                        "num": "540521"
                    },
                    {
                        "value": "贡嘎县",
                        "label": "贡嘎县",
                        "num": "540522"
                    },
                    {
                        "value": "桑日县",
                        "label": "桑日县",
                        "num": "540523"
                    },
                    {
                        "value": "琼结县",
                        "label": "琼结县",
                        "num": "540524"
                    },
                    {
                        "value": "曲松县",
                        "label": "曲松县",
                        "num": "540525"
                    },
                    {
                        "value": "措美县",
                        "label": "措美县",
                        "num": "540526"
                    },
                    {
                        "value": "洛扎县",
                        "label": "洛扎县",
                        "num": "540527"
                    },
                    {
                        "value": "加查县",
                        "label": "加查县",
                        "num": "540528"
                    },
                    {
                        "value": "隆子县",
                        "label": "隆子县",
                        "num": "540529"
                    },
                    {
                        "value": "错那县",
                        "label": "错那县",
                        "num": "540530"
                    },
                    {
                        "value": "浪卡子县",
                        "label": "浪卡子县",
                        "num": "540531"
                    }
                ]
            },
            {
                "value": "那曲市",
                "label": "那曲市",
                "num": "540600",
                "children": [{
                        "value": "色尼区",
                        "label": "色尼区",
                        "num": "540602"
                    },
                    {
                        "value": "嘉黎县",
                        "label": "嘉黎县",
                        "num": "540621"
                    },
                    {
                        "value": "比如县",
                        "label": "比如县",
                        "num": "540622"
                    },
                    {
                        "value": "聂荣县",
                        "label": "聂荣县",
                        "num": "540623"
                    },
                    {
                        "value": "安多县",
                        "label": "安多县",
                        "num": "540624"
                    },
                    {
                        "value": "申扎县",
                        "label": "申扎县",
                        "num": "540625"
                    },
                    {
                        "value": "索县",
                        "label": "索县",
                        "num": "540626"
                    },
                    {
                        "value": "班戈县",
                        "label": "班戈县",
                        "num": "540627"
                    },
                    {
                        "value": "巴青县",
                        "label": "巴青县",
                        "num": "540628"
                    },
                    {
                        "value": "尼玛县",
                        "label": "尼玛县",
                        "num": "540629"
                    },
                    {
                        "value": "双湖县",
                        "label": "双湖县",
                        "num": "540630"
                    }
                ]
            },
            {
                "value": "阿里地区",
                "label": "阿里地区",
                "num": "542500",
                "children": [{
                        "value": "普兰县",
                        "label": "普兰县",
                        "num": "542521"
                    },
                    {
                        "value": "札达县",
                        "label": "札达县",
                        "num": "542522"
                    },
                    {
                        "value": "噶尔县",
                        "label": "噶尔县",
                        "num": "542523"
                    },
                    {
                        "value": "日土县",
                        "label": "日土县",
                        "num": "542524"
                    },
                    {
                        "value": "革吉县",
                        "label": "革吉县",
                        "num": "542525"
                    },
                    {
                        "value": "改则县",
                        "label": "改则县",
                        "num": "542526"
                    },
                    {
                        "value": "措勤县",
                        "label": "措勤县",
                        "num": "542527"
                    }
                ]
            }
        ]
    },
    {
        "value": "陕西省",
        "label": "陕西省",
        "num": "610000",
        "children": [{
                "value": "西安市",
                "label": "西安市",
                "num": "610100",
                "children": [{
                        "value": "新城区",
                        "label": "新城区",
                        "num": "610102"
                    },
                    {
                        "value": "碑林区",
                        "label": "碑林区",
                        "num": "610103"
                    },
                    {
                        "value": "莲湖区",
                        "label": "莲湖区",
                        "num": "610104"
                    },
                    {
                        "value": "灞桥区",
                        "label": "灞桥区",
                        "num": "610111"
                    },
                    {
                        "value": "未央区",
                        "label": "未央区",
                        "num": "610112"
                    },
                    {
                        "value": "雁塔区",
                        "label": "雁塔区",
                        "num": "610113"
                    },
                    {
                        "value": "阎良区",
                        "label": "阎良区",
                        "num": "610114"
                    },
                    {
                        "value": "临潼区",
                        "label": "临潼区",
                        "num": "610115"
                    },
                    {
                        "value": "长安区",
                        "label": "长安区",
                        "num": "610116"
                    },
                    {
                        "value": "高陵区",
                        "label": "高陵区",
                        "num": "610117"
                    },
                    {
                        "value": "鄠邑区",
                        "label": "鄠邑区",
                        "num": "610118"
                    },
                    {
                        "value": "蓝田县",
                        "label": "蓝田县",
                        "num": "610122"
                    },
                    {
                        "value": "周至县",
                        "label": "周至县",
                        "num": "610124"
                    }
                ]
            },
            {
                "value": "铜川市",
                "label": "铜川市",
                "num": "610200",
                "children": [{
                        "value": "王益区",
                        "label": "王益区",
                        "num": "610202"
                    },
                    {
                        "value": "印台区",
                        "label": "印台区",
                        "num": "610203"
                    },
                    {
                        "value": "耀州区",
                        "label": "耀州区",
                        "num": "610204"
                    },
                    {
                        "value": "宜君县",
                        "label": "宜君县",
                        "num": "610222"
                    }
                ]
            },
            {
                "value": "宝鸡市",
                "label": "宝鸡市",
                "num": "610300",
                "children": [{
                        "value": "渭滨区",
                        "label": "渭滨区",
                        "num": "610302"
                    },
                    {
                        "value": "金台区",
                        "label": "金台区",
                        "num": "610303"
                    },
                    {
                        "value": "陈仓区",
                        "label": "陈仓区",
                        "num": "610304"
                    },
                    {
                        "value": "凤翔县",
                        "label": "凤翔县",
                        "num": "610322"
                    },
                    {
                        "value": "岐山县",
                        "label": "岐山县",
                        "num": "610323"
                    },
                    {
                        "value": "扶风县",
                        "label": "扶风县",
                        "num": "610324"
                    },
                    {
                        "value": "眉县",
                        "label": "眉县",
                        "num": "610326"
                    },
                    {
                        "value": "陇县",
                        "label": "陇县",
                        "num": "610327"
                    },
                    {
                        "value": "千阳县",
                        "label": "千阳县",
                        "num": "610328"
                    },
                    {
                        "value": "麟游县",
                        "label": "麟游县",
                        "num": "610329"
                    },
                    {
                        "value": "凤县",
                        "label": "凤县",
                        "num": "610330"
                    },
                    {
                        "value": "太白县",
                        "label": "太白县",
                        "num": "610331"
                    }
                ]
            },
            {
                "value": "咸阳市",
                "label": "咸阳市",
                "num": "610400",
                "children": [{
                        "value": "秦都区",
                        "label": "秦都区",
                        "num": "610402"
                    },
                    {
                        "value": "杨陵区",
                        "label": "杨陵区",
                        "num": "610403"
                    },
                    {
                        "value": "渭城区",
                        "label": "渭城区",
                        "num": "610404"
                    },
                    {
                        "value": "三原县",
                        "label": "三原县",
                        "num": "610422"
                    },
                    {
                        "value": "泾阳县",
                        "label": "泾阳县",
                        "num": "610423"
                    },
                    {
                        "value": "乾县",
                        "label": "乾县",
                        "num": "610424"
                    },
                    {
                        "value": "礼泉县",
                        "label": "礼泉县",
                        "num": "610425"
                    },
                    {
                        "value": "永寿县",
                        "label": "永寿县",
                        "num": "610426"
                    },
                    {
                        "value": "长武县",
                        "label": "长武县",
                        "num": "610428"
                    },
                    {
                        "value": "旬邑县",
                        "label": "旬邑县",
                        "num": "610429"
                    },
                    {
                        "value": "淳化县",
                        "label": "淳化县",
                        "num": "610430"
                    },
                    {
                        "value": "武功县",
                        "label": "武功县",
                        "num": "610431"
                    },
                    {
                        "value": "兴平市",
                        "label": "兴平市",
                        "num": "610481"
                    },
                    {
                        "value": "彬州市",
                        "label": "彬州市",
                        "num": "610482"
                    }
                ]
            },
            {
                "value": "渭南市",
                "label": "渭南市",
                "num": "610500",
                "children": [{
                        "value": "临渭区",
                        "label": "临渭区",
                        "num": "610502"
                    },
                    {
                        "value": "华州区",
                        "label": "华州区",
                        "num": "610503"
                    },
                    {
                        "value": "潼关县",
                        "label": "潼关县",
                        "num": "610522"
                    },
                    {
                        "value": "大荔县",
                        "label": "大荔县",
                        "num": "610523"
                    },
                    {
                        "value": "合阳县",
                        "label": "合阳县",
                        "num": "610524"
                    },
                    {
                        "value": "澄城县",
                        "label": "澄城县",
                        "num": "610525"
                    },
                    {
                        "value": "蒲城县",
                        "label": "蒲城县",
                        "num": "610526"
                    },
                    {
                        "value": "白水县",
                        "label": "白水县",
                        "num": "610527"
                    },
                    {
                        "value": "富平县",
                        "label": "富平县",
                        "num": "610528"
                    },
                    {
                        "value": "韩城市",
                        "label": "韩城市",
                        "num": "610581"
                    },
                    {
                        "value": "华阴市",
                        "label": "华阴市",
                        "num": "610582"
                    }
                ]
            },
            {
                "value": "延安市",
                "label": "延安市",
                "num": "610600",
                "children": [{
                        "value": "宝塔区",
                        "label": "宝塔区",
                        "num": "610602"
                    },
                    {
                        "value": "安塞区",
                        "label": "安塞区",
                        "num": "610603"
                    },
                    {
                        "value": "延长县",
                        "label": "延长县",
                        "num": "610621"
                    },
                    {
                        "value": "延川县",
                        "label": "延川县",
                        "num": "610622"
                    },
                    {
                        "value": "子长县",
                        "label": "子长县",
                        "num": "610623"
                    },
                    {
                        "value": "志丹县",
                        "label": "志丹县",
                        "num": "610625"
                    },
                    {
                        "value": "吴起县",
                        "label": "吴起县",
                        "num": "610626"
                    },
                    {
                        "value": "甘泉县",
                        "label": "甘泉县",
                        "num": "610627"
                    },
                    {
                        "value": "富县",
                        "label": "富县",
                        "num": "610628"
                    },
                    {
                        "value": "洛川县",
                        "label": "洛川县",
                        "num": "610629"
                    },
                    {
                        "value": "宜川县",
                        "label": "宜川县",
                        "num": "610630"
                    },
                    {
                        "value": "黄龙县",
                        "label": "黄龙县",
                        "num": "610631"
                    },
                    {
                        "value": "黄陵县",
                        "label": "黄陵县",
                        "num": "610632"
                    }
                ]
            },
            {
                "value": "汉中市",
                "label": "汉中市",
                "num": "610700",
                "children": [{
                        "value": "汉台区",
                        "label": "汉台区",
                        "num": "610702"
                    },
                    {
                        "value": "南郑区",
                        "label": "南郑区",
                        "num": "610703"
                    },
                    {
                        "value": "城固县",
                        "label": "城固县",
                        "num": "610722"
                    },
                    {
                        "value": "洋县",
                        "label": "洋县",
                        "num": "610723"
                    },
                    {
                        "value": "西乡县",
                        "label": "西乡县",
                        "num": "610724"
                    },
                    {
                        "value": "勉县",
                        "label": "勉县",
                        "num": "610725"
                    },
                    {
                        "value": "宁强县",
                        "label": "宁强县",
                        "num": "610726"
                    },
                    {
                        "value": "略阳县",
                        "label": "略阳县",
                        "num": "610727"
                    },
                    {
                        "value": "镇巴县",
                        "label": "镇巴县",
                        "num": "610728"
                    },
                    {
                        "value": "留坝县",
                        "label": "留坝县",
                        "num": "610729"
                    },
                    {
                        "value": "佛坪县",
                        "label": "佛坪县",
                        "num": "610730"
                    }
                ]
            },
            {
                "value": "榆林市",
                "label": "榆林市",
                "num": "610800",
                "children": [{
                        "value": "榆阳区",
                        "label": "榆阳区",
                        "num": "610802"
                    },
                    {
                        "value": "横山区",
                        "label": "横山区",
                        "num": "610803"
                    },
                    {
                        "value": "府谷县",
                        "label": "府谷县",
                        "num": "610822"
                    },
                    {
                        "value": "靖边县",
                        "label": "靖边县",
                        "num": "610824"
                    },
                    {
                        "value": "定边县",
                        "label": "定边县",
                        "num": "610825"
                    },
                    {
                        "value": "绥德县",
                        "label": "绥德县",
                        "num": "610826"
                    },
                    {
                        "value": "米脂县",
                        "label": "米脂县",
                        "num": "610827"
                    },
                    {
                        "value": "佳县",
                        "label": "佳县",
                        "num": "610828"
                    },
                    {
                        "value": "吴堡县",
                        "label": "吴堡县",
                        "num": "610829"
                    },
                    {
                        "value": "清涧县",
                        "label": "清涧县",
                        "num": "610830"
                    },
                    {
                        "value": "子洲县",
                        "label": "子洲县",
                        "num": "610831"
                    },
                    {
                        "value": "神木市",
                        "label": "神木市",
                        "num": "610881"
                    }
                ]
            },
            {
                "value": "安康市",
                "label": "安康市",
                "num": "610900",
                "children": [{
                        "value": "汉滨区",
                        "label": "汉滨区",
                        "num": "610902"
                    },
                    {
                        "value": "汉阴县",
                        "label": "汉阴县",
                        "num": "610921"
                    },
                    {
                        "value": "石泉县",
                        "label": "石泉县",
                        "num": "610922"
                    },
                    {
                        "value": "宁陕县",
                        "label": "宁陕县",
                        "num": "610923"
                    },
                    {
                        "value": "紫阳县",
                        "label": "紫阳县",
                        "num": "610924"
                    },
                    {
                        "value": "岚皋县",
                        "label": "岚皋县",
                        "num": "610925"
                    },
                    {
                        "value": "平利县",
                        "label": "平利县",
                        "num": "610926"
                    },
                    {
                        "value": "镇坪县",
                        "label": "镇坪县",
                        "num": "610927"
                    },
                    {
                        "value": "旬阳县",
                        "label": "旬阳县",
                        "num": "610928"
                    },
                    {
                        "value": "白河县",
                        "label": "白河县",
                        "num": "610929"
                    }
                ]
            },
            {
                "value": "商洛市",
                "label": "商洛市",
                "num": "611000",
                "children": [{
                        "value": "商州区",
                        "label": "商州区",
                        "num": "611002"
                    },
                    {
                        "value": "洛南县",
                        "label": "洛南县",
                        "num": "611021"
                    },
                    {
                        "value": "丹凤县",
                        "label": "丹凤县",
                        "num": "611022"
                    },
                    {
                        "value": "商南县",
                        "label": "商南县",
                        "num": "611023"
                    },
                    {
                        "value": "山阳县",
                        "label": "山阳县",
                        "num": "611024"
                    },
                    {
                        "value": "镇安县",
                        "label": "镇安县",
                        "num": "611025"
                    },
                    {
                        "value": "柞水县",
                        "label": "柞水县",
                        "num": "611026"
                    }
                ]
            }
        ]
    },
    {
        "value": "甘肃省",
        "label": "甘肃省",
        "num": "620000",
        "children": [{
                "value": "兰州市",
                "label": "兰州市",
                "num": "620100",
                "children": [{
                        "value": "城关区",
                        "label": "城关区",
                        "num": "620102"
                    },
                    {
                        "value": "七里河区",
                        "label": "七里河区",
                        "num": "620103"
                    },
                    {
                        "value": "西固区",
                        "label": "西固区",
                        "num": "620104"
                    },
                    {
                        "value": "安宁区",
                        "label": "安宁区",
                        "num": "620105"
                    },
                    {
                        "value": "红古区",
                        "label": "红古区",
                        "num": "620111"
                    },
                    {
                        "value": "永登县",
                        "label": "永登县",
                        "num": "620121"
                    },
                    {
                        "value": "皋兰县",
                        "label": "皋兰县",
                        "num": "620122"
                    },
                    {
                        "value": "榆中县",
                        "label": "榆中县",
                        "num": "620123"
                    }
                ]
            },
            {
                "value": "嘉峪关市",
                "label": "嘉峪关市",
                "num": "620200",
                "children": [{
                        "value": "市辖区",
                        "label": "市辖区",
                        "num": "620201"
                    },
                    {
                        "value": "雄关区",
                        "label": "雄关区",
                        "num": "620290"
                    },
                    {
                        "value": "长城区",
                        "label": "长城区",
                        "num": "620291"
                    },
                    {
                        "value": "镜铁区",
                        "label": "镜铁区",
                        "num": "620292"
                    },
                    {
                        "value": "新城镇",
                        "label": "新城镇",
                        "num": "620293"
                    },
                    {
                        "value": "峪泉镇",
                        "label": "峪泉镇",
                        "num": "620294"
                    },
                    {
                        "value": "文殊镇",
                        "label": "文殊镇",
                        "num": "620295"
                    }
                ]
            },
            {
                "value": "金昌市",
                "label": "金昌市",
                "num": "620300",
                "children": [{
                        "value": "金川区",
                        "label": "金川区",
                        "num": "620302"
                    },
                    {
                        "value": "永昌县",
                        "label": "永昌县",
                        "num": "620321"
                    }
                ]
            },
            {
                "value": "白银市",
                "label": "白银市",
                "num": "620400",
                "children": [{
                        "value": "白银区",
                        "label": "白银区",
                        "num": "620402"
                    },
                    {
                        "value": "平川区",
                        "label": "平川区",
                        "num": "620403"
                    },
                    {
                        "value": "靖远县",
                        "label": "靖远县",
                        "num": "620421"
                    },
                    {
                        "value": "会宁县",
                        "label": "会宁县",
                        "num": "620422"
                    },
                    {
                        "value": "景泰县",
                        "label": "景泰县",
                        "num": "620423"
                    }
                ]
            },
            {
                "value": "天水市",
                "label": "天水市",
                "num": "620500",
                "children": [{
                        "value": "秦州区",
                        "label": "秦州区",
                        "num": "620502"
                    },
                    {
                        "value": "麦积区",
                        "label": "麦积区",
                        "num": "620503"
                    },
                    {
                        "value": "清水县",
                        "label": "清水县",
                        "num": "620521"
                    },
                    {
                        "value": "秦安县",
                        "label": "秦安县",
                        "num": "620522"
                    },
                    {
                        "value": "甘谷县",
                        "label": "甘谷县",
                        "num": "620523"
                    },
                    {
                        "value": "武山县",
                        "label": "武山县",
                        "num": "620524"
                    },
                    {
                        "value": "张家川回族自治县",
                        "label": "张家川回族自治县",
                        "num": "620525"
                    }
                ]
            },
            {
                "value": "武威市",
                "label": "武威市",
                "num": "620600",
                "children": [{
                        "value": "凉州区",
                        "label": "凉州区",
                        "num": "620602"
                    },
                    {
                        "value": "民勤县",
                        "label": "民勤县",
                        "num": "620621"
                    },
                    {
                        "value": "古浪县",
                        "label": "古浪县",
                        "num": "620622"
                    },
                    {
                        "value": "天祝藏族自治县",
                        "label": "天祝藏族自治县",
                        "num": "620623"
                    }
                ]
            },
            {
                "value": "张掖市",
                "label": "张掖市",
                "num": "620700",
                "children": [{
                        "value": "甘州区",
                        "label": "甘州区",
                        "num": "620702"
                    },
                    {
                        "value": "肃南裕固族自治县",
                        "label": "肃南裕固族自治县",
                        "num": "620721"
                    },
                    {
                        "value": "民乐县",
                        "label": "民乐县",
                        "num": "620722"
                    },
                    {
                        "value": "临泽县",
                        "label": "临泽县",
                        "num": "620723"
                    },
                    {
                        "value": "高台县",
                        "label": "高台县",
                        "num": "620724"
                    },
                    {
                        "value": "山丹县",
                        "label": "山丹县",
                        "num": "620725"
                    }
                ]
            },
            {
                "value": "平凉市",
                "label": "平凉市",
                "num": "620800",
                "children": [{
                        "value": "崆峒区",
                        "label": "崆峒区",
                        "num": "620802"
                    },
                    {
                        "value": "泾川县",
                        "label": "泾川县",
                        "num": "620821"
                    },
                    {
                        "value": "灵台县",
                        "label": "灵台县",
                        "num": "620822"
                    },
                    {
                        "value": "崇信县",
                        "label": "崇信县",
                        "num": "620823"
                    },
                    {
                        "value": "庄浪县",
                        "label": "庄浪县",
                        "num": "620825"
                    },
                    {
                        "value": "静宁县",
                        "label": "静宁县",
                        "num": "620826"
                    },
                    {
                        "value": "华亭市",
                        "label": "华亭市",
                        "num": "620881"
                    }
                ]
            },
            {
                "value": "酒泉市",
                "label": "酒泉市",
                "num": "620900",
                "children": [{
                        "value": "肃州区",
                        "label": "肃州区",
                        "num": "620902"
                    },
                    {
                        "value": "金塔县",
                        "label": "金塔县",
                        "num": "620921"
                    },
                    {
                        "value": "瓜州县",
                        "label": "瓜州县",
                        "num": "620922"
                    },
                    {
                        "value": "肃北蒙古族自治县",
                        "label": "肃北蒙古族自治县",
                        "num": "620923"
                    },
                    {
                        "value": "阿克塞哈萨克族自治县",
                        "label": "阿克塞哈萨克族自治县",
                        "num": "620924"
                    },
                    {
                        "value": "玉门市",
                        "label": "玉门市",
                        "num": "620981"
                    },
                    {
                        "value": "敦煌市",
                        "label": "敦煌市",
                        "num": "620982"
                    }
                ]
            },
            {
                "value": "庆阳市",
                "label": "庆阳市",
                "num": "621000",
                "children": [{
                        "value": "西峰区",
                        "label": "西峰区",
                        "num": "621002"
                    },
                    {
                        "value": "庆城县",
                        "label": "庆城县",
                        "num": "621021"
                    },
                    {
                        "value": "环县",
                        "label": "环县",
                        "num": "621022"
                    },
                    {
                        "value": "华池县",
                        "label": "华池县",
                        "num": "621023"
                    },
                    {
                        "value": "合水县",
                        "label": "合水县",
                        "num": "621024"
                    },
                    {
                        "value": "正宁县",
                        "label": "正宁县",
                        "num": "621025"
                    },
                    {
                        "value": "宁县",
                        "label": "宁县",
                        "num": "621026"
                    },
                    {
                        "value": "镇原县",
                        "label": "镇原县",
                        "num": "621027"
                    }
                ]
            },
            {
                "value": "定西市",
                "label": "定西市",
                "num": "621100",
                "children": [{
                        "value": "安定区",
                        "label": "安定区",
                        "num": "621102"
                    },
                    {
                        "value": "通渭县",
                        "label": "通渭县",
                        "num": "621121"
                    },
                    {
                        "value": "陇西县",
                        "label": "陇西县",
                        "num": "621122"
                    },
                    {
                        "value": "渭源县",
                        "label": "渭源县",
                        "num": "621123"
                    },
                    {
                        "value": "临洮县",
                        "label": "临洮县",
                        "num": "621124"
                    },
                    {
                        "value": "漳县",
                        "label": "漳县",
                        "num": "621125"
                    },
                    {
                        "value": "岷县",
                        "label": "岷县",
                        "num": "621126"
                    }
                ]
            },
            {
                "value": "陇南市",
                "label": "陇南市",
                "num": "621200",
                "children": [{
                        "value": "武都区",
                        "label": "武都区",
                        "num": "621202"
                    },
                    {
                        "value": "成县",
                        "label": "成县",
                        "num": "621221"
                    },
                    {
                        "value": "文县",
                        "label": "文县",
                        "num": "621222"
                    },
                    {
                        "value": "宕昌县",
                        "label": "宕昌县",
                        "num": "621223"
                    },
                    {
                        "value": "康县",
                        "label": "康县",
                        "num": "621224"
                    },
                    {
                        "value": "西和县",
                        "label": "西和县",
                        "num": "621225"
                    },
                    {
                        "value": "礼县",
                        "label": "礼县",
                        "num": "621226"
                    },
                    {
                        "value": "徽县",
                        "label": "徽县",
                        "num": "621227"
                    },
                    {
                        "value": "两当县",
                        "label": "两当县",
                        "num": "621228"
                    }
                ]
            },
            {
                "value": "临夏回族自治州",
                "label": "临夏回族自治州",
                "num": "622900",
                "children": [{
                        "value": "临夏市",
                        "label": "临夏市",
                        "num": "622901"
                    },
                    {
                        "value": "临夏县",
                        "label": "临夏县",
                        "num": "622921"
                    },
                    {
                        "value": "康乐县",
                        "label": "康乐县",
                        "num": "622922"
                    },
                    {
                        "value": "永靖县",
                        "label": "永靖县",
                        "num": "622923"
                    },
                    {
                        "value": "广河县",
                        "label": "广河县",
                        "num": "622924"
                    },
                    {
                        "value": "和政县",
                        "label": "和政县",
                        "num": "622925"
                    },
                    {
                        "value": "东乡族自治县",
                        "label": "东乡族自治县",
                        "num": "622926"
                    },
                    {
                        "value": "积石山保安族东乡族撒拉族自治县",
                        "label": "积石山保安族东乡族撒拉族自治县",
                        "num": "622927"
                    }
                ]
            },
            {
                "value": "甘南藏族自治州",
                "label": "甘南藏族自治州",
                "num": "623000",
                "children": [{
                        "value": "合作市",
                        "label": "合作市",
                        "num": "623001"
                    },
                    {
                        "value": "临潭县",
                        "label": "临潭县",
                        "num": "623021"
                    },
                    {
                        "value": "卓尼县",
                        "label": "卓尼县",
                        "num": "623022"
                    },
                    {
                        "value": "舟曲县",
                        "label": "舟曲县",
                        "num": "623023"
                    },
                    {
                        "value": "迭部县",
                        "label": "迭部县",
                        "num": "623024"
                    },
                    {
                        "value": "玛曲县",
                        "label": "玛曲县",
                        "num": "623025"
                    },
                    {
                        "value": "碌曲县",
                        "label": "碌曲县",
                        "num": "623026"
                    },
                    {
                        "value": "夏河县",
                        "label": "夏河县",
                        "num": "623027"
                    }
                ]
            }
        ]
    },
    {
        "value": "青海省",
        "label": "青海省",
        "num": "630000",
        "children": [{
                "value": "西宁市",
                "label": "西宁市",
                "num": "630100",
                "children": [{
                        "value": "城东区",
                        "label": "城东区",
                        "num": "630102"
                    },
                    {
                        "value": "城中区",
                        "label": "城中区",
                        "num": "630103"
                    },
                    {
                        "value": "城西区",
                        "label": "城西区",
                        "num": "630104"
                    },
                    {
                        "value": "城北区",
                        "label": "城北区",
                        "num": "630105"
                    },
                    {
                        "value": "大通回族土族自治县",
                        "label": "大通回族土族自治县",
                        "num": "630121"
                    },
                    {
                        "value": "湟中县",
                        "label": "湟中县",
                        "num": "630122"
                    },
                    {
                        "value": "湟源县",
                        "label": "湟源县",
                        "num": "630123"
                    }
                ]
            },
            {
                "value": "海东市",
                "label": "海东市",
                "num": "630200",
                "children": [{
                        "value": "乐都区",
                        "label": "乐都区",
                        "num": "630202"
                    },
                    {
                        "value": "平安区",
                        "label": "平安区",
                        "num": "630203"
                    },
                    {
                        "value": "民和回族土族自治县",
                        "label": "民和回族土族自治县",
                        "num": "630222"
                    },
                    {
                        "value": "互助土族自治县",
                        "label": "互助土族自治县",
                        "num": "630223"
                    },
                    {
                        "value": "化隆回族自治县",
                        "label": "化隆回族自治县",
                        "num": "630224"
                    },
                    {
                        "value": "循化撒拉族自治县",
                        "label": "循化撒拉族自治县",
                        "num": "630225"
                    }
                ]
            },
            {
                "value": "海北藏族自治州",
                "label": "海北藏族自治州",
                "num": "632200",
                "children": [{
                        "value": "门源回族自治县",
                        "label": "门源回族自治县",
                        "num": "632221"
                    },
                    {
                        "value": "祁连县",
                        "label": "祁连县",
                        "num": "632222"
                    },
                    {
                        "value": "海晏县",
                        "label": "海晏县",
                        "num": "632223"
                    },
                    {
                        "value": "刚察县",
                        "label": "刚察县",
                        "num": "632224"
                    }
                ]
            },
            {
                "value": "黄南藏族自治州",
                "label": "黄南藏族自治州",
                "num": "632300",
                "children": [{
                        "value": "同仁县",
                        "label": "同仁县",
                        "num": "632321"
                    },
                    {
                        "value": "尖扎县",
                        "label": "尖扎县",
                        "num": "632322"
                    },
                    {
                        "value": "泽库县",
                        "label": "泽库县",
                        "num": "632323"
                    },
                    {
                        "value": "河南蒙古族自治县",
                        "label": "河南蒙古族自治县",
                        "num": "632324"
                    }
                ]
            },
            {
                "value": "海南藏族自治州",
                "label": "海南藏族自治州",
                "num": "632500",
                "children": [{
                        "value": "共和县",
                        "label": "共和县",
                        "num": "632521"
                    },
                    {
                        "value": "同德县",
                        "label": "同德县",
                        "num": "632522"
                    },
                    {
                        "value": "贵德县",
                        "label": "贵德县",
                        "num": "632523"
                    },
                    {
                        "value": "兴海县",
                        "label": "兴海县",
                        "num": "632524"
                    },
                    {
                        "value": "贵南县",
                        "label": "贵南县",
                        "num": "632525"
                    }
                ]
            },
            {
                "value": "果洛藏族自治州",
                "label": "果洛藏族自治州",
                "num": "632600",
                "children": [{
                        "value": "玛沁县",
                        "label": "玛沁县",
                        "num": "632621"
                    },
                    {
                        "value": "班玛县",
                        "label": "班玛县",
                        "num": "632622"
                    },
                    {
                        "value": "甘德县",
                        "label": "甘德县",
                        "num": "632623"
                    },
                    {
                        "value": "达日县",
                        "label": "达日县",
                        "num": "632624"
                    },
                    {
                        "value": "久治县",
                        "label": "久治县",
                        "num": "632625"
                    },
                    {
                        "value": "玛多县",
                        "label": "玛多县",
                        "num": "632626"
                    }
                ]
            },
            {
                "value": "玉树藏族自治州",
                "label": "玉树藏族自治州",
                "num": "632700",
                "children": [{
                        "value": "玉树市",
                        "label": "玉树市",
                        "num": "632701"
                    },
                    {
                        "value": "杂多县",
                        "label": "杂多县",
                        "num": "632722"
                    },
                    {
                        "value": "称多县",
                        "label": "称多县",
                        "num": "632723"
                    },
                    {
                        "value": "治多县",
                        "label": "治多县",
                        "num": "632724"
                    },
                    {
                        "value": "囊谦县",
                        "label": "囊谦县",
                        "num": "632725"
                    },
                    {
                        "value": "曲麻莱县",
                        "label": "曲麻莱县",
                        "num": "632726"
                    }
                ]
            },
            {
                "value": "海西蒙古族藏族自治州",
                "label": "海西蒙古族藏族自治州",
                "num": "632800",
                "children": [{
                        "value": "格尔木市",
                        "label": "格尔木市",
                        "num": "632801"
                    },
                    {
                        "value": "德令哈市",
                        "label": "德令哈市",
                        "num": "632802"
                    },
                    {
                        "value": "茫崖市",
                        "label": "茫崖市",
                        "num": "632803"
                    },
                    {
                        "value": "乌兰县",
                        "label": "乌兰县",
                        "num": "632821"
                    },
                    {
                        "value": "都兰县",
                        "label": "都兰县",
                        "num": "632822"
                    },
                    {
                        "value": "天峻县",
                        "label": "天峻县",
                        "num": "632823"
                    }
                ]
            }
        ]
    },
    {
        "value": "宁夏回族自治区",
        "label": "宁夏回族自治区",
        "num": "640000",
        "children": [{
                "value": "银川市",
                "label": "银川市",
                "num": "640100",
                "children": [{
                        "value": "兴庆区",
                        "label": "兴庆区",
                        "num": "640104"
                    },
                    {
                        "value": "西夏区",
                        "label": "西夏区",
                        "num": "640105"
                    },
                    {
                        "value": "金凤区",
                        "label": "金凤区",
                        "num": "640106"
                    },
                    {
                        "value": "永宁县",
                        "label": "永宁县",
                        "num": "640121"
                    },
                    {
                        "value": "贺兰县",
                        "label": "贺兰县",
                        "num": "640122"
                    },
                    {
                        "value": "灵武市",
                        "label": "灵武市",
                        "num": "640181"
                    }
                ]
            },
            {
                "value": "石嘴山市",
                "label": "石嘴山市",
                "num": "640200",
                "children": [{
                        "value": "大武口区",
                        "label": "大武口区",
                        "num": "640202"
                    },
                    {
                        "value": "惠农区",
                        "label": "惠农区",
                        "num": "640205"
                    },
                    {
                        "value": "平罗县",
                        "label": "平罗县",
                        "num": "640221"
                    }
                ]
            },
            {
                "value": "吴忠市",
                "label": "吴忠市",
                "num": "640300",
                "children": [{
                        "value": "利通区",
                        "label": "利通区",
                        "num": "640302"
                    },
                    {
                        "value": "红寺堡区",
                        "label": "红寺堡区",
                        "num": "640303"
                    },
                    {
                        "value": "盐池县",
                        "label": "盐池县",
                        "num": "640323"
                    },
                    {
                        "value": "同心县",
                        "label": "同心县",
                        "num": "640324"
                    },
                    {
                        "value": "青铜峡市",
                        "label": "青铜峡市",
                        "num": "640381"
                    }
                ]
            },
            {
                "value": "固原市",
                "label": "固原市",
                "num": "640400",
                "children": [{
                        "value": "原州区",
                        "label": "原州区",
                        "num": "640402"
                    },
                    {
                        "value": "西吉县",
                        "label": "西吉县",
                        "num": "640422"
                    },
                    {
                        "value": "隆德县",
                        "label": "隆德县",
                        "num": "640423"
                    },
                    {
                        "value": "泾源县",
                        "label": "泾源县",
                        "num": "640424"
                    },
                    {
                        "value": "彭阳县",
                        "label": "彭阳县",
                        "num": "640425"
                    }
                ]
            },
            {
                "value": "中卫市",
                "label": "中卫市",
                "num": "640500",
                "children": [{
                        "value": "沙坡头区",
                        "label": "沙坡头区",
                        "num": "640502"
                    },
                    {
                        "value": "中宁县",
                        "label": "中宁县",
                        "num": "640521"
                    },
                    {
                        "value": "海原县",
                        "label": "海原县",
                        "num": "640522"
                    }
                ]
            }
        ]
    },
    {
        "value": "新疆维吾尔自治区",
        "label": "新疆维吾尔自治区",
        "num": "650000",
        "children": [{
                "value": "乌鲁木齐市",
                "label": "乌鲁木齐市",
                "num": "650100",
                "children": [{
                        "value": "天山区",
                        "label": "天山区",
                        "num": "650102"
                    },
                    {
                        "value": "沙依巴克区",
                        "label": "沙依巴克区",
                        "num": "650103"
                    },
                    {
                        "value": "新市区",
                        "label": "新市区",
                        "num": "650104"
                    },
                    {
                        "value": "水磨沟区",
                        "label": "水磨沟区",
                        "num": "650105"
                    },
                    {
                        "value": "头屯河区",
                        "label": "头屯河区",
                        "num": "650106"
                    },
                    {
                        "value": "达坂城区",
                        "label": "达坂城区",
                        "num": "650107"
                    },
                    {
                        "value": "米东区",
                        "label": "米东区",
                        "num": "650109"
                    },
                    {
                        "value": "乌鲁木齐县",
                        "label": "乌鲁木齐县",
                        "num": "650121"
                    }
                ]
            },
            {
                "value": "克拉玛依市",
                "label": "克拉玛依市",
                "num": "650200",
                "children": [{
                        "value": "独山子区",
                        "label": "独山子区",
                        "num": "650202"
                    },
                    {
                        "value": "克拉玛依区",
                        "label": "克拉玛依区",
                        "num": "650203"
                    },
                    {
                        "value": "白碱滩区",
                        "label": "白碱滩区",
                        "num": "650204"
                    },
                    {
                        "value": "乌尔禾区",
                        "label": "乌尔禾区",
                        "num": "650205"
                    }
                ]
            },
            {
                "value": "吐鲁番市",
                "label": "吐鲁番市",
                "num": "650400",
                "children": [{
                        "value": "高昌区",
                        "label": "高昌区",
                        "num": "650402"
                    },
                    {
                        "value": "鄯善县",
                        "label": "鄯善县",
                        "num": "650421"
                    },
                    {
                        "value": "托克逊县",
                        "label": "托克逊县",
                        "num": "650422"
                    }
                ]
            },
            {
                "value": "哈密市",
                "label": "哈密市",
                "num": "650500",
                "children": [{
                        "value": "伊州区",
                        "label": "伊州区",
                        "num": "650502"
                    },
                    {
                        "value": "巴里坤哈萨克自治县",
                        "label": "巴里坤哈萨克自治县",
                        "num": "650521"
                    },
                    {
                        "value": "伊吾县",
                        "label": "伊吾县",
                        "num": "650522"
                    }
                ]
            },
            {
                "value": "昌吉回族自治州",
                "label": "昌吉回族自治州",
                "num": "652300",
                "children": [{
                        "value": "昌吉市",
                        "label": "昌吉市",
                        "num": "652301"
                    },
                    {
                        "value": "阜康市",
                        "label": "阜康市",
                        "num": "652302"
                    },
                    {
                        "value": "呼图壁县",
                        "label": "呼图壁县",
                        "num": "652323"
                    },
                    {
                        "value": "玛纳斯县",
                        "label": "玛纳斯县",
                        "num": "652324"
                    },
                    {
                        "value": "奇台县",
                        "label": "奇台县",
                        "num": "652325"
                    },
                    {
                        "value": "吉木萨尔县",
                        "label": "吉木萨尔县",
                        "num": "652327"
                    },
                    {
                        "value": "木垒哈萨克自治县",
                        "label": "木垒哈萨克自治县",
                        "num": "652328"
                    }
                ]
            },
            {
                "value": "博尔塔拉蒙古自治州",
                "label": "博尔塔拉蒙古自治州",
                "num": "652700",
                "children": [{
                        "value": "博乐市",
                        "label": "博乐市",
                        "num": "652701"
                    },
                    {
                        "value": "阿拉山口市",
                        "label": "阿拉山口市",
                        "num": "652702"
                    },
                    {
                        "value": "精河县",
                        "label": "精河县",
                        "num": "652722"
                    },
                    {
                        "value": "温泉县",
                        "label": "温泉县",
                        "num": "652723"
                    }
                ]
            },
            {
                "value": "巴音郭楞蒙古自治州",
                "label": "巴音郭楞蒙古自治州",
                "num": "652800",
                "children": [{
                        "value": "库尔勒市",
                        "label": "库尔勒市",
                        "num": "652801"
                    },
                    {
                        "value": "轮台县",
                        "label": "轮台县",
                        "num": "652822"
                    },
                    {
                        "value": "尉犁县",
                        "label": "尉犁县",
                        "num": "652823"
                    },
                    {
                        "value": "若羌县",
                        "label": "若羌县",
                        "num": "652824"
                    },
                    {
                        "value": "且末县",
                        "label": "且末县",
                        "num": "652825"
                    },
                    {
                        "value": "焉耆回族自治县",
                        "label": "焉耆回族自治县",
                        "num": "652826"
                    },
                    {
                        "value": "和静县",
                        "label": "和静县",
                        "num": "652827"
                    },
                    {
                        "value": "和硕县",
                        "label": "和硕县",
                        "num": "652828"
                    },
                    {
                        "value": "博湖县",
                        "label": "博湖县",
                        "num": "652829"
                    }
                ]
            },
            {
                "value": "阿克苏地区",
                "label": "阿克苏地区",
                "num": "652900",
                "children": [{
                        "value": "阿克苏市",
                        "label": "阿克苏市",
                        "num": "652901"
                    },
                    {
                        "value": "温宿县",
                        "label": "温宿县",
                        "num": "652922"
                    },
                    {
                        "value": "库车县",
                        "label": "库车县",
                        "num": "652923"
                    },
                    {
                        "value": "沙雅县",
                        "label": "沙雅县",
                        "num": "652924"
                    },
                    {
                        "value": "新和县",
                        "label": "新和县",
                        "num": "652925"
                    },
                    {
                        "value": "拜城县",
                        "label": "拜城县",
                        "num": "652926"
                    },
                    {
                        "value": "乌什县",
                        "label": "乌什县",
                        "num": "652927"
                    },
                    {
                        "value": "阿瓦提县",
                        "label": "阿瓦提县",
                        "num": "652928"
                    },
                    {
                        "value": "柯坪县",
                        "label": "柯坪县",
                        "num": "652929"
                    }
                ]
            },
            {
                "value": "克孜勒苏柯尔克孜自治州",
                "label": "克孜勒苏柯尔克孜自治州",
                "num": "653000",
                "children": [{
                        "value": "阿图什市",
                        "label": "阿图什市",
                        "num": "653001"
                    },
                    {
                        "value": "阿克陶县",
                        "label": "阿克陶县",
                        "num": "653022"
                    },
                    {
                        "value": "阿合奇县",
                        "label": "阿合奇县",
                        "num": "653023"
                    },
                    {
                        "value": "乌恰县",
                        "label": "乌恰县",
                        "num": "653024"
                    }
                ]
            },
            {
                "value": "喀什地区",
                "label": "喀什地区",
                "num": "653100",
                "children": [{
                        "value": "喀什市",
                        "label": "喀什市",
                        "num": "653101"
                    },
                    {
                        "value": "疏附县",
                        "label": "疏附县",
                        "num": "653121"
                    },
                    {
                        "value": "疏勒县",
                        "label": "疏勒县",
                        "num": "653122"
                    },
                    {
                        "value": "英吉沙县",
                        "label": "英吉沙县",
                        "num": "653123"
                    },
                    {
                        "value": "泽普县",
                        "label": "泽普县",
                        "num": "653124"
                    },
                    {
                        "value": "莎车县",
                        "label": "莎车县",
                        "num": "653125"
                    },
                    {
                        "value": "叶城县",
                        "label": "叶城县",
                        "num": "653126"
                    },
                    {
                        "value": "麦盖提县",
                        "label": "麦盖提县",
                        "num": "653127"
                    },
                    {
                        "value": "岳普湖县",
                        "label": "岳普湖县",
                        "num": "653128"
                    },
                    {
                        "value": "伽师县",
                        "label": "伽师县",
                        "num": "653129"
                    },
                    {
                        "value": "巴楚县",
                        "label": "巴楚县",
                        "num": "653130"
                    },
                    {
                        "value": "塔什库尔干塔吉克自治县",
                        "label": "塔什库尔干塔吉克自治县",
                        "num": "653131"
                    }
                ]
            },
            {
                "value": "和田地区",
                "label": "和田地区",
                "num": "653200",
                "children": [{
                        "value": "和田市",
                        "label": "和田市",
                        "num": "653201"
                    },
                    {
                        "value": "和田县",
                        "label": "和田县",
                        "num": "653221"
                    },
                    {
                        "value": "墨玉县",
                        "label": "墨玉县",
                        "num": "653222"
                    },
                    {
                        "value": "皮山县",
                        "label": "皮山县",
                        "num": "653223"
                    },
                    {
                        "value": "洛浦县",
                        "label": "洛浦县",
                        "num": "653224"
                    },
                    {
                        "value": "策勒县",
                        "label": "策勒县",
                        "num": "653225"
                    },
                    {
                        "value": "于田县",
                        "label": "于田县",
                        "num": "653226"
                    },
                    {
                        "value": "民丰县",
                        "label": "民丰县",
                        "num": "653227"
                    }
                ]
            },
            {
                "value": "伊犁哈萨克自治州",
                "label": "伊犁哈萨克自治州",
                "num": "654000",
                "children": [{
                        "value": "伊宁市",
                        "label": "伊宁市",
                        "num": "654002"
                    },
                    {
                        "value": "奎屯市",
                        "label": "奎屯市",
                        "num": "654003"
                    },
                    {
                        "value": "霍尔果斯市",
                        "label": "霍尔果斯市",
                        "num": "654004"
                    },
                    {
                        "value": "伊宁县",
                        "label": "伊宁县",
                        "num": "654021"
                    },
                    {
                        "value": "察布查尔锡伯自治县",
                        "label": "察布查尔锡伯自治县",
                        "num": "654022"
                    },
                    {
                        "value": "霍城县",
                        "label": "霍城县",
                        "num": "654023"
                    },
                    {
                        "value": "巩留县",
                        "label": "巩留县",
                        "num": "654024"
                    },
                    {
                        "value": "新源县",
                        "label": "新源县",
                        "num": "654025"
                    },
                    {
                        "value": "昭苏县",
                        "label": "昭苏县",
                        "num": "654026"
                    },
                    {
                        "value": "特克斯县",
                        "label": "特克斯县",
                        "num": "654027"
                    },
                    {
                        "value": "尼勒克县",
                        "label": "尼勒克县",
                        "num": "654028"
                    }
                ]
            },
            {
                "value": "塔城地区",
                "label": "塔城地区",
                "num": "654200",
                "children": [{
                        "value": "塔城市",
                        "label": "塔城市",
                        "num": "654201"
                    },
                    {
                        "value": "乌苏市",
                        "label": "乌苏市",
                        "num": "654202"
                    },
                    {
                        "value": "额敏县",
                        "label": "额敏县",
                        "num": "654221"
                    },
                    {
                        "value": "沙湾县",
                        "label": "沙湾县",
                        "num": "654223"
                    },
                    {
                        "value": "托里县",
                        "label": "托里县",
                        "num": "654224"
                    },
                    {
                        "value": "裕民县",
                        "label": "裕民县",
                        "num": "654225"
                    },
                    {
                        "value": "和布克赛尔蒙古自治县",
                        "label": "和布克赛尔蒙古自治县",
                        "num": "654226"
                    }
                ]
            },
            {
                "value": "阿勒泰地区",
                "label": "阿勒泰地区",
                "num": "654300",
                "children": [{
                        "value": "阿勒泰市",
                        "label": "阿勒泰市",
                        "num": "654301"
                    },
                    {
                        "value": "布尔津县",
                        "label": "布尔津县",
                        "num": "654321"
                    },
                    {
                        "value": "富蕴县",
                        "label": "富蕴县",
                        "num": "654322"
                    },
                    {
                        "value": "福海县",
                        "label": "福海县",
                        "num": "654323"
                    },
                    {
                        "value": "哈巴河县",
                        "label": "哈巴河县",
                        "num": "654324"
                    },
                    {
                        "value": "青河县",
                        "label": "青河县",
                        "num": "654325"
                    },
                    {
                        "value": "吉木乃县",
                        "label": "吉木乃县",
                        "num": "654326"
                    }
                ]
            },
            {
                "value": "自治区直辖县级行政区划",
                "label": "自治区直辖县级行政区划",
                "num": "659000",
                "children": [{
                        "value": "石河子市",
                        "label": "石河子市",
                        "num": "659001"
                    },
                    {
                        "value": "阿拉尔市",
                        "label": "阿拉尔市",
                        "num": "659002"
                    },
                    {
                        "value": "图木舒克市",
                        "label": "图木舒克市",
                        "num": "659003"
                    },
                    {
                        "value": "五家渠市",
                        "label": "五家渠市",
                        "num": "659004"
                    },
                    {
                        "value": "北屯市",
                        "label": "北屯市",
                        "num": "659005"
                    },
                    {
                        "value": "铁门关市",
                        "label": "铁门关市",
                        "num": "659006"
                    },
                    {
                        "value": "双河市",
                        "label": "双河市",
                        "num": "659007"
                    },
                    {
                        "value": "可克达拉市",
                        "label": "可克达拉市",
                        "num": "659008"
                    },
                    {
                        "value": "昆玉市",
                        "label": "昆玉市",
                        "num": "659009"
                    }
                ]
            }
        ]
    },
    {
        "value": "台湾省",
        "label": "台湾省",
        "num": "710000",
        "children": [{
                "value": "台北市",
                "label": "台北市",
                "num": "710100",
                "children": [{
                        "value": "中正区",
                        "label": "中正区",
                        "num": "710101"
                    },
                    {
                        "value": "大同区",
                        "label": "大同区",
                        "num": "710102"
                    },
                    {
                        "value": "中山区",
                        "label": "中山区",
                        "num": "710103"
                    },
                    {
                        "value": "松山区",
                        "label": "松山区",
                        "num": "710104"
                    },
                    {
                        "value": "大安区",
                        "label": "大安区",
                        "num": "710105"
                    },
                    {
                        "value": "万华区",
                        "label": "万华区",
                        "num": "710106"
                    },
                    {
                        "value": "信义区",
                        "label": "信义区",
                        "num": "710107"
                    },
                    {
                        "value": "士林区",
                        "label": "士林区",
                        "num": "710108"
                    },
                    {
                        "value": "北投区",
                        "label": "北投区",
                        "num": "710109"
                    },
                    {
                        "value": "内湖区",
                        "label": "内湖区",
                        "num": "710110"
                    },
                    {
                        "value": "南港区",
                        "label": "南港区",
                        "num": "710111"
                    },
                    {
                        "value": "文山区",
                        "label": "文山区",
                        "num": "710112"
                    },
                    {
                        "value": "其它区",
                        "label": "其它区",
                        "num": "710199"
                    }
                ]
            },
            {
                "value": "高雄市",
                "label": "高雄市",
                "num": "710200",
                "children": [{
                        "value": "新兴区",
                        "label": "新兴区",
                        "num": "710201"
                    },
                    {
                        "value": "前金区",
                        "label": "前金区",
                        "num": "710202"
                    },
                    {
                        "value": "芩雅区",
                        "label": "芩雅区",
                        "num": "710203"
                    },
                    {
                        "value": "盐埕区",
                        "label": "盐埕区",
                        "num": "710204"
                    },
                    {
                        "value": "鼓山区",
                        "label": "鼓山区",
                        "num": "710205"
                    },
                    {
                        "value": "旗津区",
                        "label": "旗津区",
                        "num": "710206"
                    },
                    {
                        "value": "前镇区",
                        "label": "前镇区",
                        "num": "710207"
                    },
                    {
                        "value": "三民区",
                        "label": "三民区",
                        "num": "710208"
                    },
                    {
                        "value": "左营区",
                        "label": "左营区",
                        "num": "710209"
                    },
                    {
                        "value": "楠梓区",
                        "label": "楠梓区",
                        "num": "710210"
                    },
                    {
                        "value": "小港区",
                        "label": "小港区",
                        "num": "710211"
                    },
                    {
                        "value": "苓雅区",
                        "label": "苓雅区",
                        "num": "710241"
                    },
                    {
                        "value": "仁武区",
                        "label": "仁武区",
                        "num": "710242"
                    },
                    {
                        "value": "大社区",
                        "label": "大社区",
                        "num": "710243"
                    },
                    {
                        "value": "冈山区",
                        "label": "冈山区",
                        "num": "710244"
                    },
                    {
                        "value": "路竹区",
                        "label": "路竹区",
                        "num": "710245"
                    },
                    {
                        "value": "阿莲区",
                        "label": "阿莲区",
                        "num": "710246"
                    },
                    {
                        "value": "田寮区",
                        "label": "田寮区",
                        "num": "710247"
                    },
                    {
                        "value": "燕巢区",
                        "label": "燕巢区",
                        "num": "710248"
                    },
                    {
                        "value": "桥头区",
                        "label": "桥头区",
                        "num": "710249"
                    },
                    {
                        "value": "梓官区",
                        "label": "梓官区",
                        "num": "710250"
                    },
                    {
                        "value": "弥陀区",
                        "label": "弥陀区",
                        "num": "710251"
                    },
                    {
                        "value": "永安区",
                        "label": "永安区",
                        "num": "710252"
                    },
                    {
                        "value": "湖内区",
                        "label": "湖内区",
                        "num": "710253"
                    },
                    {
                        "value": "凤山区",
                        "label": "凤山区",
                        "num": "710254"
                    },
                    {
                        "value": "大寮区",
                        "label": "大寮区",
                        "num": "710255"
                    },
                    {
                        "value": "林园区",
                        "label": "林园区",
                        "num": "710256"
                    },
                    {
                        "value": "鸟松区",
                        "label": "鸟松区",
                        "num": "710257"
                    },
                    {
                        "value": "大树区",
                        "label": "大树区",
                        "num": "710258"
                    },
                    {
                        "value": "旗山区",
                        "label": "旗山区",
                        "num": "710259"
                    },
                    {
                        "value": "美浓区",
                        "label": "美浓区",
                        "num": "710260"
                    },
                    {
                        "value": "六龟区",
                        "label": "六龟区",
                        "num": "710261"
                    },
                    {
                        "value": "内门区",
                        "label": "内门区",
                        "num": "710262"
                    },
                    {
                        "value": "杉林区",
                        "label": "杉林区",
                        "num": "710263"
                    },
                    {
                        "value": "甲仙区",
                        "label": "甲仙区",
                        "num": "710264"
                    },
                    {
                        "value": "桃源区",
                        "label": "桃源区",
                        "num": "710265"
                    },
                    {
                        "value": "那玛夏区",
                        "label": "那玛夏区",
                        "num": "710266"
                    },
                    {
                        "value": "茂林区",
                        "label": "茂林区",
                        "num": "710267"
                    },
                    {
                        "value": "茄萣区",
                        "label": "茄萣区",
                        "num": "710268"
                    },
                    {
                        "value": "其它区",
                        "label": "其它区",
                        "num": "710299"
                    }
                ]
            },
            {
                "value": "台南市",
                "label": "台南市",
                "num": "710300",
                "children": [{
                        "value": "中西区",
                        "label": "中西区",
                        "num": "710301"
                    },
                    {
                        "value": "东区",
                        "label": "东区",
                        "num": "710302"
                    },
                    {
                        "value": "南区",
                        "label": "南区",
                        "num": "710303"
                    },
                    {
                        "value": "北区",
                        "label": "北区",
                        "num": "710304"
                    },
                    {
                        "value": "安平区",
                        "label": "安平区",
                        "num": "710305"
                    },
                    {
                        "value": "安南区",
                        "label": "安南区",
                        "num": "710306"
                    },
                    {
                        "value": "永康区",
                        "label": "永康区",
                        "num": "710339"
                    },
                    {
                        "value": "归仁区",
                        "label": "归仁区",
                        "num": "710340"
                    },
                    {
                        "value": "新化区",
                        "label": "新化区",
                        "num": "710341"
                    },
                    {
                        "value": "左镇区",
                        "label": "左镇区",
                        "num": "710342"
                    },
                    {
                        "value": "玉井区",
                        "label": "玉井区",
                        "num": "710343"
                    },
                    {
                        "value": "楠西区",
                        "label": "楠西区",
                        "num": "710344"
                    },
                    {
                        "value": "南化区",
                        "label": "南化区",
                        "num": "710345"
                    },
                    {
                        "value": "仁德区",
                        "label": "仁德区",
                        "num": "710346"
                    },
                    {
                        "value": "关庙区",
                        "label": "关庙区",
                        "num": "710347"
                    },
                    {
                        "value": "龙崎区",
                        "label": "龙崎区",
                        "num": "710348"
                    },
                    {
                        "value": "官田区",
                        "label": "官田区",
                        "num": "710349"
                    },
                    {
                        "value": "麻豆区",
                        "label": "麻豆区",
                        "num": "710350"
                    },
                    {
                        "value": "佳里区",
                        "label": "佳里区",
                        "num": "710351"
                    },
                    {
                        "value": "西港区",
                        "label": "西港区",
                        "num": "710352"
                    },
                    {
                        "value": "七股区",
                        "label": "七股区",
                        "num": "710353"
                    },
                    {
                        "value": "将军区",
                        "label": "将军区",
                        "num": "710354"
                    },
                    {
                        "value": "学甲区",
                        "label": "学甲区",
                        "num": "710355"
                    },
                    {
                        "value": "北门区",
                        "label": "北门区",
                        "num": "710356"
                    },
                    {
                        "value": "新营区",
                        "label": "新营区",
                        "num": "710357"
                    },
                    {
                        "value": "后壁区",
                        "label": "后壁区",
                        "num": "710358"
                    },
                    {
                        "value": "白河区",
                        "label": "白河区",
                        "num": "710359"
                    },
                    {
                        "value": "东山区",
                        "label": "东山区",
                        "num": "710360"
                    },
                    {
                        "value": "六甲区",
                        "label": "六甲区",
                        "num": "710361"
                    },
                    {
                        "value": "下营区",
                        "label": "下营区",
                        "num": "710362"
                    },
                    {
                        "value": "柳营区",
                        "label": "柳营区",
                        "num": "710363"
                    },
                    {
                        "value": "盐水区",
                        "label": "盐水区",
                        "num": "710364"
                    },
                    {
                        "value": "善化区",
                        "label": "善化区",
                        "num": "710365"
                    },
                    {
                        "value": "大内区",
                        "label": "大内区",
                        "num": "710366"
                    },
                    {
                        "value": "山上区",
                        "label": "山上区",
                        "num": "710367"
                    },
                    {
                        "value": "新市区",
                        "label": "新市区",
                        "num": "710368"
                    },
                    {
                        "value": "安定区",
                        "label": "安定区",
                        "num": "710369"
                    },
                    {
                        "value": "其它区",
                        "label": "其它区",
                        "num": "710399"
                    }
                ]
            },
            {
                "value": "台中市",
                "label": "台中市",
                "num": "710400",
                "children": [{
                        "value": "中区",
                        "label": "中区",
                        "num": "710401"
                    },
                    {
                        "value": "东区",
                        "label": "东区",
                        "num": "710402"
                    },
                    {
                        "value": "南区",
                        "label": "南区",
                        "num": "710403"
                    },
                    {
                        "value": "西区",
                        "label": "西区",
                        "num": "710404"
                    },
                    {
                        "value": "北区",
                        "label": "北区",
                        "num": "710405"
                    },
                    {
                        "value": "北屯区",
                        "label": "北屯区",
                        "num": "710406"
                    },
                    {
                        "value": "西屯区",
                        "label": "西屯区",
                        "num": "710407"
                    },
                    {
                        "value": "南屯区",
                        "label": "南屯区",
                        "num": "710408"
                    },
                    {
                        "value": "太平区",
                        "label": "太平区",
                        "num": "710431"
                    },
                    {
                        "value": "大里区",
                        "label": "大里区",
                        "num": "710432"
                    },
                    {
                        "value": "雾峰区",
                        "label": "雾峰区",
                        "num": "710433"
                    },
                    {
                        "value": "乌日区",
                        "label": "乌日区",
                        "num": "710434"
                    },
                    {
                        "value": "丰原区",
                        "label": "丰原区",
                        "num": "710435"
                    },
                    {
                        "value": "后里区",
                        "label": "后里区",
                        "num": "710436"
                    },
                    {
                        "value": "石冈区",
                        "label": "石冈区",
                        "num": "710437"
                    },
                    {
                        "value": "东势区",
                        "label": "东势区",
                        "num": "710438"
                    },
                    {
                        "value": "和平区",
                        "label": "和平区",
                        "num": "710439"
                    },
                    {
                        "value": "新社区",
                        "label": "新社区",
                        "num": "710440"
                    },
                    {
                        "value": "潭子区",
                        "label": "潭子区",
                        "num": "710441"
                    },
                    {
                        "value": "大雅区",
                        "label": "大雅区",
                        "num": "710442"
                    },
                    {
                        "value": "神冈区",
                        "label": "神冈区",
                        "num": "710443"
                    },
                    {
                        "value": "大肚区",
                        "label": "大肚区",
                        "num": "710444"
                    },
                    {
                        "value": "沙鹿区",
                        "label": "沙鹿区",
                        "num": "710445"
                    },
                    {
                        "value": "龙井区",
                        "label": "龙井区",
                        "num": "710446"
                    },
                    {
                        "value": "梧栖区",
                        "label": "梧栖区",
                        "num": "710447"
                    },
                    {
                        "value": "清水区",
                        "label": "清水区",
                        "num": "710448"
                    },
                    {
                        "value": "大甲区",
                        "label": "大甲区",
                        "num": "710449"
                    },
                    {
                        "value": "外埔区",
                        "label": "外埔区",
                        "num": "710450"
                    },
                    {
                        "value": "大安区",
                        "label": "大安区",
                        "num": "710451"
                    },
                    {
                        "value": "其它区",
                        "label": "其它区",
                        "num": "710499"
                    }
                ]
            },
            {
                "value": "金门县",
                "label": "金门县",
                "num": "710500",
                "children": [{
                        "value": "金沙镇",
                        "label": "金沙镇",
                        "num": "710507"
                    },
                    {
                        "value": "金湖镇",
                        "label": "金湖镇",
                        "num": "710508"
                    },
                    {
                        "value": "金宁乡",
                        "label": "金宁乡",
                        "num": "710509"
                    },
                    {
                        "value": "金城镇",
                        "label": "金城镇",
                        "num": "710510"
                    },
                    {
                        "value": "烈屿乡",
                        "label": "烈屿乡",
                        "num": "710511"
                    },
                    {
                        "value": "乌坵乡",
                        "label": "乌坵乡",
                        "num": "710512"
                    }
                ]
            },
            {
                "value": "南投县",
                "label": "南投县",
                "num": "710600",
                "children": [{
                        "value": "南投市",
                        "label": "南投市",
                        "num": "710614"
                    },
                    {
                        "value": "中寮乡",
                        "label": "中寮乡",
                        "num": "710615"
                    },
                    {
                        "value": "草屯镇",
                        "label": "草屯镇",
                        "num": "710616"
                    },
                    {
                        "value": "国姓乡",
                        "label": "国姓乡",
                        "num": "710617"
                    },
                    {
                        "value": "埔里镇",
                        "label": "埔里镇",
                        "num": "710618"
                    },
                    {
                        "value": "仁爱乡",
                        "label": "仁爱乡",
                        "num": "710619"
                    },
                    {
                        "value": "名间乡",
                        "label": "名间乡",
                        "num": "710620"
                    },
                    {
                        "value": "集集镇",
                        "label": "集集镇",
                        "num": "710621"
                    },
                    {
                        "value": "水里乡",
                        "label": "水里乡",
                        "num": "710622"
                    },
                    {
                        "value": "鱼池乡",
                        "label": "鱼池乡",
                        "num": "710623"
                    },
                    {
                        "value": "信义乡",
                        "label": "信义乡",
                        "num": "710624"
                    },
                    {
                        "value": "竹山镇",
                        "label": "竹山镇",
                        "num": "710625"
                    },
                    {
                        "value": "鹿谷乡",
                        "label": "鹿谷乡",
                        "num": "710626"
                    }
                ]
            },
            {
                "value": "基隆市",
                "label": "基隆市",
                "num": "710700",
                "children": [{
                        "value": "仁爱区",
                        "label": "仁爱区",
                        "num": "710701"
                    },
                    {
                        "value": "信义区",
                        "label": "信义区",
                        "num": "710702"
                    },
                    {
                        "value": "中正区",
                        "label": "中正区",
                        "num": "710703"
                    },
                    {
                        "value": "中山区",
                        "label": "中山区",
                        "num": "710704"
                    },
                    {
                        "value": "安乐区",
                        "label": "安乐区",
                        "num": "710705"
                    },
                    {
                        "value": "暖暖区",
                        "label": "暖暖区",
                        "num": "710706"
                    },
                    {
                        "value": "七堵区",
                        "label": "七堵区",
                        "num": "710707"
                    },
                    {
                        "value": "其它区",
                        "label": "其它区",
                        "num": "710799"
                    }
                ]
            },
            {
                "value": "新竹市",
                "label": "新竹市",
                "num": "710800",
                "children": [{
                        "value": "东区",
                        "label": "东区",
                        "num": "710801"
                    },
                    {
                        "value": "北区",
                        "label": "北区",
                        "num": "710802"
                    },
                    {
                        "value": "香山区",
                        "label": "香山区",
                        "num": "710803"
                    },
                    {
                        "value": "其它区",
                        "label": "其它区",
                        "num": "710899"
                    }
                ]
            },
            {
                "value": "嘉义市",
                "label": "嘉义市",
                "num": "710900",
                "children": [{
                        "value": "东区",
                        "label": "东区",
                        "num": "710901"
                    },
                    {
                        "value": "西区",
                        "label": "西区",
                        "num": "710902"
                    },
                    {
                        "value": "其它区",
                        "label": "其它区",
                        "num": "710999"
                    }
                ]
            },
            {
                "value": "新北市",
                "label": "新北市",
                "num": "711100",
                "children": [{
                        "value": "万里区",
                        "label": "万里区",
                        "num": "711130"
                    },
                    {
                        "value": "板桥区",
                        "label": "板桥区",
                        "num": "711132"
                    },
                    {
                        "value": "汐止区",
                        "label": "汐止区",
                        "num": "711133"
                    },
                    {
                        "value": "深坑区",
                        "label": "深坑区",
                        "num": "711134"
                    },
                    {
                        "value": "石碇区",
                        "label": "石碇区",
                        "num": "711135"
                    },
                    {
                        "value": "瑞芳区",
                        "label": "瑞芳区",
                        "num": "711136"
                    },
                    {
                        "value": "平溪区",
                        "label": "平溪区",
                        "num": "711137"
                    },
                    {
                        "value": "双溪区",
                        "label": "双溪区",
                        "num": "711138"
                    },
                    {
                        "value": "贡寮区",
                        "label": "贡寮区",
                        "num": "711139"
                    },
                    {
                        "value": "新店区",
                        "label": "新店区",
                        "num": "711140"
                    },
                    {
                        "value": "坪林区",
                        "label": "坪林区",
                        "num": "711141"
                    },
                    {
                        "value": "乌来区",
                        "label": "乌来区",
                        "num": "711142"
                    },
                    {
                        "value": "永和区",
                        "label": "永和区",
                        "num": "711143"
                    },
                    {
                        "value": "中和区",
                        "label": "中和区",
                        "num": "711144"
                    },
                    {
                        "value": "土城区",
                        "label": "土城区",
                        "num": "711145"
                    },
                    {
                        "value": "三峡区",
                        "label": "三峡区",
                        "num": "711146"
                    },
                    {
                        "value": "树林区",
                        "label": "树林区",
                        "num": "711147"
                    },
                    {
                        "value": "莺歌区",
                        "label": "莺歌区",
                        "num": "711148"
                    },
                    {
                        "value": "三重区",
                        "label": "三重区",
                        "num": "711149"
                    },
                    {
                        "value": "新庄区",
                        "label": "新庄区",
                        "num": "711150"
                    },
                    {
                        "value": "泰山区",
                        "label": "泰山区",
                        "num": "711151"
                    },
                    {
                        "value": "林口区",
                        "label": "林口区",
                        "num": "711152"
                    },
                    {
                        "value": "芦洲区",
                        "label": "芦洲区",
                        "num": "711153"
                    },
                    {
                        "value": "五股区",
                        "label": "五股区",
                        "num": "711154"
                    },
                    {
                        "value": "八里区",
                        "label": "八里区",
                        "num": "711155"
                    },
                    {
                        "value": "淡水区",
                        "label": "淡水区",
                        "num": "711156"
                    },
                    {
                        "value": "三芝区",
                        "label": "三芝区",
                        "num": "711157"
                    },
                    {
                        "value": "石门区",
                        "label": "石门区",
                        "num": "711158"
                    }
                ]
            },
            {
                "value": "宜兰县",
                "label": "宜兰县",
                "num": "711200",
                "children": [{
                        "value": "宜兰市",
                        "label": "宜兰市",
                        "num": "711287"
                    },
                    {
                        "value": "头城镇",
                        "label": "头城镇",
                        "num": "711288"
                    },
                    {
                        "value": "礁溪乡",
                        "label": "礁溪乡",
                        "num": "711289"
                    },
                    {
                        "value": "壮围乡",
                        "label": "壮围乡",
                        "num": "711290"
                    },
                    {
                        "value": "员山乡",
                        "label": "员山乡",
                        "num": "711291"
                    },
                    {
                        "value": "罗东镇",
                        "label": "罗东镇",
                        "num": "711292"
                    },
                    {
                        "value": "三星乡",
                        "label": "三星乡",
                        "num": "711293"
                    },
                    {
                        "value": "大同乡",
                        "label": "大同乡",
                        "num": "711294"
                    },
                    {
                        "value": "五结乡",
                        "label": "五结乡",
                        "num": "711295"
                    },
                    {
                        "value": "冬山乡",
                        "label": "冬山乡",
                        "num": "711296"
                    },
                    {
                        "value": "苏澳镇",
                        "label": "苏澳镇",
                        "num": "711297"
                    },
                    {
                        "value": "南澳乡",
                        "label": "南澳乡",
                        "num": "711298"
                    },
                    {
                        "value": "钓鱼台",
                        "label": "钓鱼台",
                        "num": "711299"
                    }
                ]
            },
            {
                "value": "新竹县",
                "label": "新竹县",
                "num": "711300",
                "children": [{
                        "value": "竹北市",
                        "label": "竹北市",
                        "num": "711387"
                    },
                    {
                        "value": "湖口乡",
                        "label": "湖口乡",
                        "num": "711388"
                    },
                    {
                        "value": "新丰乡",
                        "label": "新丰乡",
                        "num": "711389"
                    },
                    {
                        "value": "新埔镇",
                        "label": "新埔镇",
                        "num": "711390"
                    },
                    {
                        "value": "关西镇",
                        "label": "关西镇",
                        "num": "711391"
                    },
                    {
                        "value": "芎林乡",
                        "label": "芎林乡",
                        "num": "711392"
                    },
                    {
                        "value": "宝山乡",
                        "label": "宝山乡",
                        "num": "711393"
                    },
                    {
                        "value": "竹东镇",
                        "label": "竹东镇",
                        "num": "711394"
                    },
                    {
                        "value": "五峰乡",
                        "label": "五峰乡",
                        "num": "711395"
                    },
                    {
                        "value": "横山乡",
                        "label": "横山乡",
                        "num": "711396"
                    },
                    {
                        "value": "尖石乡",
                        "label": "尖石乡",
                        "num": "711397"
                    },
                    {
                        "value": "北埔乡",
                        "label": "北埔乡",
                        "num": "711398"
                    },
                    {
                        "value": "峨眉乡",
                        "label": "峨眉乡",
                        "num": "711399"
                    }
                ]
            },
            {
                "value": "桃园县",
                "label": "桃园县",
                "num": "711400",
                "children": [{
                        "value": "中坜区",
                        "label": "中坜区",
                        "num": "711414"
                    },
                    {
                        "value": "平镇区",
                        "label": "平镇区",
                        "num": "711415"
                    },
                    {
                        "value": "杨梅区",
                        "label": "杨梅区",
                        "num": "711417"
                    },
                    {
                        "value": "新屋区",
                        "label": "新屋区",
                        "num": "711418"
                    },
                    {
                        "value": "观音区",
                        "label": "观音区",
                        "num": "711419"
                    },
                    {
                        "value": "桃园区",
                        "label": "桃园区",
                        "num": "711420"
                    },
                    {
                        "value": "龟山区",
                        "label": "龟山区",
                        "num": "711421"
                    },
                    {
                        "value": "八德区",
                        "label": "八德区",
                        "num": "711422"
                    },
                    {
                        "value": "大溪区",
                        "label": "大溪区",
                        "num": "711423"
                    },
                    {
                        "value": "大园区",
                        "label": "大园区",
                        "num": "711425"
                    },
                    {
                        "value": "芦竹区",
                        "label": "芦竹区",
                        "num": "711426"
                    },
                    {
                        "value": "中坜市",
                        "label": "中坜市",
                        "num": "711487"
                    },
                    {
                        "value": "平镇市",
                        "label": "平镇市",
                        "num": "711488"
                    },
                    {
                        "value": "龙潭乡",
                        "label": "龙潭乡",
                        "num": "711489"
                    },
                    {
                        "value": "杨梅市",
                        "label": "杨梅市",
                        "num": "711490"
                    },
                    {
                        "value": "新屋乡",
                        "label": "新屋乡",
                        "num": "711491"
                    },
                    {
                        "value": "观音乡",
                        "label": "观音乡",
                        "num": "711492"
                    },
                    {
                        "value": "桃园市",
                        "label": "桃园市",
                        "num": "711493"
                    },
                    {
                        "value": "龟山乡",
                        "label": "龟山乡",
                        "num": "711494"
                    },
                    {
                        "value": "八德市",
                        "label": "八德市",
                        "num": "711495"
                    },
                    {
                        "value": "大溪镇",
                        "label": "大溪镇",
                        "num": "711496"
                    },
                    {
                        "value": "复兴乡",
                        "label": "复兴乡",
                        "num": "711497"
                    },
                    {
                        "value": "大园乡",
                        "label": "大园乡",
                        "num": "711498"
                    },
                    {
                        "value": "芦竹乡",
                        "label": "芦竹乡",
                        "num": "711499"
                    }
                ]
            },
            {
                "value": "苗栗县",
                "label": "苗栗县",
                "num": "711500",
                "children": [{
                        "value": "头份市",
                        "label": "头份市",
                        "num": "711520"
                    },
                    {
                        "value": "竹南镇",
                        "label": "竹南镇",
                        "num": "711582"
                    },
                    {
                        "value": "头份镇",
                        "label": "头份镇",
                        "num": "711583"
                    },
                    {
                        "value": "三湾乡",
                        "label": "三湾乡",
                        "num": "711584"
                    },
                    {
                        "value": "南庄乡",
                        "label": "南庄乡",
                        "num": "711585"
                    },
                    {
                        "value": "狮潭乡",
                        "label": "狮潭乡",
                        "num": "711586"
                    },
                    {
                        "value": "后龙镇",
                        "label": "后龙镇",
                        "num": "711587"
                    },
                    {
                        "value": "通霄镇",
                        "label": "通霄镇",
                        "num": "711588"
                    },
                    {
                        "value": "苑里镇",
                        "label": "苑里镇",
                        "num": "711589"
                    },
                    {
                        "value": "苗栗市",
                        "label": "苗栗市",
                        "num": "711590"
                    },
                    {
                        "value": "造桥乡",
                        "label": "造桥乡",
                        "num": "711591"
                    },
                    {
                        "value": "头屋乡",
                        "label": "头屋乡",
                        "num": "711592"
                    },
                    {
                        "value": "公馆乡",
                        "label": "公馆乡",
                        "num": "711593"
                    },
                    {
                        "value": "大湖乡",
                        "label": "大湖乡",
                        "num": "711594"
                    },
                    {
                        "value": "泰安乡",
                        "label": "泰安乡",
                        "num": "711595"
                    },
                    {
                        "value": "铜锣乡",
                        "label": "铜锣乡",
                        "num": "711596"
                    },
                    {
                        "value": "三义乡",
                        "label": "三义乡",
                        "num": "711597"
                    },
                    {
                        "value": "西湖乡",
                        "label": "西湖乡",
                        "num": "711598"
                    },
                    {
                        "value": "卓兰镇",
                        "label": "卓兰镇",
                        "num": "711599"
                    }
                ]
            },
            {
                "value": "彰化县",
                "label": "彰化县",
                "num": "711700",
                "children": [{
                        "value": "员林市",
                        "label": "员林市",
                        "num": "711736"
                    },
                    {
                        "value": "彰化市",
                        "label": "彰化市",
                        "num": "711774"
                    },
                    {
                        "value": "芬园乡",
                        "label": "芬园乡",
                        "num": "711775"
                    },
                    {
                        "value": "花坛乡",
                        "label": "花坛乡",
                        "num": "711776"
                    },
                    {
                        "value": "秀水乡",
                        "label": "秀水乡",
                        "num": "711777"
                    },
                    {
                        "value": "鹿港镇",
                        "label": "鹿港镇",
                        "num": "711778"
                    },
                    {
                        "value": "福兴乡",
                        "label": "福兴乡",
                        "num": "711779"
                    },
                    {
                        "value": "线西乡",
                        "label": "线西乡",
                        "num": "711780"
                    },
                    {
                        "value": "和美镇",
                        "label": "和美镇",
                        "num": "711781"
                    },
                    {
                        "value": "伸港乡",
                        "label": "伸港乡",
                        "num": "711782"
                    },
                    {
                        "value": "员林镇",
                        "label": "员林镇",
                        "num": "711783"
                    },
                    {
                        "value": "社头乡",
                        "label": "社头乡",
                        "num": "711784"
                    },
                    {
                        "value": "永靖乡",
                        "label": "永靖乡",
                        "num": "711785"
                    },
                    {
                        "value": "埔心乡",
                        "label": "埔心乡",
                        "num": "711786"
                    },
                    {
                        "value": "溪湖镇",
                        "label": "溪湖镇",
                        "num": "711787"
                    },
                    {
                        "value": "大村乡",
                        "label": "大村乡",
                        "num": "711788"
                    },
                    {
                        "value": "埔盐乡",
                        "label": "埔盐乡",
                        "num": "711789"
                    },
                    {
                        "value": "田中镇",
                        "label": "田中镇",
                        "num": "711790"
                    },
                    {
                        "value": "北斗镇",
                        "label": "北斗镇",
                        "num": "711791"
                    },
                    {
                        "value": "田尾乡",
                        "label": "田尾乡",
                        "num": "711792"
                    },
                    {
                        "value": "埤头乡",
                        "label": "埤头乡",
                        "num": "711793"
                    },
                    {
                        "value": "溪州乡",
                        "label": "溪州乡",
                        "num": "711794"
                    },
                    {
                        "value": "竹塘乡",
                        "label": "竹塘乡",
                        "num": "711795"
                    },
                    {
                        "value": "二林镇",
                        "label": "二林镇",
                        "num": "711796"
                    },
                    {
                        "value": "大城乡",
                        "label": "大城乡",
                        "num": "711797"
                    },
                    {
                        "value": "芳苑乡",
                        "label": "芳苑乡",
                        "num": "711798"
                    },
                    {
                        "value": "二水乡",
                        "label": "二水乡",
                        "num": "711799"
                    }
                ]
            },
            {
                "value": "嘉义县",
                "label": "嘉义县",
                "num": "711900",
                "children": [{
                        "value": "番路乡",
                        "label": "番路乡",
                        "num": "711982"
                    },
                    {
                        "value": "梅山乡",
                        "label": "梅山乡",
                        "num": "711983"
                    },
                    {
                        "value": "竹崎乡",
                        "label": "竹崎乡",
                        "num": "711984"
                    },
                    {
                        "value": "阿里山乡",
                        "label": "阿里山乡",
                        "num": "711985"
                    },
                    {
                        "value": "中埔乡",
                        "label": "中埔乡",
                        "num": "711986"
                    },
                    {
                        "value": "大埔乡",
                        "label": "大埔乡",
                        "num": "711987"
                    },
                    {
                        "value": "水上乡",
                        "label": "水上乡",
                        "num": "711988"
                    },
                    {
                        "value": "鹿草乡",
                        "label": "鹿草乡",
                        "num": "711989"
                    },
                    {
                        "value": "太保市",
                        "label": "太保市",
                        "num": "711990"
                    },
                    {
                        "value": "朴子市",
                        "label": "朴子市",
                        "num": "711991"
                    },
                    {
                        "value": "东石乡",
                        "label": "东石乡",
                        "num": "711992"
                    },
                    {
                        "value": "六脚乡",
                        "label": "六脚乡",
                        "num": "711993"
                    },
                    {
                        "value": "新港乡",
                        "label": "新港乡",
                        "num": "711994"
                    },
                    {
                        "value": "民雄乡",
                        "label": "民雄乡",
                        "num": "711995"
                    },
                    {
                        "value": "大林镇",
                        "label": "大林镇",
                        "num": "711996"
                    },
                    {
                        "value": "溪口乡",
                        "label": "溪口乡",
                        "num": "711997"
                    },
                    {
                        "value": "义竹乡",
                        "label": "义竹乡",
                        "num": "711998"
                    },
                    {
                        "value": "布袋镇",
                        "label": "布袋镇",
                        "num": "711999"
                    }
                ]
            },
            {
                "value": "云林县",
                "label": "云林县",
                "num": "712100",
                "children": [{
                        "value": "斗南镇",
                        "label": "斗南镇",
                        "num": "712180"
                    },
                    {
                        "value": "大埤乡",
                        "label": "大埤乡",
                        "num": "712181"
                    },
                    {
                        "value": "虎尾镇",
                        "label": "虎尾镇",
                        "num": "712182"
                    },
                    {
                        "value": "土库镇",
                        "label": "土库镇",
                        "num": "712183"
                    },
                    {
                        "value": "褒忠乡",
                        "label": "褒忠乡",
                        "num": "712184"
                    },
                    {
                        "value": "东势乡",
                        "label": "东势乡",
                        "num": "712185"
                    },
                    {
                        "value": "台西乡",
                        "label": "台西乡",
                        "num": "712186"
                    },
                    {
                        "value": "仑背乡",
                        "label": "仑背乡",
                        "num": "712187"
                    },
                    {
                        "value": "麦寮乡",
                        "label": "麦寮乡",
                        "num": "712188"
                    },
                    {
                        "value": "斗六市",
                        "label": "斗六市",
                        "num": "712189"
                    },
                    {
                        "value": "林内乡",
                        "label": "林内乡",
                        "num": "712190"
                    },
                    {
                        "value": "古坑乡",
                        "label": "古坑乡",
                        "num": "712191"
                    },
                    {
                        "value": "莿桐乡",
                        "label": "莿桐乡",
                        "num": "712192"
                    },
                    {
                        "value": "西螺镇",
                        "label": "西螺镇",
                        "num": "712193"
                    },
                    {
                        "value": "二仑乡",
                        "label": "二仑乡",
                        "num": "712194"
                    },
                    {
                        "value": "北港镇",
                        "label": "北港镇",
                        "num": "712195"
                    },
                    {
                        "value": "水林乡",
                        "label": "水林乡",
                        "num": "712196"
                    },
                    {
                        "value": "口湖乡",
                        "label": "口湖乡",
                        "num": "712197"
                    },
                    {
                        "value": "四湖乡",
                        "label": "四湖乡",
                        "num": "712198"
                    },
                    {
                        "value": "元长乡",
                        "label": "元长乡",
                        "num": "712199"
                    }
                ]
            },
            {
                "value": "屏东县",
                "label": "屏东县",
                "num": "712400",
                "children": [{
                        "value": "崁顶乡",
                        "label": "崁顶乡",
                        "num": "712451"
                    },
                    {
                        "value": "屏东市",
                        "label": "屏东市",
                        "num": "712467"
                    },
                    {
                        "value": "三地门乡",
                        "label": "三地门乡",
                        "num": "712468"
                    },
                    {
                        "value": "雾台乡",
                        "label": "雾台乡",
                        "num": "712469"
                    },
                    {
                        "value": "玛家乡",
                        "label": "玛家乡",
                        "num": "712470"
                    },
                    {
                        "value": "九如乡",
                        "label": "九如乡",
                        "num": "712471"
                    },
                    {
                        "value": "里港乡",
                        "label": "里港乡",
                        "num": "712472"
                    },
                    {
                        "value": "高树乡",
                        "label": "高树乡",
                        "num": "712473"
                    },
                    {
                        "value": "盐埔乡",
                        "label": "盐埔乡",
                        "num": "712474"
                    },
                    {
                        "value": "长治乡",
                        "label": "长治乡",
                        "num": "712475"
                    },
                    {
                        "value": "麟洛乡",
                        "label": "麟洛乡",
                        "num": "712476"
                    },
                    {
                        "value": "竹田乡",
                        "label": "竹田乡",
                        "num": "712477"
                    },
                    {
                        "value": "内埔乡",
                        "label": "内埔乡",
                        "num": "712478"
                    },
                    {
                        "value": "万丹乡",
                        "label": "万丹乡",
                        "num": "712479"
                    },
                    {
                        "value": "潮州镇",
                        "label": "潮州镇",
                        "num": "712480"
                    },
                    {
                        "value": "泰武乡",
                        "label": "泰武乡",
                        "num": "712481"
                    },
                    {
                        "value": "来义乡",
                        "label": "来义乡",
                        "num": "712482"
                    },
                    {
                        "value": "万峦乡",
                        "label": "万峦乡",
                        "num": "712483"
                    },
                    {
                        "value": "莰顶乡",
                        "label": "莰顶乡",
                        "num": "712484"
                    },
                    {
                        "value": "新埤乡",
                        "label": "新埤乡",
                        "num": "712485"
                    },
                    {
                        "value": "南州乡",
                        "label": "南州乡",
                        "num": "712486"
                    },
                    {
                        "value": "林边乡",
                        "label": "林边乡",
                        "num": "712487"
                    },
                    {
                        "value": "东港镇",
                        "label": "东港镇",
                        "num": "712488"
                    },
                    {
                        "value": "琉球乡",
                        "label": "琉球乡",
                        "num": "712489"
                    },
                    {
                        "value": "佳冬乡",
                        "label": "佳冬乡",
                        "num": "712490"
                    },
                    {
                        "value": "新园乡",
                        "label": "新园乡",
                        "num": "712491"
                    },
                    {
                        "value": "枋寮乡",
                        "label": "枋寮乡",
                        "num": "712492"
                    },
                    {
                        "value": "枋山乡",
                        "label": "枋山乡",
                        "num": "712493"
                    },
                    {
                        "value": "春日乡",
                        "label": "春日乡",
                        "num": "712494"
                    },
                    {
                        "value": "狮子乡",
                        "label": "狮子乡",
                        "num": "712495"
                    },
                    {
                        "value": "车城乡",
                        "label": "车城乡",
                        "num": "712496"
                    },
                    {
                        "value": "牡丹乡",
                        "label": "牡丹乡",
                        "num": "712497"
                    },
                    {
                        "value": "恒春镇",
                        "label": "恒春镇",
                        "num": "712498"
                    },
                    {
                        "value": "满州乡",
                        "label": "满州乡",
                        "num": "712499"
                    }
                ]
            },
            {
                "value": "台东县",
                "label": "台东县",
                "num": "712500",
                "children": [{
                        "value": "台东市",
                        "label": "台东市",
                        "num": "712584"
                    },
                    {
                        "value": "绿岛乡",
                        "label": "绿岛乡",
                        "num": "712585"
                    },
                    {
                        "value": "兰屿乡",
                        "label": "兰屿乡",
                        "num": "712586"
                    },
                    {
                        "value": "延平乡",
                        "label": "延平乡",
                        "num": "712587"
                    },
                    {
                        "value": "卑南乡",
                        "label": "卑南乡",
                        "num": "712588"
                    },
                    {
                        "value": "鹿野乡",
                        "label": "鹿野乡",
                        "num": "712589"
                    },
                    {
                        "value": "关山镇",
                        "label": "关山镇",
                        "num": "712590"
                    },
                    {
                        "value": "海端乡",
                        "label": "海端乡",
                        "num": "712591"
                    },
                    {
                        "value": "池上乡",
                        "label": "池上乡",
                        "num": "712592"
                    },
                    {
                        "value": "东河乡",
                        "label": "东河乡",
                        "num": "712593"
                    },
                    {
                        "value": "成功镇",
                        "label": "成功镇",
                        "num": "712594"
                    },
                    {
                        "value": "长滨乡",
                        "label": "长滨乡",
                        "num": "712595"
                    },
                    {
                        "value": "金峰乡",
                        "label": "金峰乡",
                        "num": "712596"
                    },
                    {
                        "value": "大武乡",
                        "label": "大武乡",
                        "num": "712597"
                    },
                    {
                        "value": "达仁乡",
                        "label": "达仁乡",
                        "num": "712598"
                    },
                    {
                        "value": "太麻里乡",
                        "label": "太麻里乡",
                        "num": "712599"
                    }
                ]
            },
            {
                "value": "花莲县",
                "label": "花莲县",
                "num": "712600",
                "children": [{
                        "value": "花莲市",
                        "label": "花莲市",
                        "num": "712686"
                    },
                    {
                        "value": "新城乡",
                        "label": "新城乡",
                        "num": "712687"
                    },
                    {
                        "value": "太鲁阁",
                        "label": "太鲁阁",
                        "num": "712688"
                    },
                    {
                        "value": "秀林乡",
                        "label": "秀林乡",
                        "num": "712689"
                    },
                    {
                        "value": "吉安乡",
                        "label": "吉安乡",
                        "num": "712690"
                    },
                    {
                        "value": "寿丰乡",
                        "label": "寿丰乡",
                        "num": "712691"
                    },
                    {
                        "value": "凤林镇",
                        "label": "凤林镇",
                        "num": "712692"
                    },
                    {
                        "value": "光复乡",
                        "label": "光复乡",
                        "num": "712693"
                    },
                    {
                        "value": "丰滨乡",
                        "label": "丰滨乡",
                        "num": "712694"
                    },
                    {
                        "value": "瑞穗乡",
                        "label": "瑞穗乡",
                        "num": "712695"
                    },
                    {
                        "value": "万荣乡",
                        "label": "万荣乡",
                        "num": "712696"
                    },
                    {
                        "value": "玉里镇",
                        "label": "玉里镇",
                        "num": "712697"
                    },
                    {
                        "value": "卓溪乡",
                        "label": "卓溪乡",
                        "num": "712698"
                    },
                    {
                        "value": "富里乡",
                        "label": "富里乡",
                        "num": "712699"
                    }
                ]
            },
            {
                "value": "澎湖县",
                "label": "澎湖县",
                "num": "712700",
                "children": [{
                        "value": "马公市",
                        "label": "马公市",
                        "num": "712794"
                    },
                    {
                        "value": "西屿乡",
                        "label": "西屿乡",
                        "num": "712795"
                    },
                    {
                        "value": "望安乡",
                        "label": "望安乡",
                        "num": "712796"
                    },
                    {
                        "value": "七美乡",
                        "label": "七美乡",
                        "num": "712797"
                    },
                    {
                        "value": "白沙乡",
                        "label": "白沙乡",
                        "num": "712798"
                    },
                    {
                        "value": "湖西乡",
                        "label": "湖西乡",
                        "num": "712799"
                    }
                ]
            },
            {
                "value": "连江县",
                "label": "连江县",
                "num": "712800",
                "children": [{
                        "value": "南竿乡",
                        "label": "南竿乡",
                        "num": "712896"
                    },
                    {
                        "value": "北竿乡",
                        "label": "北竿乡",
                        "num": "712897"
                    },
                    {
                        "value": "东引乡",
                        "label": "东引乡",
                        "num": "712898"
                    },
                    {
                        "value": "莒光乡",
                        "label": "莒光乡",
                        "num": "712899"
                    }
                ]
            }
        ]
    },
    {
        "value": "香港特别行政区",
        "label": "香港特别行政区",
        "num": "810000",
        "children": [{
                "value": "香港岛",
                "label": "香港岛",
                "num": "810100",
                "children": [{
                        "value": "中西区",
                        "label": "中西区",
                        "num": "810101"
                    },
                    {
                        "value": "湾仔区",
                        "label": "湾仔区",
                        "num": "810102"
                    },
                    {
                        "value": "东区",
                        "label": "东区",
                        "num": "810103"
                    },
                    {
                        "value": "南区",
                        "label": "南区",
                        "num": "810104"
                    }
                ]
            },
            {
                "value": "九龙",
                "label": "九龙",
                "num": "810200",
                "children": [{
                        "value": "九龙城区",
                        "label": "九龙城区",
                        "num": "810201"
                    },
                    {
                        "value": "油尖旺区",
                        "label": "油尖旺区",
                        "num": "810202"
                    },
                    {
                        "value": "深水埗区",
                        "label": "深水埗区",
                        "num": "810203"
                    },
                    {
                        "value": "黄大仙区",
                        "label": "黄大仙区",
                        "num": "810204"
                    },
                    {
                        "value": "观塘区",
                        "label": "观塘区",
                        "num": "810205"
                    }
                ]
            },
            {
                "value": "新界",
                "label": "新界",
                "num": "810300",
                "children": [{
                        "value": "北区",
                        "label": "北区",
                        "num": "810301"
                    },
                    {
                        "value": "大埔区",
                        "label": "大埔区",
                        "num": "810302"
                    },
                    {
                        "value": "沙田区",
                        "label": "沙田区",
                        "num": "810303"
                    },
                    {
                        "value": "西贡区",
                        "label": "西贡区",
                        "num": "810304"
                    },
                    {
                        "value": "元朗区",
                        "label": "元朗区",
                        "num": "810305"
                    },
                    {
                        "value": "屯门区",
                        "label": "屯门区",
                        "num": "810306"
                    },
                    {
                        "value": "荃湾区",
                        "label": "荃湾区",
                        "num": "810307"
                    },
                    {
                        "value": "葵青区",
                        "label": "葵青区",
                        "num": "810308"
                    },
                    {
                        "value": "离岛区",
                        "label": "离岛区",
                        "num": "810309"
                    }
                ]
            }
        ]
    },
    {
        "value": "澳门特别行政区",
        "label": "澳门特别行政区",
        "num": "820000",
        "children": [{
                "value": "澳门半岛",
                "label": "澳门半岛",
                "num": "820100",
                "children": [{
                    "value": "澳门半岛",
                    "label": "澳门半岛",
                    "num": "820101"
                }]
            },
            {
                "value": "离岛",
                "label": "离岛",
                "num": "820200",
                "children": [{
                    "value": "离岛",
                    "label": "离岛",
                    "num": "820201"
                }]
            }
        ]
    },
    {
        "value": "海外",
        "label": "海外",
        "num": "900000",
        "children": [{
                "value": "阿富汗",
                "label": "阿富汗",
                "num": "900400"
            },
            {
                "value": "阿尔巴尼亚",
                "label": "阿尔巴尼亚",
                "num": "900800"
            },
            {
                "value": "南极洲",
                "label": "南极洲",
                "num": "901000"
            },
            {
                "value": "阿尔及利亚",
                "label": "阿尔及利亚",
                "num": "901200"
            },
            {
                "value": "美属萨摩亚",
                "label": "美属萨摩亚",
                "num": "901600"
            },
            {
                "value": "安道尔",
                "label": "安道尔",
                "num": "902000"
            },
            {
                "value": "安哥拉",
                "label": "安哥拉",
                "num": "902400"
            },
            {
                "value": "安提瓜和巴布达",
                "label": "安提瓜和巴布达",
                "num": "902800"
            },
            {
                "value": "阿塞拜疆",
                "label": "阿塞拜疆",
                "num": "903100"
            },
            {
                "value": "阿根廷",
                "label": "阿根廷",
                "num": "903200"
            },
            {
                "value": "澳大利亚",
                "label": "澳大利亚",
                "num": "903600"
            },
            {
                "value": "奥地利",
                "label": "奥地利",
                "num": "904000"
            },
            {
                "value": "巴哈马",
                "label": "巴哈马",
                "num": "904400"
            },
            {
                "value": "巴林",
                "label": "巴林",
                "num": "904800"
            },
            {
                "value": "孟加拉",
                "label": "孟加拉",
                "num": "905000"
            },
            {
                "value": "亚美尼亚",
                "label": "亚美尼亚",
                "num": "905100"
            },
            {
                "value": "巴巴多斯",
                "label": "巴巴多斯",
                "num": "905200"
            },
            {
                "value": "比利时",
                "label": "比利时",
                "num": "905600"
            },
            {
                "value": "百慕大",
                "label": "百慕大",
                "num": "906000"
            },
            {
                "value": "不丹",
                "label": "不丹",
                "num": "906400"
            },
            {
                "value": "玻利维亚",
                "label": "玻利维亚",
                "num": "906800"
            },
            {
                "value": "波黑",
                "label": "波黑",
                "num": "907000"
            },
            {
                "value": "博茨瓦纳",
                "label": "博茨瓦纳",
                "num": "907200"
            },
            {
                "value": "布韦岛",
                "label": "布韦岛",
                "num": "907400"
            },
            {
                "value": "巴西",
                "label": "巴西",
                "num": "907600"
            },
            {
                "value": "伯利兹",
                "label": "伯利兹",
                "num": "908400"
            },
            {
                "value": "英属印度洋领地",
                "label": "英属印度洋领地",
                "num": "908600"
            },
            {
                "value": "所罗门群岛",
                "label": "所罗门群岛",
                "num": "909000"
            },
            {
                "value": "英属维尔京群岛",
                "label": "英属维尔京群岛",
                "num": "909200"
            },
            {
                "value": "文莱",
                "label": "文莱",
                "num": "909600"
            },
            {
                "value": "保加利亚",
                "label": "保加利亚",
                "num": "910000"
            }
        ]
    }
]
export default address